; ModuleID = 'src/rmdir.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [36 x i8] c"Usage: %s [OPTION]... DIRECTORY...\0A\00", align 1
@.str.2 = private unnamed_addr constant [48 x i8] c"Remove the DIRECTORY(ies), if they are empty.\0A\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 56, type: !63, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !42, globals: !47, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/rmdir.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5a459e166db9bc86eb1f418ddcaeb865")
!4 = !{!5, !20, !35}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 42, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 46, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!23 = !DIEnumerator(name: "_ISupper", value: 256)
!24 = !DIEnumerator(name: "_ISlower", value: 512)
!25 = !DIEnumerator(name: "_ISalpha", value: 1024)
!26 = !DIEnumerator(name: "_ISdigit", value: 2048)
!27 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!28 = !DIEnumerator(name: "_ISspace", value: 8192)
!29 = !DIEnumerator(name: "_ISprint", value: 16384)
!30 = !DIEnumerator(name: "_ISgraph", value: 32768)
!31 = !DIEnumerator(name: "_ISblank", value: 1)
!32 = !DIEnumerator(name: "_IScntrl", value: 2)
!33 = !DIEnumerator(name: "_ISpunct", value: 4)
!34 = !DIEnumerator(name: "_ISalnum", value: 8)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 299, baseType: !37, size: 32, elements: !38)
!36 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!37 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!38 = !{!39, !40, !41}
!39 = !DIEnumerator(name: "DS_UNKNOWN", value: -2)
!40 = !DIEnumerator(name: "DS_EMPTY", value: -1)
!41 = !DIEnumerator(name: "DS_NONEMPTY", value: 0)
!42 = !{!43, !45, !37, !46}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!47 = !{!48, !51, !53, !55, !0}
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "remove_empty_parents", scope: !2, file: !3, line: 40, type: !50, isLocal: true, isDefinition: true)
!50 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "ignore_fail_on_non_empty", scope: !2, file: !3, line: 44, type: !50, isLocal: true, isDefinition: true)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 47, type: !50, isLocal: true, isDefinition: true)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !57, file: !36, line: 575, type: !37, isLocal: true, isDefinition: true)
!57 = distinct !DISubprogram(name: "oputs_", scope: !36, file: !36, line: 573, type: !58, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !62)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60, !60}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!62 = !{}
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 1792, elements: !73)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !66, line: 50, size: 256, elements: !67)
!66 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!67 = !{!68, !69, !70, !72}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !66, line: 52, baseType: !60, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !65, file: !66, line: 55, baseType: !37, size: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !65, file: !66, line: 56, baseType: !71, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !65, file: !66, line: 57, baseType: !37, size: 32, offset: 192)
!73 = !{!74}
!74 = !DISubrange(count: 7)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "Version", scope: !77, file: !78, line: 3, type: !60, isLocal: false, isDefinition: true)
!77 = distinct !DICompileUnit(language: DW_LANG_C99, file: !78, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !79, splitDebugInlining: false, nameTableKind: None)
!78 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!79 = !{!75}
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "file_name", scope: !82, file: !83, line: 45, type: !60, isLocal: true, isDefinition: true)
!82 = distinct !DICompileUnit(language: DW_LANG_C99, file: !83, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !84, splitDebugInlining: false, nameTableKind: None)
!83 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!84 = !{!80, !85}
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !82, file: !83, line: 55, type: !50, isLocal: true, isDefinition: true)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !89, file: !90, line: 66, type: !118, isLocal: false, isDefinition: true)
!89 = distinct !DICompileUnit(language: DW_LANG_C99, file: !90, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !91, globals: !92, splitDebugInlining: false, nameTableKind: None)
!90 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!91 = !{!45}
!92 = !{!93, !112, !87, !114, !116}
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "old_file_name", scope: !95, file: !90, line: 304, type: !60, isLocal: true, isDefinition: true)
!95 = distinct !DISubprogram(name: "verror_at_line", scope: !90, file: !90, line: 298, type: !96, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !89, retainedNodes: !62)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !37, !37, !60, !7, !60, !98}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !99, line: 52, baseType: !100)
!99 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !101, line: 32, baseType: !102)
!101 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !103, baseType: !104)
!103 = !DIFile(filename: "lib/error.c", directory: "/src")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !105, size: 256, elements: !106)
!105 = !DINamespace(name: "std", scope: null)
!106 = !{!107, !108, !109, !110, !111}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !104, file: !103, baseType: !45, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !104, file: !103, baseType: !45, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !104, file: !103, baseType: !45, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !104, file: !103, baseType: !37, size: 32, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !104, file: !103, baseType: !37, size: 32, offset: 224)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "old_line_number", scope: !95, file: !90, line: 305, type: !7, isLocal: true, isDefinition: true)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "error_message_count", scope: !89, file: !90, line: 69, type: !7, isLocal: false, isDefinition: true)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !89, file: !90, line: 295, type: !37, isLocal: false, isDefinition: true)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{null}
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "program_name", scope: !123, file: !124, line: 31, type: !60, isLocal: false, isDefinition: true)
!123 = distinct !DICompileUnit(language: DW_LANG_C99, file: !124, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !125, globals: !126, splitDebugInlining: false, nameTableKind: None)
!124 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!125 = !{!43}
!126 = !{!121}
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "utf07FF", scope: !129, file: !130, line: 46, type: !135, isLocal: true, isDefinition: true)
!129 = distinct !DISubprogram(name: "proper_name_lite", scope: !130, file: !130, line: 38, type: !131, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !133, retainedNodes: !62)
!130 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!131 = !DISubroutineType(types: !132)
!132 = !{!60, !60, !60}
!133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !130, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !134, splitDebugInlining: false, nameTableKind: None)
!134 = !{!127}
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 16, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 2)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !140, file: !141, line: 76, type: !197, isLocal: false, isDefinition: true)
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, retainedTypes: !148, globals: !152, splitDebugInlining: false, nameTableKind: None)
!141 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!142 = !{!5, !143, !20}
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 254, baseType: !7, size: 32, elements: !144)
!144 = !{!145, !146, !147}
!145 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!146 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!147 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!148 = !{!37, !46, !149}
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !150, line: 46, baseType: !151)
!150 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!151 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!152 = !{!138, !153, !159, !171, !173, !178, !186, !193, !195}
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !140, file: !141, line: 92, type: !155, isLocal: false, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 320, elements: !157)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!157 = !{!158}
!158 = !DISubrange(count: 10)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !140, file: !141, line: 1040, type: !161, isLocal: false, isDefinition: true)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !141, line: 56, size: 448, elements: !162)
!162 = !{!163, !164, !165, !169, !170}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !161, file: !141, line: 59, baseType: !5, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !161, file: !141, line: 62, baseType: !37, size: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !161, file: !141, line: 66, baseType: !166, size: 256, offset: 64)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 8)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !161, file: !141, line: 69, baseType: !60, size: 64, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !161, file: !141, line: 72, baseType: !60, size: 64, offset: 384)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !140, file: !141, line: 107, type: !161, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "slot0", scope: !140, file: !141, line: 831, type: !175, isLocal: true, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 2048, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 256)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "quote", scope: !180, file: !141, line: 228, type: !183, isLocal: true, isDefinition: true)
!180 = distinct !DISubprogram(name: "gettext_quote", scope: !141, file: !141, line: 197, type: !181, scopeLine: 198, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !140, retainedNodes: !62)
!181 = !DISubroutineType(types: !182)
!182 = !{!60, !60, !5}
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 64, elements: !184)
!184 = !{!137, !185}
!185 = !DISubrange(count: 4)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "slotvec", scope: !140, file: !141, line: 834, type: !188, isLocal: true, isDefinition: true)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !141, line: 823, size: 128, elements: !190)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !189, file: !141, line: 825, baseType: !149, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !189, file: !141, line: 826, baseType: !43, size: 64, offset: 64)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "nslots", scope: !140, file: !141, line: 832, type: !37, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "slotvec0", scope: !140, file: !141, line: 833, type: !189, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 704, elements: !199)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!199 = !{!200}
!200 = !DISubrange(count: 11)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !203, file: !204, line: 26, type: !206, isLocal: false, isDefinition: true)
!203 = distinct !DICompileUnit(language: DW_LANG_C99, file: !204, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !205, splitDebugInlining: false, nameTableKind: None)
!204 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!205 = !{!201}
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 376, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 47)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "exit_failure", scope: !211, file: !212, line: 24, type: !214, isLocal: false, isDefinition: true)
!211 = distinct !DICompileUnit(language: DW_LANG_C99, file: !212, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !213, splitDebugInlining: false, nameTableKind: None)
!212 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!213 = !{!209}
!214 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !37)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "internal_state", scope: !217, file: !218, line: 97, type: !222, isLocal: true, isDefinition: true)
!217 = distinct !DICompileUnit(language: DW_LANG_C99, file: !218, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !219, globals: !221, splitDebugInlining: false, nameTableKind: None)
!218 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!219 = !{!45, !149, !220}
!220 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!221 = !{!215}
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !223, line: 6, baseType: !224)
!223 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !225, line: 21, baseType: !226)
!225 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !225, line: 13, size: 64, elements: !227)
!227 = !{!228, !229}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !226, file: !225, line: 15, baseType: !37, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !226, file: !225, line: 20, baseType: !230, size: 32, offset: 32)
!230 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !226, file: !225, line: 16, size: 32, elements: !231)
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !230, file: !225, line: 18, baseType: !7, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !230, file: !225, line: 19, baseType: !234, size: 32)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 32, elements: !235)
!235 = !{!185}
!236 = distinct !DICompileUnit(language: DW_LANG_C99, file: !237, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!237 = !DIFile(filename: "src/prog-fprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8f170eec0f5223b6ba3ae07aa753e06a")
!238 = distinct !DICompileUnit(language: DW_LANG_C99, file: !239, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!239 = !DIFile(filename: "lib/stripslash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "128a5f12cafc5019074f64cf3b3d799b")
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!241 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!242 = distinct !DICompileUnit(language: DW_LANG_C99, file: !243, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!243 = !DIFile(filename: "lib/issymlink.c", directory: "/src", checksumkind: CSK_MD5, checksum: "971f6ebbc93e0e649479d305e27f7e21")
!244 = distinct !DICompileUnit(language: DW_LANG_C99, file: !245, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!245 = !DIFile(filename: "lib/streq.c", directory: "/src", checksumkind: CSK_MD5, checksum: "912b0bbb2168195104931254916871aa")
!246 = distinct !DICompileUnit(language: DW_LANG_C99, file: !247, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !248, retainedTypes: !91, splitDebugInlining: false, nameTableKind: None)
!247 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!248 = !{!249}
!249 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !247, line: 40, baseType: !7, size: 32, elements: !250)
!250 = !{!251}
!251 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!252 = distinct !DICompileUnit(language: DW_LANG_C99, file: !253, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !254, retainedTypes: !271, splitDebugInlining: false, nameTableKind: None)
!253 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!254 = !{!255, !262}
!255 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !256, file: !253, line: 188, baseType: !7, size: 32, elements: !260)
!256 = distinct !DISubprogram(name: "x2nrealloc", scope: !253, file: !253, line: 176, type: !257, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !252, retainedNodes: !62)
!257 = !DISubroutineType(types: !258)
!258 = !{!45, !45, !259, !149}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!260 = !{!261}
!261 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!262 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !263, file: !253, line: 228, baseType: !7, size: 32, elements: !260)
!263 = distinct !DISubprogram(name: "xpalloc", scope: !253, file: !253, line: 223, type: !264, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !252, retainedNodes: !62)
!264 = !DISubroutineType(types: !265)
!265 = !{!45, !45, !266, !267, !269, !267}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !268, line: 130, baseType: !269)
!268 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !150, line: 35, baseType: !270)
!270 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!271 = !{!43, !45, !50, !270, !151}
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!273 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!274 = distinct !DICompileUnit(language: DW_LANG_C99, file: !275, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !125, splitDebugInlining: false, nameTableKind: None)
!275 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !277, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!277 = !DIFile(filename: "lib/c32isprint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aac58442c7952a27a6ecb1773b2ef569")
!278 = distinct !DICompileUnit(language: DW_LANG_C99, file: !279, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!279 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!280 = distinct !DICompileUnit(language: DW_LANG_C99, file: !281, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!281 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!282 = distinct !DICompileUnit(language: DW_LANG_C99, file: !283, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !91, splitDebugInlining: false, nameTableKind: None)
!283 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!284 = distinct !DICompileUnit(language: DW_LANG_C99, file: !285, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !91, splitDebugInlining: false, nameTableKind: None)
!285 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !91, splitDebugInlining: false, nameTableKind: None)
!287 = !DIFile(filename: "lib/ialloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e1d85861a0099c22cc583b5eb5f30423")
!288 = distinct !DICompileUnit(language: DW_LANG_C99, file: !289, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!289 = !DIFile(filename: "lib/mbszero.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1b51b91fccd359a867925f7b0fc988a4")
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!291 = !DIFile(filename: "lib/memeq.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9bf299a5d27acbe732c4d2f0d9a2144a")
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!293 = !DIFile(filename: "lib/realloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a76cd3b708f695a3bf546d626aa758d")
!294 = distinct !DICompileUnit(language: DW_LANG_C99, file: !295, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !296, splitDebugInlining: false, nameTableKind: None)
!295 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!296 = !{!50, !151, !45}
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!300 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !91, splitDebugInlining: false, nameTableKind: None)
!302 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!303 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!304 = !{i32 7, !"Dwarf Version", i32 5}
!305 = !{i32 2, !"Debug Info Version", i32 3}
!306 = !{i32 1, !"wchar_size", i32 4}
!307 = !{i32 1, !"branch-target-enforcement", i32 0}
!308 = !{i32 1, !"sign-return-address", i32 0}
!309 = !{i32 1, !"sign-return-address-all", i32 0}
!310 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!311 = !{i32 7, !"PIC Level", i32 2}
!312 = !{i32 7, !"PIE Level", i32 2}
!313 = !{i32 7, !"uwtable", i32 1}
!314 = !{i32 7, !"frame-pointer", i32 1}
!315 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 166, type: !316, scopeLine: 167, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !62)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !37}
!318 = !DILocalVariable(name: "status", arg: 1, scope: !315, file: !3, line: 166, type: !37)
!319 = !DILocation(line: 166, column: 12, scope: !315)
!320 = !DILocation(line: 168, column: 7, scope: !321)
!321 = distinct !DILexicalBlock(scope: !315, file: !3, line: 168, column: 7)
!322 = !DILocation(line: 168, column: 14, scope: !321)
!323 = !DILocation(line: 168, column: 7, scope: !315)
!324 = !DILocation(line: 169, column: 5, scope: !321)
!325 = !DILocation(line: 169, column: 5, scope: !326)
!326 = distinct !DILexicalBlock(scope: !321, file: !3, line: 169, column: 5)
!327 = !DILocation(line: 172, column: 15, scope: !328)
!328 = distinct !DILexicalBlock(scope: !321, file: !3, line: 171, column: 5)
!329 = !DILocation(line: 172, column: 58, scope: !328)
!330 = !DILocation(line: 172, column: 7, scope: !328)
!331 = !DILocation(line: 173, column: 7, scope: !328)
!332 = !DILocation(line: 177, column: 7, scope: !328)
!333 = !DILocation(line: 181, column: 7, scope: !328)
!334 = !DILocation(line: 186, column: 7, scope: !328)
!335 = !DILocation(line: 190, column: 7, scope: !328)
!336 = !DILocation(line: 191, column: 7, scope: !328)
!337 = !DILocation(line: 192, column: 7, scope: !328)
!338 = !DILocation(line: 194, column: 9, scope: !315)
!339 = !DILocation(line: 194, column: 3, scope: !315)
!340 = !DILocalVariable(name: "program", arg: 1, scope: !57, file: !36, line: 573, type: !60)
!341 = !DILocation(line: 573, column: 34, scope: !57)
!342 = !DILocalVariable(name: "option", arg: 2, scope: !57, file: !36, line: 573, type: !60)
!343 = !DILocation(line: 573, column: 55, scope: !57)
!344 = !DILocation(line: 581, column: 7, scope: !345)
!345 = distinct !DILexicalBlock(scope: !57, file: !36, line: 581, column: 7)
!346 = !DILocation(line: 581, column: 19, scope: !345)
!347 = !DILocation(line: 581, column: 7, scope: !57)
!348 = !DILocalVariable(name: "term", scope: !349, file: !36, line: 585, type: !60)
!349 = distinct !DILexicalBlock(scope: !345, file: !36, line: 582, column: 5)
!350 = !DILocation(line: 585, column: 19, scope: !349)
!351 = !DILocation(line: 585, column: 26, scope: !349)
!352 = !DILocation(line: 586, column: 23, scope: !349)
!353 = !DILocation(line: 586, column: 28, scope: !349)
!354 = !DILocation(line: 586, column: 33, scope: !349)
!355 = !DILocation(line: 586, column: 32, scope: !349)
!356 = !DILocation(line: 586, column: 38, scope: !349)
!357 = !DILocation(line: 586, column: 48, scope: !349)
!358 = !DILocation(line: 586, column: 41, scope: !349)
!359 = !DILocation(line: 586, column: 19, scope: !349)
!360 = !DILocation(line: 587, column: 5, scope: !349)
!361 = !DILocation(line: 588, column: 7, scope: !362)
!362 = distinct !DILexicalBlock(scope: !57, file: !36, line: 588, column: 7)
!363 = !DILocation(line: 588, column: 7, scope: !57)
!364 = !DILocation(line: 590, column: 7, scope: !365)
!365 = distinct !DILexicalBlock(scope: !362, file: !36, line: 589, column: 5)
!366 = !DILocation(line: 591, column: 7, scope: !365)
!367 = !DILocalVariable(name: "double_space", scope: !57, file: !36, line: 594, type: !50)
!368 = !DILocation(line: 594, column: 8, scope: !57)
!369 = !DILocalVariable(name: "first_word", scope: !57, file: !36, line: 595, type: !60)
!370 = !DILocation(line: 595, column: 15, scope: !57)
!371 = !DILocation(line: 595, column: 28, scope: !57)
!372 = !DILocation(line: 595, column: 45, scope: !57)
!373 = !DILocation(line: 595, column: 37, scope: !57)
!374 = !DILocation(line: 595, column: 35, scope: !57)
!375 = !DILocalVariable(name: "option_text", scope: !57, file: !36, line: 596, type: !60)
!376 = !DILocation(line: 596, column: 15, scope: !57)
!377 = !DILocation(line: 596, column: 37, scope: !57)
!378 = !DILocation(line: 596, column: 29, scope: !57)
!379 = !DILocation(line: 597, column: 8, scope: !380)
!380 = distinct !DILexicalBlock(scope: !57, file: !36, line: 597, column: 7)
!381 = !DILocation(line: 597, column: 7, scope: !57)
!382 = !DILocation(line: 599, column: 21, scope: !383)
!383 = distinct !DILexicalBlock(scope: !380, file: !36, line: 598, column: 5)
!384 = !DILocation(line: 599, column: 19, scope: !383)
!385 = !DILocation(line: 602, column: 20, scope: !383)
!386 = !DILocation(line: 603, column: 5, scope: !383)
!387 = !DILocation(line: 604, column: 12, scope: !388)
!388 = distinct !DILexicalBlock(scope: !380, file: !36, line: 604, column: 12)
!389 = !DILocation(line: 604, column: 27, scope: !388)
!390 = !DILocation(line: 604, column: 24, scope: !388)
!391 = !DILocation(line: 604, column: 12, scope: !380)
!392 = !DILocalVariable(name: "s", scope: !393, file: !36, line: 608, type: !60)
!393 = distinct !DILexicalBlock(scope: !388, file: !36, line: 605, column: 5)
!394 = !DILocation(line: 608, column: 19, scope: !393)
!395 = !DILocation(line: 608, column: 23, scope: !393)
!396 = !DILocalVariable(name: "spaces", scope: !393, file: !36, line: 609, type: !149)
!397 = !DILocation(line: 609, column: 14, scope: !393)
!398 = !DILocation(line: 610, column: 7, scope: !393)
!399 = !DILocation(line: 610, column: 14, scope: !393)
!400 = !DILocation(line: 610, column: 18, scope: !393)
!401 = !DILocation(line: 610, column: 16, scope: !393)
!402 = !DILocation(line: 610, column: 30, scope: !393)
!403 = !DILocation(line: 610, column: 33, scope: !393)
!404 = !DILocation(line: 610, column: 40, scope: !393)
!405 = !DILocation(line: 0, scope: !393)
!406 = !DILocation(line: 611, column: 21, scope: !393)
!407 = !DILocation(line: 611, column: 20, scope: !393)
!408 = !DILocation(line: 611, column: 19, scope: !393)
!409 = !DILocation(line: 611, column: 16, scope: !393)
!410 = distinct !{!410, !398, !406, !411}
!411 = !{!"llvm.loop.mustprogress"}
!412 = !DILocation(line: 612, column: 11, scope: !413)
!413 = distinct !DILexicalBlock(scope: !393, file: !36, line: 612, column: 11)
!414 = !DILocation(line: 612, column: 18, scope: !413)
!415 = !DILocation(line: 612, column: 11, scope: !393)
!416 = !DILocation(line: 615, column: 25, scope: !417)
!417 = distinct !DILexicalBlock(scope: !413, file: !36, line: 613, column: 9)
!418 = !DILocation(line: 615, column: 23, scope: !417)
!419 = !DILocation(line: 616, column: 24, scope: !417)
!420 = !DILocation(line: 617, column: 9, scope: !417)
!421 = !DILocation(line: 618, column: 5, scope: !393)
!422 = !DILocalVariable(name: "anchor_len", scope: !57, file: !36, line: 620, type: !149)
!423 = !DILocation(line: 620, column: 10, scope: !57)
!424 = !DILocation(line: 620, column: 32, scope: !57)
!425 = !DILocation(line: 620, column: 23, scope: !57)
!426 = !DILocalVariable(name: "desc_text", scope: !57, file: !36, line: 625, type: !60)
!427 = !DILocation(line: 625, column: 15, scope: !57)
!428 = !DILocation(line: 625, column: 27, scope: !57)
!429 = !DILocation(line: 625, column: 41, scope: !57)
!430 = !DILocation(line: 625, column: 39, scope: !57)
!431 = !DILocation(line: 626, column: 3, scope: !57)
!432 = !DILocation(line: 626, column: 11, scope: !57)
!433 = !DILocation(line: 626, column: 10, scope: !57)
!434 = !DILocation(line: 626, column: 21, scope: !57)
!435 = !DILocation(line: 626, column: 25, scope: !57)
!436 = !DILocation(line: 626, column: 24, scope: !57)
!437 = !DILocation(line: 626, column: 35, scope: !57)
!438 = !DILocation(line: 0, scope: !57)
!439 = !DILocation(line: 628, column: 12, scope: !440)
!440 = distinct !DILexicalBlock(scope: !441, file: !36, line: 628, column: 11)
!441 = distinct !DILexicalBlock(scope: !57, file: !36, line: 627, column: 5)
!442 = !DILocation(line: 628, column: 11, scope: !440)
!443 = !DILocation(line: 628, column: 22, scope: !440)
!444 = !DILocation(line: 628, column: 29, scope: !440)
!445 = !DILocation(line: 628, column: 34, scope: !440)
!446 = !DILocation(line: 628, column: 44, scope: !440)
!447 = !DILocation(line: 628, column: 32, scope: !440)
!448 = !DILocation(line: 628, column: 49, scope: !440)
!449 = !DILocation(line: 628, column: 11, scope: !441)
!450 = !DILocation(line: 629, column: 22, scope: !440)
!451 = !DILocation(line: 629, column: 9, scope: !440)
!452 = !DILocation(line: 630, column: 11, scope: !453)
!453 = distinct !DILexicalBlock(scope: !441, file: !36, line: 630, column: 11)
!454 = !DILocation(line: 630, column: 11, scope: !441)
!455 = !DILocation(line: 632, column: 16, scope: !456)
!456 = distinct !DILexicalBlock(scope: !457, file: !36, line: 632, column: 15)
!457 = distinct !DILexicalBlock(scope: !453, file: !36, line: 631, column: 9)
!458 = !DILocation(line: 632, column: 15, scope: !456)
!459 = !DILocation(line: 632, column: 26, scope: !456)
!460 = !DILocation(line: 632, column: 34, scope: !456)
!461 = !DILocation(line: 632, column: 37, scope: !456)
!462 = !DILocation(line: 632, column: 15, scope: !457)
!463 = !DILocation(line: 633, column: 13, scope: !456)
!464 = !DILocation(line: 636, column: 16, scope: !465)
!465 = distinct !DILexicalBlock(scope: !457, file: !36, line: 636, column: 15)
!466 = !DILocation(line: 636, column: 29, scope: !465)
!467 = !DILocation(line: 636, column: 34, scope: !465)
!468 = !DILocation(line: 636, column: 44, scope: !465)
!469 = !DILocation(line: 636, column: 32, scope: !465)
!470 = !DILocation(line: 636, column: 49, scope: !465)
!471 = !DILocation(line: 636, column: 15, scope: !457)
!472 = !DILocation(line: 637, column: 13, scope: !465)
!473 = !DILocation(line: 638, column: 9, scope: !457)
!474 = !DILocation(line: 640, column: 16, scope: !441)
!475 = distinct !{!475, !431, !476, !411}
!476 = !DILocation(line: 641, column: 5, scope: !57)
!477 = !DILocation(line: 644, column: 3, scope: !57)
!478 = !DILocalVariable(name: "url_program", scope: !57, file: !36, line: 648, type: !60)
!479 = !DILocation(line: 648, column: 15, scope: !57)
!480 = !DILocation(line: 648, column: 38, scope: !57)
!481 = !DILocation(line: 648, column: 31, scope: !57)
!482 = !DILocation(line: 649, column: 38, scope: !57)
!483 = !DILocation(line: 649, column: 31, scope: !57)
!484 = !DILocation(line: 650, column: 38, scope: !57)
!485 = !DILocation(line: 650, column: 31, scope: !57)
!486 = !DILocation(line: 651, column: 38, scope: !57)
!487 = !DILocation(line: 651, column: 31, scope: !57)
!488 = !DILocation(line: 652, column: 38, scope: !57)
!489 = !DILocation(line: 652, column: 31, scope: !57)
!490 = !DILocation(line: 653, column: 38, scope: !57)
!491 = !DILocation(line: 653, column: 31, scope: !57)
!492 = !DILocation(line: 654, column: 38, scope: !57)
!493 = !DILocation(line: 654, column: 31, scope: !57)
!494 = !DILocation(line: 655, column: 38, scope: !57)
!495 = !DILocation(line: 655, column: 31, scope: !57)
!496 = !DILocation(line: 656, column: 38, scope: !57)
!497 = !DILocation(line: 656, column: 31, scope: !57)
!498 = !DILocation(line: 657, column: 38, scope: !57)
!499 = !DILocation(line: 657, column: 31, scope: !57)
!500 = !DILocation(line: 658, column: 31, scope: !57)
!501 = !DILocation(line: 663, column: 7, scope: !502)
!502 = distinct !DILexicalBlock(scope: !57, file: !36, line: 663, column: 7)
!503 = !DILocation(line: 664, column: 7, scope: !502)
!504 = !DILocation(line: 664, column: 10, scope: !502)
!505 = !DILocation(line: 663, column: 7, scope: !57)
!506 = !DILocation(line: 670, column: 15, scope: !507)
!507 = distinct !DILexicalBlock(scope: !502, file: !36, line: 665, column: 5)
!508 = !DILocation(line: 670, column: 28, scope: !507)
!509 = !DILocation(line: 670, column: 47, scope: !507)
!510 = !DILocation(line: 670, column: 41, scope: !507)
!511 = !DILocation(line: 670, column: 59, scope: !507)
!512 = !DILocation(line: 669, column: 7, scope: !507)
!513 = !DILocation(line: 671, column: 5, scope: !507)
!514 = !DILocation(line: 676, column: 48, scope: !515)
!515 = distinct !DILexicalBlock(scope: !502, file: !36, line: 673, column: 5)
!516 = !DILocation(line: 677, column: 21, scope: !515)
!517 = !DILocation(line: 677, column: 15, scope: !515)
!518 = !DILocation(line: 677, column: 33, scope: !515)
!519 = !DILocation(line: 676, column: 7, scope: !515)
!520 = !DILocation(line: 679, column: 3, scope: !57)
!521 = !DILocation(line: 683, column: 3, scope: !57)
!522 = !DILocation(line: 686, column: 3, scope: !57)
!523 = !DILocation(line: 688, column: 3, scope: !57)
!524 = !DILocation(line: 691, column: 3, scope: !57)
!525 = !DILocation(line: 695, column: 3, scope: !57)
!526 = !DILocation(line: 696, column: 1, scope: !57)
!527 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !36, file: !36, line: 836, type: !528, scopeLine: 837, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !62)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !60}
!530 = !DILocalVariable(name: "program", arg: 1, scope: !527, file: !36, line: 836, type: !60)
!531 = !DILocation(line: 836, column: 34, scope: !527)
!532 = !DILocalVariable(name: "infomap", scope: !527, file: !36, line: 838, type: !533)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 896, elements: !73)
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !527, file: !36, line: 838, size: 128, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !535, file: !36, line: 838, baseType: !60, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !535, file: !36, line: 838, baseType: !60, size: 64, offset: 64)
!539 = !DILocation(line: 838, column: 67, scope: !527)
!540 = !DILocalVariable(name: "node", scope: !527, file: !36, line: 848, type: !60)
!541 = !DILocation(line: 848, column: 15, scope: !527)
!542 = !DILocation(line: 848, column: 22, scope: !527)
!543 = !DILocalVariable(name: "map_prog", scope: !527, file: !36, line: 849, type: !544)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!545 = !DILocation(line: 849, column: 25, scope: !527)
!546 = !DILocation(line: 849, column: 36, scope: !527)
!547 = !DILocation(line: 851, column: 3, scope: !527)
!548 = !DILocation(line: 851, column: 10, scope: !527)
!549 = !DILocation(line: 851, column: 20, scope: !527)
!550 = !DILocation(line: 851, column: 28, scope: !527)
!551 = !DILocation(line: 851, column: 40, scope: !527)
!552 = !DILocation(line: 851, column: 49, scope: !527)
!553 = !DILocation(line: 851, column: 59, scope: !527)
!554 = !DILocation(line: 851, column: 33, scope: !527)
!555 = !DILocation(line: 851, column: 31, scope: !527)
!556 = !DILocation(line: 0, scope: !527)
!557 = !DILocation(line: 852, column: 13, scope: !527)
!558 = distinct !{!558, !547, !557, !411}
!559 = !DILocation(line: 854, column: 7, scope: !560)
!560 = distinct !DILexicalBlock(scope: !527, file: !36, line: 854, column: 7)
!561 = !DILocation(line: 854, column: 17, scope: !560)
!562 = !DILocation(line: 854, column: 7, scope: !527)
!563 = !DILocation(line: 855, column: 12, scope: !560)
!564 = !DILocation(line: 855, column: 22, scope: !560)
!565 = !DILocation(line: 855, column: 10, scope: !560)
!566 = !DILocation(line: 855, column: 5, scope: !560)
!567 = !DILocation(line: 857, column: 3, scope: !527)
!568 = !DILocalVariable(name: "lc_messages", scope: !527, file: !36, line: 861, type: !60)
!569 = !DILocation(line: 861, column: 15, scope: !527)
!570 = !DILocation(line: 861, column: 29, scope: !527)
!571 = !DILocation(line: 862, column: 7, scope: !572)
!572 = distinct !DILexicalBlock(scope: !527, file: !36, line: 862, column: 7)
!573 = !DILocation(line: 862, column: 19, scope: !572)
!574 = !DILocation(line: 862, column: 22, scope: !572)
!575 = !DILocation(line: 862, column: 7, scope: !527)
!576 = !DILocation(line: 868, column: 7, scope: !577)
!577 = distinct !DILexicalBlock(scope: !572, file: !36, line: 863, column: 5)
!578 = !DILocation(line: 870, column: 5, scope: !577)
!579 = !DILocalVariable(name: "url_program", scope: !527, file: !36, line: 874, type: !60)
!580 = !DILocation(line: 874, column: 15, scope: !527)
!581 = !DILocation(line: 874, column: 36, scope: !527)
!582 = !DILocation(line: 874, column: 29, scope: !527)
!583 = !DILocation(line: 874, column: 61, scope: !527)
!584 = !DILocation(line: 875, column: 11, scope: !527)
!585 = !DILocation(line: 876, column: 24, scope: !527)
!586 = !DILocation(line: 875, column: 3, scope: !527)
!587 = !DILocation(line: 877, column: 11, scope: !527)
!588 = !DILocation(line: 878, column: 11, scope: !527)
!589 = !DILocation(line: 878, column: 17, scope: !527)
!590 = !DILocation(line: 878, column: 25, scope: !527)
!591 = !DILocation(line: 878, column: 22, scope: !527)
!592 = !DILocation(line: 877, column: 3, scope: !527)
!593 = !DILocation(line: 879, column: 1, scope: !527)
!594 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 198, type: !595, scopeLine: 199, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !62)
!595 = !DISubroutineType(types: !596)
!596 = !{!37, !37, !597}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!598 = !DILocalVariable(name: "argc", arg: 1, scope: !594, file: !3, line: 198, type: !37)
!599 = !DILocation(line: 198, column: 11, scope: !594)
!600 = !DILocalVariable(name: "argv", arg: 2, scope: !594, file: !3, line: 198, type: !597)
!601 = !DILocation(line: 198, column: 24, scope: !594)
!602 = !DILocation(line: 201, column: 21, scope: !594)
!603 = !DILocation(line: 201, column: 3, scope: !594)
!604 = !DILocation(line: 202, column: 3, scope: !594)
!605 = !DILocation(line: 203, column: 3, scope: !594)
!606 = !DILocation(line: 204, column: 3, scope: !594)
!607 = !DILocation(line: 206, column: 3, scope: !594)
!608 = !DILocalVariable(name: "optc", scope: !594, file: !3, line: 208, type: !37)
!609 = !DILocation(line: 208, column: 7, scope: !594)
!610 = !DILocation(line: 209, column: 3, scope: !594)
!611 = !DILocation(line: 209, column: 31, scope: !594)
!612 = !DILocation(line: 209, column: 37, scope: !594)
!613 = !DILocation(line: 209, column: 18, scope: !594)
!614 = !DILocation(line: 209, column: 16, scope: !594)
!615 = !DILocation(line: 209, column: 66, scope: !594)
!616 = !DILocation(line: 211, column: 15, scope: !617)
!617 = distinct !DILexicalBlock(scope: !594, file: !3, line: 210, column: 5)
!618 = !DILocation(line: 211, column: 7, scope: !617)
!619 = !DILocation(line: 214, column: 32, scope: !620)
!620 = distinct !DILexicalBlock(scope: !617, file: !3, line: 212, column: 9)
!621 = !DILocation(line: 215, column: 11, scope: !620)
!622 = !DILocation(line: 217, column: 36, scope: !620)
!623 = !DILocation(line: 218, column: 11, scope: !620)
!624 = !DILocation(line: 220, column: 19, scope: !620)
!625 = !DILocation(line: 221, column: 11, scope: !620)
!626 = !DILocation(line: 222, column: 9, scope: !620)
!627 = !DILocation(line: 223, column: 9, scope: !620)
!628 = !DILocation(line: 225, column: 11, scope: !620)
!629 = distinct !{!629, !610, !630, !411}
!630 = !DILocation(line: 227, column: 5, scope: !594)
!631 = !DILocation(line: 229, column: 7, scope: !632)
!632 = distinct !DILexicalBlock(scope: !594, file: !3, line: 229, column: 7)
!633 = !DILocation(line: 229, column: 17, scope: !632)
!634 = !DILocation(line: 229, column: 14, scope: !632)
!635 = !DILocation(line: 229, column: 7, scope: !594)
!636 = !DILocation(line: 231, column: 7, scope: !637)
!637 = distinct !DILexicalBlock(scope: !632, file: !3, line: 230, column: 5)
!638 = !DILocation(line: 232, column: 7, scope: !637)
!639 = !DILocalVariable(name: "ok", scope: !594, file: !3, line: 235, type: !50)
!640 = !DILocation(line: 235, column: 8, scope: !594)
!641 = !DILocation(line: 236, column: 3, scope: !594)
!642 = !DILocation(line: 236, column: 10, scope: !643)
!643 = distinct !DILexicalBlock(scope: !644, file: !3, line: 236, column: 3)
!644 = distinct !DILexicalBlock(scope: !594, file: !3, line: 236, column: 3)
!645 = !DILocation(line: 236, column: 19, scope: !643)
!646 = !DILocation(line: 236, column: 17, scope: !643)
!647 = !DILocation(line: 236, column: 3, scope: !644)
!648 = !DILocalVariable(name: "dir", scope: !649, file: !3, line: 238, type: !43)
!649 = distinct !DILexicalBlock(scope: !643, file: !3, line: 237, column: 5)
!650 = !DILocation(line: 238, column: 13, scope: !649)
!651 = !DILocation(line: 238, column: 19, scope: !649)
!652 = !DILocation(line: 238, column: 24, scope: !649)
!653 = !DILocation(line: 241, column: 11, scope: !654)
!654 = distinct !DILexicalBlock(scope: !649, file: !3, line: 241, column: 11)
!655 = !DILocation(line: 241, column: 11, scope: !649)
!656 = !DILocation(line: 242, column: 23, scope: !654)
!657 = !DILocation(line: 242, column: 31, scope: !654)
!658 = !DILocation(line: 242, column: 60, scope: !654)
!659 = !DILocation(line: 242, column: 9, scope: !654)
!660 = !DILocation(line: 244, column: 18, scope: !661)
!661 = distinct !DILexicalBlock(scope: !649, file: !3, line: 244, column: 11)
!662 = !DILocation(line: 244, column: 11, scope: !661)
!663 = !DILocation(line: 244, column: 23, scope: !661)
!664 = !DILocation(line: 244, column: 11, scope: !649)
!665 = !DILocalVariable(name: "rmdir_errno", scope: !666, file: !3, line: 246, type: !37)
!666 = distinct !DILexicalBlock(scope: !661, file: !3, line: 245, column: 9)
!667 = !DILocation(line: 246, column: 15, scope: !666)
!668 = !DILocation(line: 246, column: 29, scope: !666)
!669 = !DILocation(line: 247, column: 34, scope: !670)
!670 = distinct !DILexicalBlock(scope: !666, file: !3, line: 247, column: 15)
!671 = !DILocation(line: 247, column: 47, scope: !670)
!672 = !DILocation(line: 247, column: 15, scope: !670)
!673 = !DILocation(line: 247, column: 15, scope: !666)
!674 = !DILocation(line: 248, column: 13, scope: !670)
!675 = !DILocalVariable(name: "custom_error", scope: !666, file: !3, line: 255, type: !50)
!676 = !DILocation(line: 255, column: 16, scope: !666)
!677 = !DILocation(line: 256, column: 15, scope: !678)
!678 = distinct !DILexicalBlock(scope: !666, file: !3, line: 256, column: 15)
!679 = !DILocation(line: 256, column: 27, scope: !678)
!680 = !DILocation(line: 256, column: 15, scope: !666)
!681 = !DILocalVariable(name: "last_unix_slash", scope: !682, file: !3, line: 258, type: !60)
!682 = distinct !DILexicalBlock(scope: !678, file: !3, line: 257, column: 13)
!683 = !DILocation(line: 258, column: 27, scope: !682)
!684 = !DILocation(line: 258, column: 54, scope: !682)
!685 = !DILocation(line: 258, column: 45, scope: !682)
!686 = !DILocation(line: 259, column: 19, scope: !687)
!687 = distinct !DILexicalBlock(scope: !682, file: !3, line: 259, column: 19)
!688 = !DILocation(line: 259, column: 35, scope: !687)
!689 = !DILocation(line: 259, column: 41, scope: !687)
!690 = !DILocation(line: 259, column: 57, scope: !687)
!691 = !DILocation(line: 259, column: 39, scope: !687)
!692 = !DILocation(line: 259, column: 62, scope: !687)
!693 = !DILocation(line: 259, column: 19, scope: !682)
!694 = !DILocalVariable(name: "st", scope: !695, file: !3, line: 261, type: !696)
!695 = distinct !DILexicalBlock(scope: !687, file: !3, line: 260, column: 17)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !697, line: 44, size: 1024, elements: !698)
!697 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!698 = !{!699, !702, !704, !706, !708, !710, !712, !713, !714, !716, !718, !719, !721, !729, !730, !731}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !696, file: !697, line: 46, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !701, line: 145, baseType: !151)
!701 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!702 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !696, file: !697, line: 47, baseType: !703, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !701, line: 148, baseType: !151)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !696, file: !697, line: 48, baseType: !705, size: 32, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !701, line: 150, baseType: !7)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !696, file: !697, line: 49, baseType: !707, size: 32, offset: 160)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !701, line: 151, baseType: !7)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !696, file: !697, line: 50, baseType: !709, size: 32, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !701, line: 146, baseType: !7)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !696, file: !697, line: 51, baseType: !711, size: 32, offset: 224)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !701, line: 147, baseType: !7)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !696, file: !697, line: 52, baseType: !700, size: 64, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !696, file: !697, line: 53, baseType: !700, size: 64, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !696, file: !697, line: 54, baseType: !715, size: 64, offset: 384)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !701, line: 152, baseType: !270)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !696, file: !697, line: 55, baseType: !717, size: 32, offset: 448)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !701, line: 175, baseType: !37)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !696, file: !697, line: 56, baseType: !37, size: 32, offset: 480)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !696, file: !697, line: 57, baseType: !720, size: 64, offset: 512)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !701, line: 180, baseType: !270)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !696, file: !697, line: 65, baseType: !722, size: 128, offset: 576)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !723, line: 11, size: 128, elements: !724)
!723 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!724 = !{!725, !727}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !722, file: !723, line: 16, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !701, line: 160, baseType: !270)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !722, file: !723, line: 21, baseType: !728, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !701, line: 197, baseType: !270)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !696, file: !697, line: 66, baseType: !722, size: 128, offset: 704)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !696, file: !697, line: 67, baseType: !722, size: 128, offset: 832)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !696, file: !697, line: 79, baseType: !732, size: 64, offset: 960)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 64, elements: !136)
!733 = !DILocation(line: 261, column: 31, scope: !695)
!734 = !DILocalVariable(name: "ret", scope: !695, file: !3, line: 262, type: !37)
!735 = !DILocation(line: 262, column: 23, scope: !695)
!736 = !DILocation(line: 262, column: 35, scope: !695)
!737 = !DILocation(line: 262, column: 29, scope: !695)
!738 = !DILocation(line: 264, column: 24, scope: !739)
!739 = distinct !DILexicalBlock(scope: !695, file: !3, line: 264, column: 23)
!740 = !DILocation(line: 264, column: 28, scope: !739)
!741 = !DILocation(line: 264, column: 33, scope: !739)
!742 = !DILocation(line: 264, column: 36, scope: !739)
!743 = !DILocation(line: 264, column: 42, scope: !739)
!744 = !DILocation(line: 265, column: 23, scope: !739)
!745 = !DILocation(line: 265, column: 27, scope: !739)
!746 = !DILocation(line: 265, column: 31, scope: !739)
!747 = !DILocation(line: 265, column: 36, scope: !739)
!748 = !DILocation(line: 265, column: 39, scope: !739)
!749 = !DILocation(line: 264, column: 23, scope: !695)
!750 = !DILocalVariable(name: "dir_arg", scope: !751, file: !3, line: 268, type: !43)
!751 = distinct !DILexicalBlock(scope: !739, file: !3, line: 266, column: 21)
!752 = !DILocation(line: 268, column: 29, scope: !751)
!753 = !DILocation(line: 268, column: 48, scope: !751)
!754 = !DILocation(line: 268, column: 39, scope: !751)
!755 = !DILocation(line: 269, column: 47, scope: !751)
!756 = !DILocation(line: 269, column: 23, scope: !751)
!757 = !DILocation(line: 270, column: 38, scope: !758)
!758 = distinct !DILexicalBlock(scope: !751, file: !3, line: 270, column: 27)
!759 = !DILocation(line: 270, column: 27, scope: !758)
!760 = !DILocation(line: 270, column: 43, scope: !758)
!761 = !DILocation(line: 270, column: 27, scope: !751)
!762 = !DILocation(line: 272, column: 27, scope: !763)
!763 = distinct !DILexicalBlock(scope: !758, file: !3, line: 271, column: 25)
!764 = !DILocation(line: 276, column: 40, scope: !763)
!765 = !DILocation(line: 277, column: 25, scope: !763)
!766 = !DILocation(line: 278, column: 29, scope: !751)
!767 = !DILocation(line: 278, column: 23, scope: !751)
!768 = !DILocation(line: 279, column: 21, scope: !751)
!769 = !DILocation(line: 280, column: 17, scope: !695)
!770 = !DILocation(line: 281, column: 13, scope: !682)
!771 = !DILocation(line: 283, column: 17, scope: !772)
!772 = distinct !DILexicalBlock(scope: !666, file: !3, line: 283, column: 15)
!773 = !DILocation(line: 283, column: 15, scope: !666)
!774 = !DILocation(line: 284, column: 13, scope: !772)
!775 = !DILocation(line: 286, column: 14, scope: !666)
!776 = !DILocation(line: 287, column: 9, scope: !666)
!777 = !DILocation(line: 288, column: 16, scope: !778)
!778 = distinct !DILexicalBlock(scope: !661, file: !3, line: 288, column: 16)
!779 = !DILocation(line: 288, column: 16, scope: !661)
!780 = !DILocation(line: 290, column: 33, scope: !781)
!781 = distinct !DILexicalBlock(scope: !778, file: !3, line: 289, column: 9)
!782 = !DILocation(line: 290, column: 17, scope: !781)
!783 = !DILocation(line: 290, column: 14, scope: !781)
!784 = !DILocation(line: 291, column: 9, scope: !781)
!785 = !DILocation(line: 292, column: 5, scope: !649)
!786 = !DILocation(line: 236, column: 25, scope: !643)
!787 = !DILocation(line: 236, column: 3, scope: !643)
!788 = distinct !{!788, !647, !789, !411}
!789 = !DILocation(line: 292, column: 5, scope: !644)
!790 = !DILocation(line: 294, column: 10, scope: !594)
!791 = !DILocation(line: 294, column: 3, scope: !594)
!792 = distinct !DISubprogram(name: "ignorable_failure", scope: !3, file: !3, line: 99, type: !793, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !62)
!793 = !DISubroutineType(types: !794)
!794 = !{!50, !37, !60}
!795 = !DILocalVariable(name: "error_number", arg: 1, scope: !792, file: !3, line: 99, type: !37)
!796 = !DILocation(line: 99, column: 24, scope: !792)
!797 = !DILocalVariable(name: "dir", arg: 2, scope: !792, file: !3, line: 99, type: !60)
!798 = !DILocation(line: 99, column: 50, scope: !792)
!799 = !DILocation(line: 101, column: 11, scope: !792)
!800 = !DILocation(line: 102, column: 11, scope: !792)
!801 = !DILocation(line: 102, column: 38, scope: !792)
!802 = !DILocation(line: 102, column: 15, scope: !792)
!803 = !DILocation(line: 103, column: 15, scope: !792)
!804 = !DILocation(line: 103, column: 43, scope: !792)
!805 = !DILocation(line: 103, column: 19, scope: !792)
!806 = !DILocation(line: 104, column: 19, scope: !792)
!807 = !DILocation(line: 104, column: 50, scope: !792)
!808 = !DILocation(line: 104, column: 22, scope: !792)
!809 = !DILocation(line: 104, column: 55, scope: !792)
!810 = !DILocation(line: 0, scope: !792)
!811 = !DILocation(line: 101, column: 3, scope: !792)
!812 = distinct !DISubprogram(name: "remove_parents", scope: !3, file: !3, line: 113, type: !813, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !62)
!813 = !DISubroutineType(types: !814)
!814 = !{!50, !43}
!815 = !DILocalVariable(name: "dir", arg: 1, scope: !812, file: !3, line: 113, type: !43)
!816 = !DILocation(line: 113, column: 23, scope: !812)
!817 = !DILocalVariable(name: "ok", scope: !812, file: !3, line: 115, type: !50)
!818 = !DILocation(line: 115, column: 8, scope: !812)
!819 = !DILocation(line: 117, column: 27, scope: !812)
!820 = !DILocation(line: 117, column: 3, scope: !812)
!821 = !DILocation(line: 118, column: 3, scope: !812)
!822 = !DILocalVariable(name: "slash", scope: !823, file: !3, line: 120, type: !43)
!823 = distinct !DILexicalBlock(scope: !812, file: !3, line: 119, column: 5)
!824 = !DILocation(line: 120, column: 13, scope: !823)
!825 = !DILocation(line: 120, column: 30, scope: !823)
!826 = !DILocation(line: 120, column: 21, scope: !823)
!827 = !DILocation(line: 121, column: 11, scope: !828)
!828 = distinct !DILexicalBlock(scope: !823, file: !3, line: 121, column: 11)
!829 = !DILocation(line: 121, column: 17, scope: !828)
!830 = !DILocation(line: 121, column: 11, scope: !823)
!831 = !DILocation(line: 122, column: 9, scope: !828)
!832 = !DILocation(line: 125, column: 7, scope: !823)
!833 = !DILocation(line: 125, column: 14, scope: !823)
!834 = !DILocation(line: 125, column: 22, scope: !823)
!835 = !DILocation(line: 125, column: 20, scope: !823)
!836 = !DILocation(line: 125, column: 26, scope: !823)
!837 = !DILocation(line: 125, column: 30, scope: !823)
!838 = !DILocation(line: 125, column: 29, scope: !823)
!839 = !DILocation(line: 125, column: 36, scope: !823)
!840 = !DILocation(line: 0, scope: !823)
!841 = !DILocation(line: 126, column: 9, scope: !823)
!842 = distinct !{!842, !832, !843, !411}
!843 = !DILocation(line: 126, column: 11, scope: !823)
!844 = !DILocation(line: 127, column: 7, scope: !823)
!845 = !DILocation(line: 127, column: 16, scope: !823)
!846 = !DILocation(line: 130, column: 11, scope: !847)
!847 = distinct !DILexicalBlock(scope: !823, file: !3, line: 130, column: 11)
!848 = !DILocation(line: 130, column: 11, scope: !823)
!849 = !DILocation(line: 131, column: 23, scope: !847)
!850 = !DILocation(line: 131, column: 31, scope: !847)
!851 = !DILocation(line: 131, column: 60, scope: !847)
!852 = !DILocation(line: 131, column: 9, scope: !847)
!853 = !DILocation(line: 133, column: 20, scope: !823)
!854 = !DILocation(line: 133, column: 13, scope: !823)
!855 = !DILocation(line: 133, column: 25, scope: !823)
!856 = !DILocation(line: 133, column: 10, scope: !823)
!857 = !DILocalVariable(name: "rmdir_errno", scope: !823, file: !3, line: 134, type: !37)
!858 = !DILocation(line: 134, column: 11, scope: !823)
!859 = !DILocation(line: 134, column: 25, scope: !823)
!860 = !DILocation(line: 136, column: 13, scope: !861)
!861 = distinct !DILexicalBlock(scope: !823, file: !3, line: 136, column: 11)
!862 = !DILocation(line: 136, column: 11, scope: !823)
!863 = !DILocation(line: 139, column: 34, scope: !864)
!864 = distinct !DILexicalBlock(scope: !865, file: !3, line: 139, column: 15)
!865 = distinct !DILexicalBlock(scope: !861, file: !3, line: 137, column: 9)
!866 = !DILocation(line: 139, column: 47, scope: !864)
!867 = !DILocation(line: 139, column: 15, scope: !864)
!868 = !DILocation(line: 139, column: 15, scope: !865)
!869 = !DILocation(line: 141, column: 18, scope: !870)
!870 = distinct !DILexicalBlock(scope: !864, file: !3, line: 140, column: 13)
!871 = !DILocation(line: 142, column: 13, scope: !870)
!872 = !DILocalVariable(name: "error_msg", scope: !873, file: !3, line: 145, type: !60)
!873 = distinct !DILexicalBlock(scope: !864, file: !3, line: 144, column: 13)
!874 = !DILocation(line: 145, column: 27, scope: !873)
!875 = !DILocation(line: 146, column: 19, scope: !876)
!876 = distinct !DILexicalBlock(scope: !873, file: !3, line: 146, column: 19)
!877 = !DILocation(line: 146, column: 31, scope: !876)
!878 = !DILocation(line: 146, column: 19, scope: !873)
!879 = !DILocation(line: 150, column: 29, scope: !880)
!880 = distinct !DILexicalBlock(scope: !876, file: !3, line: 147, column: 17)
!881 = !DILocation(line: 151, column: 17, scope: !880)
!882 = !DILocation(line: 155, column: 29, scope: !883)
!883 = distinct !DILexicalBlock(scope: !876, file: !3, line: 153, column: 17)
!884 = !DILocation(line: 157, column: 15, scope: !873)
!885 = !DILocation(line: 159, column: 11, scope: !865)
!886 = distinct !{!886, !821, !887}
!887 = !DILocation(line: 161, column: 5, scope: !812)
!888 = !DILocation(line: 162, column: 10, scope: !812)
!889 = !DILocation(line: 162, column: 3, scope: !812)
!890 = distinct !DISubprogram(name: "errno_rmdir_non_empty", scope: !3, file: !3, line: 74, type: !891, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !62)
!891 = !DISubroutineType(types: !892)
!892 = !{!50, !37}
!893 = !DILocalVariable(name: "error_number", arg: 1, scope: !890, file: !3, line: 74, type: !37)
!894 = !DILocation(line: 74, column: 28, scope: !890)
!895 = !DILocation(line: 76, column: 10, scope: !890)
!896 = !DILocation(line: 76, column: 23, scope: !890)
!897 = !DILocation(line: 76, column: 36, scope: !890)
!898 = !DILocation(line: 76, column: 39, scope: !890)
!899 = !DILocation(line: 76, column: 52, scope: !890)
!900 = !DILocation(line: 76, column: 3, scope: !890)
!901 = distinct !DISubprogram(name: "errno_may_be_non_empty", scope: !3, file: !3, line: 82, type: !891, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !62)
!902 = !DILocalVariable(name: "error_number", arg: 1, scope: !901, file: !3, line: 82, type: !37)
!903 = !DILocation(line: 82, column: 29, scope: !901)
!904 = !DILocation(line: 84, column: 11, scope: !901)
!905 = !DILocation(line: 84, column: 3, scope: !901)
!906 = !DILocation(line: 90, column: 7, scope: !907)
!907 = distinct !DILexicalBlock(scope: !901, file: !3, line: 85, column: 5)
!908 = !DILocation(line: 92, column: 7, scope: !907)
!909 = !DILocation(line: 94, column: 1, scope: !901)
!910 = distinct !DISubprogram(name: "directory_status", scope: !36, file: !36, line: 305, type: !911, scopeLine: 306, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !62)
!911 = !DISubroutineType(types: !912)
!912 = !{!37, !37, !60}
!913 = !DILocalVariable(name: "fd_cwd", arg: 1, scope: !910, file: !36, line: 305, type: !37)
!914 = !DILocation(line: 305, column: 23, scope: !910)
!915 = !DILocalVariable(name: "dir", arg: 2, scope: !910, file: !36, line: 305, type: !60)
!916 = !DILocation(line: 305, column: 43, scope: !910)
!917 = !DILocalVariable(name: "dirp", scope: !910, file: !36, line: 307, type: !918)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !920, line: 127, baseType: !921)
!920 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !920, line: 127, flags: DIFlagFwdDecl)
!922 = !DILocation(line: 307, column: 8, scope: !910)
!923 = !DILocalVariable(name: "no_direntries", scope: !910, file: !36, line: 308, type: !50)
!924 = !DILocation(line: 308, column: 8, scope: !910)
!925 = !DILocalVariable(name: "saved_errno", scope: !910, file: !36, line: 309, type: !37)
!926 = !DILocation(line: 309, column: 7, scope: !910)
!927 = !DILocalVariable(name: "fd", scope: !910, file: !36, line: 310, type: !37)
!928 = !DILocation(line: 310, column: 7, scope: !910)
!929 = !DILocation(line: 310, column: 20, scope: !910)
!930 = !DILocation(line: 310, column: 28, scope: !910)
!931 = !DILocation(line: 310, column: 12, scope: !910)
!932 = !DILocation(line: 314, column: 7, scope: !933)
!933 = distinct !DILexicalBlock(scope: !910, file: !36, line: 314, column: 7)
!934 = !DILocation(line: 314, column: 10, scope: !933)
!935 = !DILocation(line: 314, column: 7, scope: !910)
!936 = !DILocation(line: 315, column: 12, scope: !933)
!937 = !DILocation(line: 315, column: 5, scope: !933)
!938 = !DILocation(line: 317, column: 21, scope: !910)
!939 = !DILocation(line: 317, column: 10, scope: !910)
!940 = !DILocation(line: 317, column: 8, scope: !910)
!941 = !DILocation(line: 318, column: 7, scope: !942)
!942 = distinct !DILexicalBlock(scope: !910, file: !36, line: 318, column: 7)
!943 = !DILocation(line: 318, column: 12, scope: !942)
!944 = !DILocation(line: 318, column: 7, scope: !910)
!945 = !DILocation(line: 320, column: 21, scope: !946)
!946 = distinct !DILexicalBlock(scope: !942, file: !36, line: 319, column: 5)
!947 = !DILocation(line: 320, column: 19, scope: !946)
!948 = !DILocation(line: 321, column: 14, scope: !946)
!949 = !DILocation(line: 321, column: 7, scope: !946)
!950 = !DILocation(line: 322, column: 14, scope: !946)
!951 = !DILocation(line: 322, column: 7, scope: !946)
!952 = !DILocation(line: 325, column: 3, scope: !910)
!953 = !DILocation(line: 325, column: 9, scope: !910)
!954 = !DILocation(line: 326, column: 53, scope: !910)
!955 = !DILocation(line: 326, column: 20, scope: !910)
!956 = !DILocation(line: 326, column: 19, scope: !910)
!957 = !DILocation(line: 326, column: 17, scope: !910)
!958 = !DILocation(line: 327, column: 17, scope: !910)
!959 = !DILocation(line: 327, column: 15, scope: !910)
!960 = !DILocation(line: 328, column: 13, scope: !910)
!961 = !DILocation(line: 328, column: 3, scope: !910)
!962 = !DILocation(line: 329, column: 10, scope: !910)
!963 = !DILocation(line: 329, column: 24, scope: !910)
!964 = !DILocation(line: 329, column: 27, scope: !910)
!965 = !DILocation(line: 329, column: 39, scope: !910)
!966 = !DILocation(line: 329, column: 57, scope: !910)
!967 = !DILocation(line: 329, column: 3, scope: !910)
!968 = !DILocation(line: 330, column: 1, scope: !910)
!969 = distinct !DISubprogram(name: "readdir_ignoring_dot_and_dotdot", scope: !36, file: !36, line: 285, type: !970, scopeLine: 286, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !62)
!970 = !DISubroutineType(types: !971)
!971 = !{!972, !918}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !975, line: 22, size: 2240, elements: !976)
!975 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "bc8b10a1ddd2747862e3ae7b91dbf464")
!976 = !{!977, !978, !979, !980, !981}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !974, file: !975, line: 25, baseType: !703, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !974, file: !975, line: 26, baseType: !715, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !974, file: !975, line: 31, baseType: !46, size: 16, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !974, file: !975, line: 32, baseType: !220, size: 8, offset: 144)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !974, file: !975, line: 33, baseType: !175, size: 2048, offset: 152)
!982 = !DILocalVariable(name: "dirp", arg: 1, scope: !969, file: !36, line: 285, type: !918)
!983 = !DILocation(line: 285, column: 39, scope: !969)
!984 = !DILocation(line: 287, column: 3, scope: !969)
!985 = !DILocalVariable(name: "dp", scope: !986, file: !36, line: 289, type: !972)
!986 = distinct !DILexicalBlock(scope: !969, file: !36, line: 288, column: 5)
!987 = !DILocation(line: 289, column: 28, scope: !986)
!988 = !DILocation(line: 289, column: 42, scope: !986)
!989 = !DILocation(line: 289, column: 33, scope: !986)
!990 = !DILocation(line: 290, column: 11, scope: !991)
!991 = distinct !DILexicalBlock(scope: !986, file: !36, line: 290, column: 11)
!992 = !DILocation(line: 290, column: 14, scope: !991)
!993 = !DILocation(line: 290, column: 22, scope: !991)
!994 = !DILocation(line: 290, column: 42, scope: !991)
!995 = !DILocation(line: 290, column: 46, scope: !991)
!996 = !DILocation(line: 290, column: 27, scope: !991)
!997 = !DILocation(line: 290, column: 11, scope: !986)
!998 = !DILocation(line: 291, column: 16, scope: !991)
!999 = !DILocation(line: 291, column: 9, scope: !991)
!1000 = distinct !{!1000, !984, !1001}
!1001 = !DILocation(line: 292, column: 5, scope: !969)
!1002 = distinct !DISubprogram(name: "dot_or_dotdot", scope: !36, file: !36, line: 272, type: !1003, scopeLine: 273, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !62)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!50, !60}
!1005 = !DILocalVariable(name: "file_name", arg: 1, scope: !1002, file: !36, line: 272, type: !60)
!1006 = !DILocation(line: 272, column: 28, scope: !1002)
!1007 = !DILocation(line: 274, column: 7, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1002, file: !36, line: 274, column: 7)
!1009 = !DILocation(line: 274, column: 20, scope: !1008)
!1010 = !DILocation(line: 274, column: 7, scope: !1002)
!1011 = !DILocalVariable(name: "sep", scope: !1012, file: !36, line: 276, type: !44)
!1012 = distinct !DILexicalBlock(scope: !1008, file: !36, line: 275, column: 5)
!1013 = !DILocation(line: 276, column: 12, scope: !1012)
!1014 = !DILocation(line: 276, column: 18, scope: !1012)
!1015 = !DILocation(line: 276, column: 29, scope: !1012)
!1016 = !DILocation(line: 276, column: 42, scope: !1012)
!1017 = !DILocation(line: 276, column: 50, scope: !1012)
!1018 = !DILocation(line: 277, column: 17, scope: !1012)
!1019 = !DILocation(line: 277, column: 21, scope: !1012)
!1020 = !DILocation(line: 277, column: 24, scope: !1012)
!1021 = !DILocation(line: 277, column: 7, scope: !1012)
!1022 = !DILocation(line: 280, column: 5, scope: !1008)
!1023 = !DILocation(line: 281, column: 1, scope: !1002)
!1024 = distinct !DISubprogram(name: "prog_fprintf", scope: !237, file: !237, line: 28, type: !1025, scopeLine: 29, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !236, retainedNodes: !62)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{null, !1027, !60, null}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1029, line: 7, baseType: !1030)
!1029 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1031, line: 49, size: 1728, elements: !1032)
!1031 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1048, !1050, !1051, !1052, !1053, !1054, !1056, !1060, !1063, !1065, !1068, !1071, !1072, !1073, !1074, !1075}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1030, file: !1031, line: 51, baseType: !37, size: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1030, file: !1031, line: 54, baseType: !43, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1030, file: !1031, line: 55, baseType: !43, size: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1030, file: !1031, line: 56, baseType: !43, size: 64, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1030, file: !1031, line: 57, baseType: !43, size: 64, offset: 256)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1030, file: !1031, line: 58, baseType: !43, size: 64, offset: 320)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1030, file: !1031, line: 59, baseType: !43, size: 64, offset: 384)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1030, file: !1031, line: 60, baseType: !43, size: 64, offset: 448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1030, file: !1031, line: 61, baseType: !43, size: 64, offset: 512)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1030, file: !1031, line: 64, baseType: !43, size: 64, offset: 576)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1030, file: !1031, line: 65, baseType: !43, size: 64, offset: 640)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1030, file: !1031, line: 66, baseType: !43, size: 64, offset: 704)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1030, file: !1031, line: 68, baseType: !1046, size: 64, offset: 768)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1031, line: 36, flags: DIFlagFwdDecl)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1030, file: !1031, line: 70, baseType: !1049, size: 64, offset: 832)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1030, file: !1031, line: 72, baseType: !37, size: 32, offset: 896)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1030, file: !1031, line: 73, baseType: !37, size: 32, offset: 928)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1030, file: !1031, line: 74, baseType: !715, size: 64, offset: 960)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1030, file: !1031, line: 77, baseType: !46, size: 16, offset: 1024)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1030, file: !1031, line: 78, baseType: !1055, size: 8, offset: 1040)
!1055 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1030, file: !1031, line: 79, baseType: !1057, size: 8, offset: 1048)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, elements: !1058)
!1058 = !{!1059}
!1059 = !DISubrange(count: 1)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1030, file: !1031, line: 81, baseType: !1061, size: 64, offset: 1088)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1031, line: 43, baseType: null)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1030, file: !1031, line: 89, baseType: !1064, size: 64, offset: 1152)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !701, line: 153, baseType: !270)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1030, file: !1031, line: 91, baseType: !1066, size: 64, offset: 1216)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1031, line: 37, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1030, file: !1031, line: 92, baseType: !1069, size: 64, offset: 1280)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1031, line: 38, flags: DIFlagFwdDecl)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1030, file: !1031, line: 93, baseType: !1049, size: 64, offset: 1344)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1030, file: !1031, line: 94, baseType: !45, size: 64, offset: 1408)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1030, file: !1031, line: 95, baseType: !149, size: 64, offset: 1472)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1030, file: !1031, line: 96, baseType: !37, size: 32, offset: 1536)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1030, file: !1031, line: 98, baseType: !1076, size: 160, offset: 1568)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !1077)
!1077 = !{!1078}
!1078 = !DISubrange(count: 20)
!1079 = !DILocalVariable(name: "fp", arg: 1, scope: !1024, file: !237, line: 28, type: !1027)
!1080 = !DILocation(line: 28, column: 21, scope: !1024)
!1081 = !DILocalVariable(name: "fmt", arg: 2, scope: !1024, file: !237, line: 28, type: !60)
!1082 = !DILocation(line: 28, column: 37, scope: !1024)
!1083 = !DILocalVariable(name: "ap", scope: !1024, file: !237, line: 30, type: !1084)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !99, line: 52, baseType: !1085)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !101, line: 32, baseType: !1086)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1087, baseType: !1088)
!1087 = !DIFile(filename: "src/prog-fprintf.c", directory: "/src")
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !105, size: 256, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1093, !1094}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1088, file: !1087, line: 30, baseType: !45, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1088, file: !1087, line: 30, baseType: !45, size: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1088, file: !1087, line: 30, baseType: !45, size: 64, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1088, file: !1087, line: 30, baseType: !37, size: 32, offset: 192)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1088, file: !1087, line: 30, baseType: !37, size: 32, offset: 224)
!1095 = !DILocation(line: 30, column: 11, scope: !1024)
!1096 = !DILocation(line: 31, column: 3, scope: !1024)
!1097 = !DILocation(line: 32, column: 3, scope: !1024)
!1098 = !DILocation(line: 33, column: 3, scope: !1024)
!1099 = !DILocation(line: 34, column: 13, scope: !1024)
!1100 = !DILocation(line: 34, column: 17, scope: !1024)
!1101 = !DILocation(line: 34, column: 3, scope: !1024)
!1102 = !DILocation(line: 35, column: 3, scope: !1024)
!1103 = !DILocation(line: 36, column: 3, scope: !1024)
!1104 = !DILocation(line: 37, column: 1, scope: !1024)
!1105 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !83, file: !83, line: 50, type: !528, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !82, retainedNodes: !62)
!1106 = !DILocalVariable(name: "file", arg: 1, scope: !1105, file: !83, line: 50, type: !60)
!1107 = !DILocation(line: 50, column: 41, scope: !1105)
!1108 = !DILocation(line: 52, column: 15, scope: !1105)
!1109 = !DILocation(line: 52, column: 13, scope: !1105)
!1110 = !DILocation(line: 53, column: 1, scope: !1105)
!1111 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !83, file: !83, line: 87, type: !1112, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !82, retainedNodes: !62)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{null, !50}
!1114 = !DILocalVariable(name: "ignore", arg: 1, scope: !1111, file: !83, line: 87, type: !50)
!1115 = !DILocation(line: 87, column: 37, scope: !1111)
!1116 = !DILocation(line: 89, column: 18, scope: !1111)
!1117 = !DILocation(line: 89, column: 16, scope: !1111)
!1118 = !DILocation(line: 90, column: 1, scope: !1111)
!1119 = distinct !DISubprogram(name: "close_stdout", scope: !83, file: !83, line: 116, type: !119, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !82, retainedNodes: !62)
!1120 = !DILocation(line: 118, column: 21, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1119, file: !83, line: 118, column: 7)
!1122 = !DILocation(line: 118, column: 7, scope: !1121)
!1123 = !DILocation(line: 118, column: 29, scope: !1121)
!1124 = !DILocation(line: 119, column: 7, scope: !1121)
!1125 = !DILocation(line: 119, column: 12, scope: !1121)
!1126 = !DILocation(line: 119, column: 25, scope: !1121)
!1127 = !DILocation(line: 119, column: 28, scope: !1121)
!1128 = !DILocation(line: 119, column: 34, scope: !1121)
!1129 = !DILocation(line: 118, column: 7, scope: !1119)
!1130 = !DILocalVariable(name: "write_error", scope: !1131, file: !83, line: 121, type: !60)
!1131 = distinct !DILexicalBlock(scope: !1121, file: !83, line: 120, column: 5)
!1132 = !DILocation(line: 121, column: 19, scope: !1131)
!1133 = !DILocation(line: 121, column: 33, scope: !1131)
!1134 = !DILocation(line: 122, column: 11, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1131, file: !83, line: 122, column: 11)
!1136 = !DILocation(line: 122, column: 11, scope: !1131)
!1137 = !DILocation(line: 123, column: 9, scope: !1135)
!1138 = !DILocation(line: 126, column: 9, scope: !1135)
!1139 = !DILocation(line: 128, column: 14, scope: !1131)
!1140 = !DILocation(line: 128, column: 7, scope: !1131)
!1141 = !DILocation(line: 133, column: 42, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1119, file: !83, line: 133, column: 7)
!1143 = !DILocation(line: 133, column: 28, scope: !1142)
!1144 = !DILocation(line: 133, column: 50, scope: !1142)
!1145 = !DILocation(line: 133, column: 7, scope: !1119)
!1146 = !DILocation(line: 134, column: 12, scope: !1142)
!1147 = !DILocation(line: 134, column: 5, scope: !1142)
!1148 = !DILocation(line: 135, column: 1, scope: !1119)
!1149 = distinct !DISubprogram(name: "strip_trailing_slashes", scope: !239, file: !239, line: 31, type: !813, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !238, retainedNodes: !62)
!1150 = !DILocalVariable(name: "file", arg: 1, scope: !1149, file: !239, line: 31, type: !43)
!1151 = !DILocation(line: 31, column: 31, scope: !1149)
!1152 = !DILocalVariable(name: "base", scope: !1149, file: !239, line: 33, type: !43)
!1153 = !DILocation(line: 33, column: 9, scope: !1149)
!1154 = !DILocation(line: 33, column: 32, scope: !1149)
!1155 = !DILocation(line: 33, column: 16, scope: !1149)
!1156 = !DILocation(line: 37, column: 10, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1149, file: !239, line: 37, column: 7)
!1158 = !DILocation(line: 37, column: 9, scope: !1157)
!1159 = !DILocation(line: 37, column: 7, scope: !1149)
!1160 = !DILocation(line: 38, column: 12, scope: !1157)
!1161 = !DILocation(line: 38, column: 10, scope: !1157)
!1162 = !DILocation(line: 38, column: 5, scope: !1157)
!1163 = !DILocalVariable(name: "base_lim", scope: !1149, file: !239, line: 39, type: !43)
!1164 = !DILocation(line: 39, column: 9, scope: !1149)
!1165 = !DILocation(line: 39, column: 20, scope: !1149)
!1166 = !DILocation(line: 39, column: 37, scope: !1149)
!1167 = !DILocation(line: 39, column: 27, scope: !1149)
!1168 = !DILocation(line: 39, column: 25, scope: !1149)
!1169 = !DILocalVariable(name: "had_slash", scope: !1149, file: !239, line: 40, type: !50)
!1170 = !DILocation(line: 40, column: 8, scope: !1149)
!1171 = !DILocation(line: 40, column: 22, scope: !1149)
!1172 = !DILocation(line: 40, column: 21, scope: !1149)
!1173 = !DILocation(line: 40, column: 31, scope: !1149)
!1174 = !DILocation(line: 41, column: 4, scope: !1149)
!1175 = !DILocation(line: 41, column: 13, scope: !1149)
!1176 = !DILocation(line: 42, column: 10, scope: !1149)
!1177 = !DILocation(line: 42, column: 3, scope: !1149)
!1178 = distinct !DISubprogram(name: "verror", scope: !90, file: !90, line: 251, type: !1179, scopeLine: 253, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !89, retainedNodes: !62)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{null, !37, !37, !60, !98}
!1181 = !DILocalVariable(name: "status", arg: 1, scope: !1178, file: !90, line: 251, type: !37)
!1182 = !DILocation(line: 251, column: 1, scope: !1178)
!1183 = !DILocalVariable(name: "errnum", arg: 2, scope: !1178, file: !90, line: 251, type: !37)
!1184 = !DILocalVariable(name: "message", arg: 3, scope: !1178, file: !90, line: 251, type: !60)
!1185 = !DILocalVariable(name: "args", arg: 4, scope: !1178, file: !90, line: 251, type: !98)
!1186 = !DILocation(line: 261, column: 3, scope: !1178)
!1187 = !DILocation(line: 265, column: 7, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1178, file: !90, line: 265, column: 7)
!1189 = !DILocation(line: 265, column: 7, scope: !1178)
!1190 = !DILocation(line: 266, column: 7, scope: !1188)
!1191 = !DILocation(line: 266, column: 5, scope: !1188)
!1192 = !DILocation(line: 272, column: 16, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1188, file: !90, line: 268, column: 5)
!1194 = !DILocation(line: 272, column: 32, scope: !1193)
!1195 = !DILocation(line: 272, column: 7, scope: !1193)
!1196 = !DILocation(line: 276, column: 3, scope: !1178)
!1197 = !DILocation(line: 282, column: 1, scope: !1178)
!1198 = distinct !DISubprogram(name: "flush_stdout", scope: !90, file: !90, line: 163, type: !119, scopeLine: 164, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !89, retainedNodes: !62)
!1199 = !DILocalVariable(name: "stdout_fd", scope: !1198, file: !90, line: 166, type: !37)
!1200 = !DILocation(line: 166, column: 7, scope: !1198)
!1201 = !DILocation(line: 172, column: 13, scope: !1198)
!1202 = !DILocation(line: 182, column: 12, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1198, file: !90, line: 182, column: 7)
!1204 = !DILocation(line: 182, column: 9, scope: !1203)
!1205 = !DILocation(line: 182, column: 22, scope: !1203)
!1206 = !DILocation(line: 182, column: 34, scope: !1203)
!1207 = !DILocation(line: 182, column: 25, scope: !1203)
!1208 = !DILocation(line: 182, column: 7, scope: !1198)
!1209 = !DILocation(line: 184, column: 5, scope: !1203)
!1210 = !DILocation(line: 185, column: 1, scope: !1198)
!1211 = distinct !DISubprogram(name: "error_tail", scope: !90, file: !90, line: 219, type: !1179, scopeLine: 221, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !89, retainedNodes: !62)
!1212 = !DILocalVariable(name: "status", arg: 1, scope: !1211, file: !90, line: 219, type: !37)
!1213 = !DILocation(line: 219, column: 1, scope: !1211)
!1214 = !DILocalVariable(name: "errnum", arg: 2, scope: !1211, file: !90, line: 219, type: !37)
!1215 = !DILocalVariable(name: "message", arg: 3, scope: !1211, file: !90, line: 219, type: !60)
!1216 = !DILocalVariable(name: "args", arg: 4, scope: !1211, file: !90, line: 219, type: !98)
!1217 = !DILocation(line: 229, column: 13, scope: !1211)
!1218 = !DILocation(line: 229, column: 21, scope: !1211)
!1219 = !DILocation(line: 229, column: 3, scope: !1211)
!1220 = !DILocation(line: 232, column: 3, scope: !1211)
!1221 = !DILocation(line: 233, column: 7, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1211, file: !90, line: 233, column: 7)
!1223 = !DILocation(line: 233, column: 7, scope: !1211)
!1224 = !DILocation(line: 234, column: 26, scope: !1222)
!1225 = !DILocation(line: 234, column: 5, scope: !1222)
!1226 = !DILocation(line: 238, column: 3, scope: !1211)
!1227 = !DILocation(line: 240, column: 3, scope: !1211)
!1228 = !DILocation(line: 241, column: 7, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1211, file: !90, line: 241, column: 7)
!1230 = !DILocation(line: 241, column: 7, scope: !1211)
!1231 = !DILocation(line: 242, column: 11, scope: !1229)
!1232 = !DILocation(line: 242, column: 5, scope: !1229)
!1233 = !DILocation(line: 243, column: 1, scope: !1211)
!1234 = distinct !DISubprogram(name: "print_errno_message", scope: !90, file: !90, line: 188, type: !316, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !89, retainedNodes: !62)
!1235 = !DILocalVariable(name: "errnum", arg: 1, scope: !1234, file: !90, line: 188, type: !37)
!1236 = !DILocation(line: 188, column: 26, scope: !1234)
!1237 = !DILocalVariable(name: "s", scope: !1234, file: !90, line: 190, type: !60)
!1238 = !DILocation(line: 190, column: 15, scope: !1234)
!1239 = !DILocalVariable(name: "errbuf", scope: !1234, file: !90, line: 193, type: !1240)
!1240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8192, elements: !1241)
!1241 = !{!1242}
!1242 = !DISubrange(count: 1024)
!1243 = !DILocation(line: 193, column: 8, scope: !1234)
!1244 = !DILocation(line: 195, column: 21, scope: !1234)
!1245 = !DILocation(line: 195, column: 29, scope: !1234)
!1246 = !DILocation(line: 195, column: 7, scope: !1234)
!1247 = !DILocation(line: 195, column: 5, scope: !1234)
!1248 = !DILocation(line: 207, column: 9, scope: !1249)
!1249 = distinct !DILexicalBlock(scope: !1234, file: !90, line: 207, column: 7)
!1250 = !DILocation(line: 207, column: 7, scope: !1234)
!1251 = !DILocation(line: 208, column: 9, scope: !1249)
!1252 = !DILocation(line: 208, column: 7, scope: !1249)
!1253 = !DILocation(line: 208, column: 5, scope: !1249)
!1254 = !DILocation(line: 214, column: 12, scope: !1234)
!1255 = !DILocation(line: 214, column: 28, scope: !1234)
!1256 = !DILocation(line: 214, column: 3, scope: !1234)
!1257 = !DILocation(line: 216, column: 1, scope: !1234)
!1258 = distinct !DISubprogram(name: "is_open", scope: !90, file: !90, line: 145, type: !1259, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !89, retainedNodes: !62)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!37, !37}
!1261 = !DILocalVariable(name: "fd", arg: 1, scope: !1258, file: !90, line: 145, type: !37)
!1262 = !DILocation(line: 145, column: 14, scope: !1258)
!1263 = !DILocation(line: 157, column: 22, scope: !1258)
!1264 = !DILocation(line: 157, column: 15, scope: !1258)
!1265 = !DILocation(line: 157, column: 12, scope: !1258)
!1266 = !DILocation(line: 157, column: 3, scope: !1258)
!1267 = distinct !DISubprogram(name: "error", scope: !90, file: !90, line: 285, type: !1268, scopeLine: 286, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !89, retainedNodes: !62)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{null, !37, !37, !60, null}
!1270 = !DILocalVariable(name: "status", arg: 1, scope: !1267, file: !90, line: 285, type: !37)
!1271 = !DILocation(line: 285, column: 12, scope: !1267)
!1272 = !DILocalVariable(name: "errnum", arg: 2, scope: !1267, file: !90, line: 285, type: !37)
!1273 = !DILocation(line: 285, column: 24, scope: !1267)
