; ModuleID = 'src/groups.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [37 x i8] c"Usage: %s [OPTION]... [USERNAME]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [155 x i8] c"Print group memberships for each USERNAME or, if no USERNAME is specified, for\0Athe current process (which may differ if the groups database has changed).\0A\00", align 1
@.str.3 = private unnamed_addr constant [7 x i8] c"groups\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 39, type: !37, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !27, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/groups.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d48dc102a9c02fb59e67fc9e395fa6a9")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256)
!10 = !DIEnumerator(name: "_ISlower", value: 512)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!14 = !DIEnumerator(name: "_ISspace", value: 8192)
!15 = !DIEnumerator(name: "_ISprint", value: 16384)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768)
!17 = !DIEnumerator(name: "_ISblank", value: 1)
!18 = !DIEnumerator(name: "_IScntrl", value: 2)
!19 = !DIEnumerator(name: "_ISpunct", value: 4)
!20 = !DIEnumerator(name: "_ISalnum", value: 8)
!21 = !{!22, !24, !25, !26}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!27 = !{!28, !0}
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !30, file: !31, line: 575, type: !25, isLocal: true, isDefinition: true)
!30 = distinct !DISubprogram(name: "oputs_", scope: !31, file: !31, line: 573, type: !32, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !36)
!31 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!32 = !DISubroutineType(types: !33)
!33 = !{null, !34, !34}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!36 = !{}
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 768, elements: !47)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !40, line: 50, size: 256, elements: !41)
!40 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!41 = !{!42, !43, !44, !46}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !39, file: !40, line: 52, baseType: !34, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !39, file: !40, line: 55, baseType: !25, size: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !39, file: !40, line: 56, baseType: !45, size: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !39, file: !40, line: 57, baseType: !25, size: 32, offset: 192)
!47 = !{!48}
!48 = !DISubrange(count: 3)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "Version", scope: !51, file: !52, line: 3, type: !34, isLocal: false, isDefinition: true)
!51 = distinct !DICompileUnit(language: DW_LANG_C99, file: !52, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !53, splitDebugInlining: false, nameTableKind: None)
!52 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!53 = !{!49}
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "file_name", scope: !56, file: !57, line: 45, type: !34, isLocal: true, isDefinition: true)
!56 = distinct !DICompileUnit(language: DW_LANG_C99, file: !57, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !58, splitDebugInlining: false, nameTableKind: None)
!57 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!58 = !{!54, !59}
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !56, file: !57, line: 55, type: !61, isLocal: true, isDefinition: true)
!61 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !64, file: !65, line: 66, type: !93, isLocal: false, isDefinition: true)
!64 = distinct !DICompileUnit(language: DW_LANG_C99, file: !65, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !66, globals: !67, splitDebugInlining: false, nameTableKind: None)
!65 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!66 = !{!24}
!67 = !{!68, !87, !62, !89, !91}
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "old_file_name", scope: !70, file: !65, line: 304, type: !34, isLocal: true, isDefinition: true)
!70 = distinct !DISubprogram(name: "verror_at_line", scope: !65, file: !65, line: 298, type: !71, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !64, retainedNodes: !36)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !25, !25, !34, !7, !34, !73}
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !74, line: 52, baseType: !75)
!74 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !76, line: 32, baseType: !77)
!76 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !78, baseType: !79)
!78 = !DIFile(filename: "lib/error.c", directory: "/src")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !80, size: 256, elements: !81)
!80 = !DINamespace(name: "std", scope: null)
!81 = !{!82, !83, !84, !85, !86}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !79, file: !78, baseType: !24, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !79, file: !78, baseType: !24, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !79, file: !78, baseType: !24, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !79, file: !78, baseType: !25, size: 32, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !79, file: !78, baseType: !25, size: 32, offset: 224)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "old_line_number", scope: !70, file: !65, line: 305, type: !7, isLocal: true, isDefinition: true)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "error_message_count", scope: !64, file: !65, line: 69, type: !7, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !64, file: !65, line: 295, type: !25, isLocal: false, isDefinition: true)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{null}
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "program_name", scope: !98, file: !99, line: 31, type: !34, isLocal: false, isDefinition: true)
!98 = distinct !DICompileUnit(language: DW_LANG_C99, file: !99, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !100, globals: !101, splitDebugInlining: false, nameTableKind: None)
!99 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!100 = !{!22}
!101 = !{!96}
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "utf07FF", scope: !104, file: !105, line: 46, type: !110, isLocal: true, isDefinition: true)
!104 = distinct !DISubprogram(name: "proper_name_lite", scope: !105, file: !105, line: 38, type: !106, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !108, retainedNodes: !36)
!105 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!106 = !DISubroutineType(types: !107)
!107 = !{!34, !34, !34}
!108 = distinct !DICompileUnit(language: DW_LANG_C99, file: !105, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !109, splitDebugInlining: false, nameTableKind: None)
!109 = !{!102}
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 16, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 2)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !115, file: !116, line: 76, type: !186, isLocal: false, isDefinition: true)
!115 = distinct !DICompileUnit(language: DW_LANG_C99, file: !116, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !117, retainedTypes: !137, globals: !141, splitDebugInlining: false, nameTableKind: None)
!116 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!117 = !{!118, !132, !5}
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !119, line: 42, baseType: !7, size: 32, elements: !120)
!119 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131}
!121 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!122 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!123 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!124 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!125 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!126 = !DIEnumerator(name: "c_quoting_style", value: 5)
!127 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!128 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!129 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!130 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!131 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!132 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !119, line: 254, baseType: !7, size: 32, elements: !133)
!133 = !{!134, !135, !136}
!134 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!135 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!136 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!137 = !{!25, !26, !138}
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !139, line: 46, baseType: !140)
!139 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!140 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!141 = !{!113, !142, !148, !160, !162, !167, !175, !182, !184}
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !115, file: !116, line: 92, type: !144, isLocal: false, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 320, elements: !146)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!146 = !{!147}
!147 = !DISubrange(count: 10)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !115, file: !116, line: 1040, type: !150, isLocal: false, isDefinition: true)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !116, line: 56, size: 448, elements: !151)
!151 = !{!152, !153, !154, !158, !159}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !150, file: !116, line: 59, baseType: !118, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !150, file: !116, line: 62, baseType: !25, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !150, file: !116, line: 66, baseType: !155, size: 256, offset: 64)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 8)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !150, file: !116, line: 69, baseType: !34, size: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !150, file: !116, line: 72, baseType: !34, size: 64, offset: 384)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !115, file: !116, line: 107, type: !150, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "slot0", scope: !115, file: !116, line: 831, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2048, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 256)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "quote", scope: !169, file: !116, line: 228, type: !172, isLocal: true, isDefinition: true)
!169 = distinct !DISubprogram(name: "gettext_quote", scope: !116, file: !116, line: 197, type: !170, scopeLine: 198, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !115, retainedNodes: !36)
!170 = !DISubroutineType(types: !171)
!171 = !{!34, !34, !118}
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, elements: !173)
!173 = !{!112, !174}
!174 = !DISubrange(count: 4)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "slotvec", scope: !115, file: !116, line: 834, type: !177, isLocal: true, isDefinition: true)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !116, line: 823, size: 128, elements: !179)
!179 = !{!180, !181}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !178, file: !116, line: 825, baseType: !138, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !178, file: !116, line: 826, baseType: !22, size: 64, offset: 64)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "nslots", scope: !115, file: !116, line: 832, type: !25, isLocal: true, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "slotvec0", scope: !115, file: !116, line: 833, type: !178, isLocal: true, isDefinition: true)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 704, elements: !188)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!188 = !{!189}
!189 = !DISubrange(count: 11)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !192, file: !193, line: 26, type: !195, isLocal: false, isDefinition: true)
!192 = distinct !DICompileUnit(language: DW_LANG_C99, file: !193, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !194, splitDebugInlining: false, nameTableKind: None)
!193 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!194 = !{!190}
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 376, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 47)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "exit_failure", scope: !200, file: !201, line: 24, type: !203, isLocal: false, isDefinition: true)
!200 = distinct !DICompileUnit(language: DW_LANG_C99, file: !201, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !202, splitDebugInlining: false, nameTableKind: None)
!201 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!202 = !{!198}
!203 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !25)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "internal_state", scope: !206, file: !207, line: 97, type: !211, isLocal: true, isDefinition: true)
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !207, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !208, globals: !210, splitDebugInlining: false, nameTableKind: None)
!207 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!208 = !{!24, !138, !209}
!209 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!210 = !{!204}
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !212, line: 6, baseType: !213)
!212 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !214, line: 21, baseType: !215)
!214 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 13, size: 64, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !215, file: !214, line: 15, baseType: !25, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !215, file: !214, line: 20, baseType: !219, size: 32, offset: 32)
!219 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !215, file: !214, line: 16, size: 32, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !219, file: !214, line: 18, baseType: !7, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !219, file: !214, line: 19, baseType: !223, size: 32)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 32, elements: !224)
!224 = !{!174}
!225 = distinct !DICompileUnit(language: DW_LANG_C99, file: !226, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !227, splitDebugInlining: false, nameTableKind: None)
!226 = !DIFile(filename: "src/group-list.c", directory: "/src", checksumkind: CSK_MD5, checksum: "86bc740edd29a2e1277335d35d8d331e")
!227 = !{!24, !228}
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !229, line: 102, baseType: !230)
!229 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !231, line: 73, baseType: !140)
!231 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!232 = distinct !DICompileUnit(language: DW_LANG_C99, file: !233, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!233 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!234 = distinct !DICompileUnit(language: DW_LANG_C99, file: !235, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!235 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!236 = distinct !DICompileUnit(language: DW_LANG_C99, file: !237, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!237 = !DIFile(filename: "lib/streq.c", directory: "/src", checksumkind: CSK_MD5, checksum: "912b0bbb2168195104931254916871aa")
!238 = distinct !DICompileUnit(language: DW_LANG_C99, file: !239, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !240, retainedTypes: !66, splitDebugInlining: false, nameTableKind: None)
!239 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!240 = !{!241}
!241 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !239, line: 40, baseType: !7, size: 32, elements: !242)
!242 = !{!243}
!243 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!244 = distinct !DICompileUnit(language: DW_LANG_C99, file: !245, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !246, retainedTypes: !263, splitDebugInlining: false, nameTableKind: None)
!245 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!246 = !{!247, !254}
!247 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !248, file: !245, line: 188, baseType: !7, size: 32, elements: !252)
!248 = distinct !DISubprogram(name: "x2nrealloc", scope: !245, file: !245, line: 176, type: !249, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !244, retainedNodes: !36)
!249 = !DISubroutineType(types: !250)
!250 = !{!24, !24, !251, !138}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!252 = !{!253}
!253 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!254 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !255, file: !245, line: 228, baseType: !7, size: 32, elements: !252)
!255 = distinct !DISubprogram(name: "xpalloc", scope: !245, file: !245, line: 223, type: !256, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !244, retainedNodes: !36)
!256 = !DISubroutineType(types: !257)
!257 = !{!24, !24, !258, !259, !261, !259}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !260, line: 130, baseType: !261)
!260 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !139, line: 35, baseType: !262)
!262 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!263 = !{!22, !24, !61, !262, !140}
!264 = distinct !DICompileUnit(language: DW_LANG_C99, file: !265, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!265 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!266 = distinct !DICompileUnit(language: DW_LANG_C99, file: !267, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!267 = !DIFile(filename: "lib/xgetgroups.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b5210c3f5d54a118d66836a8f2f46b25")
!268 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!269 = !DIFile(filename: "lib/c32isprint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aac58442c7952a27a6ecb1773b2ef569")
!270 = distinct !DICompileUnit(language: DW_LANG_C99, file: !271, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!271 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!273 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!274 = distinct !DICompileUnit(language: DW_LANG_C99, file: !275, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !66, splitDebugInlining: false, nameTableKind: None)
!275 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !277, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !66, splitDebugInlining: false, nameTableKind: None)
!277 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!278 = distinct !DICompileUnit(language: DW_LANG_C99, file: !279, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !66, splitDebugInlining: false, nameTableKind: None)
!279 = !DIFile(filename: "lib/ialloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e1d85861a0099c22cc583b5eb5f30423")
!280 = distinct !DICompileUnit(language: DW_LANG_C99, file: !281, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!281 = !DIFile(filename: "lib/mbszero.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1b51b91fccd359a867925f7b0fc988a4")
!282 = distinct !DICompileUnit(language: DW_LANG_C99, file: !283, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!283 = !DIFile(filename: "lib/memeq.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9bf299a5d27acbe732c4d2f0d9a2144a")
!284 = distinct !DICompileUnit(language: DW_LANG_C99, file: !285, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !286, retainedTypes: !298, splitDebugInlining: false, nameTableKind: None)
!285 = !DIFile(filename: "lib/mgetgroups.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c6d0df677a26dbd2695c193e3d6de3d1")
!286 = !{!287}
!287 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !288, file: !285, line: 79, baseType: !7, size: 32, elements: !296)
!288 = distinct !DISubprogram(name: "mgetgroups", scope: !285, file: !285, line: 66, type: !289, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !284, retainedNodes: !36)
!289 = !DISubroutineType(types: !290)
!290 = !{!25, !34, !291, !294}
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !292, line: 64, baseType: !293)
!292 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !231, line: 147, baseType: !7)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!296 = !{!297}
!297 = !DIEnumerator(name: "N_GROUPS_INIT", value: 10)
!298 = !{!24, !291}
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!300 = !DIFile(filename: "lib/realloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a76cd3b708f695a3bf546d626aa758d")
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !303, splitDebugInlining: false, nameTableKind: None)
!302 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!303 = !{!61, !140, !24}
!304 = distinct !DICompileUnit(language: DW_LANG_C99, file: !305, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !306, splitDebugInlining: false, nameTableKind: None)
!305 = !DIFile(filename: "lib/getugroups.c", directory: "/src", checksumkind: CSK_MD5, checksum: "133b212624b9afab46cc6a15f2134d44")
!306 = !{!291, !24}
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!308 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!309 = distinct !DICompileUnit(language: DW_LANG_C99, file: !310, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!310 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!311 = distinct !DICompileUnit(language: DW_LANG_C99, file: !312, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !66, splitDebugInlining: false, nameTableKind: None)
!312 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!313 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!314 = !{i32 7, !"Dwarf Version", i32 5}
!315 = !{i32 2, !"Debug Info Version", i32 3}
!316 = !{i32 1, !"wchar_size", i32 4}
!317 = !{i32 1, !"branch-target-enforcement", i32 0}
!318 = !{i32 1, !"sign-return-address", i32 0}
!319 = !{i32 1, !"sign-return-address-all", i32 0}
!320 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!321 = !{i32 7, !"PIC Level", i32 2}
!322 = !{i32 7, !"PIE Level", i32 2}
!323 = !{i32 7, !"uwtable", i32 1}
!324 = !{i32 7, !"frame-pointer", i32 1}
!325 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 47, type: !326, scopeLine: 48, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !36)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !25}
!328 = !DILocalVariable(name: "status", arg: 1, scope: !325, file: !3, line: 47, type: !25)
!329 = !DILocation(line: 47, column: 12, scope: !325)
!330 = !DILocation(line: 49, column: 7, scope: !331)
!331 = distinct !DILexicalBlock(scope: !325, file: !3, line: 49, column: 7)
!332 = !DILocation(line: 49, column: 14, scope: !331)
!333 = !DILocation(line: 49, column: 7, scope: !325)
!334 = !DILocation(line: 50, column: 5, scope: !331)
!335 = !DILocation(line: 50, column: 5, scope: !336)
!336 = distinct !DILexicalBlock(scope: !331, file: !3, line: 50, column: 5)
!337 = !DILocation(line: 53, column: 15, scope: !338)
!338 = distinct !DILexicalBlock(scope: !331, file: !3, line: 52, column: 5)
!339 = !DILocation(line: 53, column: 59, scope: !338)
!340 = !DILocation(line: 53, column: 7, scope: !338)
!341 = !DILocation(line: 54, column: 7, scope: !338)
!342 = !DILocation(line: 59, column: 7, scope: !338)
!343 = !DILocation(line: 60, column: 7, scope: !338)
!344 = !DILocation(line: 61, column: 7, scope: !338)
!345 = !DILocation(line: 63, column: 9, scope: !325)
!346 = !DILocation(line: 63, column: 3, scope: !325)
!347 = !DILocalVariable(name: "program", arg: 1, scope: !30, file: !31, line: 573, type: !34)
!348 = !DILocation(line: 573, column: 34, scope: !30)
!349 = !DILocalVariable(name: "option", arg: 2, scope: !30, file: !31, line: 573, type: !34)
!350 = !DILocation(line: 573, column: 55, scope: !30)
!351 = !DILocation(line: 581, column: 7, scope: !352)
!352 = distinct !DILexicalBlock(scope: !30, file: !31, line: 581, column: 7)
!353 = !DILocation(line: 581, column: 19, scope: !352)
!354 = !DILocation(line: 581, column: 7, scope: !30)
!355 = !DILocalVariable(name: "term", scope: !356, file: !31, line: 585, type: !34)
!356 = distinct !DILexicalBlock(scope: !352, file: !31, line: 582, column: 5)
!357 = !DILocation(line: 585, column: 19, scope: !356)
!358 = !DILocation(line: 585, column: 26, scope: !356)
!359 = !DILocation(line: 586, column: 23, scope: !356)
!360 = !DILocation(line: 586, column: 28, scope: !356)
!361 = !DILocation(line: 586, column: 33, scope: !356)
!362 = !DILocation(line: 586, column: 32, scope: !356)
!363 = !DILocation(line: 586, column: 38, scope: !356)
!364 = !DILocation(line: 586, column: 48, scope: !356)
!365 = !DILocation(line: 586, column: 41, scope: !356)
!366 = !DILocation(line: 586, column: 19, scope: !356)
!367 = !DILocation(line: 587, column: 5, scope: !356)
!368 = !DILocation(line: 588, column: 7, scope: !369)
!369 = distinct !DILexicalBlock(scope: !30, file: !31, line: 588, column: 7)
!370 = !DILocation(line: 588, column: 7, scope: !30)
!371 = !DILocation(line: 590, column: 7, scope: !372)
!372 = distinct !DILexicalBlock(scope: !369, file: !31, line: 589, column: 5)
!373 = !DILocation(line: 591, column: 7, scope: !372)
!374 = !DILocalVariable(name: "double_space", scope: !30, file: !31, line: 594, type: !61)
!375 = !DILocation(line: 594, column: 8, scope: !30)
!376 = !DILocalVariable(name: "first_word", scope: !30, file: !31, line: 595, type: !34)
!377 = !DILocation(line: 595, column: 15, scope: !30)
!378 = !DILocation(line: 595, column: 28, scope: !30)
!379 = !DILocation(line: 595, column: 45, scope: !30)
!380 = !DILocation(line: 595, column: 37, scope: !30)
!381 = !DILocation(line: 595, column: 35, scope: !30)
!382 = !DILocalVariable(name: "option_text", scope: !30, file: !31, line: 596, type: !34)
!383 = !DILocation(line: 596, column: 15, scope: !30)
!384 = !DILocation(line: 596, column: 37, scope: !30)
!385 = !DILocation(line: 596, column: 29, scope: !30)
!386 = !DILocation(line: 597, column: 8, scope: !387)
!387 = distinct !DILexicalBlock(scope: !30, file: !31, line: 597, column: 7)
!388 = !DILocation(line: 597, column: 7, scope: !30)
!389 = !DILocation(line: 599, column: 21, scope: !390)
!390 = distinct !DILexicalBlock(scope: !387, file: !31, line: 598, column: 5)
!391 = !DILocation(line: 599, column: 19, scope: !390)
!392 = !DILocation(line: 602, column: 20, scope: !390)
!393 = !DILocation(line: 603, column: 5, scope: !390)
!394 = !DILocation(line: 604, column: 12, scope: !395)
!395 = distinct !DILexicalBlock(scope: !387, file: !31, line: 604, column: 12)
!396 = !DILocation(line: 604, column: 27, scope: !395)
!397 = !DILocation(line: 604, column: 24, scope: !395)
!398 = !DILocation(line: 604, column: 12, scope: !387)
!399 = !DILocalVariable(name: "s", scope: !400, file: !31, line: 608, type: !34)
!400 = distinct !DILexicalBlock(scope: !395, file: !31, line: 605, column: 5)
!401 = !DILocation(line: 608, column: 19, scope: !400)
!402 = !DILocation(line: 608, column: 23, scope: !400)
!403 = !DILocalVariable(name: "spaces", scope: !400, file: !31, line: 609, type: !138)
!404 = !DILocation(line: 609, column: 14, scope: !400)
!405 = !DILocation(line: 610, column: 7, scope: !400)
!406 = !DILocation(line: 610, column: 14, scope: !400)
!407 = !DILocation(line: 610, column: 18, scope: !400)
!408 = !DILocation(line: 610, column: 16, scope: !400)
!409 = !DILocation(line: 610, column: 30, scope: !400)
!410 = !DILocation(line: 610, column: 33, scope: !400)
!411 = !DILocation(line: 610, column: 40, scope: !400)
!412 = !DILocation(line: 0, scope: !400)
!413 = !DILocation(line: 611, column: 21, scope: !400)
!414 = !DILocation(line: 611, column: 20, scope: !400)
!415 = !DILocation(line: 611, column: 19, scope: !400)
!416 = !DILocation(line: 611, column: 16, scope: !400)
!417 = distinct !{!417, !405, !413, !418}
!418 = !{!"llvm.loop.mustprogress"}
!419 = !DILocation(line: 612, column: 11, scope: !420)
!420 = distinct !DILexicalBlock(scope: !400, file: !31, line: 612, column: 11)
!421 = !DILocation(line: 612, column: 18, scope: !420)
!422 = !DILocation(line: 612, column: 11, scope: !400)
!423 = !DILocation(line: 615, column: 25, scope: !424)
!424 = distinct !DILexicalBlock(scope: !420, file: !31, line: 613, column: 9)
!425 = !DILocation(line: 615, column: 23, scope: !424)
!426 = !DILocation(line: 616, column: 24, scope: !424)
!427 = !DILocation(line: 617, column: 9, scope: !424)
!428 = !DILocation(line: 618, column: 5, scope: !400)
!429 = !DILocalVariable(name: "anchor_len", scope: !30, file: !31, line: 620, type: !138)
!430 = !DILocation(line: 620, column: 10, scope: !30)
!431 = !DILocation(line: 620, column: 32, scope: !30)
!432 = !DILocation(line: 620, column: 23, scope: !30)
!433 = !DILocalVariable(name: "desc_text", scope: !30, file: !31, line: 625, type: !34)
!434 = !DILocation(line: 625, column: 15, scope: !30)
!435 = !DILocation(line: 625, column: 27, scope: !30)
!436 = !DILocation(line: 625, column: 41, scope: !30)
!437 = !DILocation(line: 625, column: 39, scope: !30)
!438 = !DILocation(line: 626, column: 3, scope: !30)
!439 = !DILocation(line: 626, column: 11, scope: !30)
!440 = !DILocation(line: 626, column: 10, scope: !30)
!441 = !DILocation(line: 626, column: 21, scope: !30)
!442 = !DILocation(line: 626, column: 25, scope: !30)
!443 = !DILocation(line: 626, column: 24, scope: !30)
!444 = !DILocation(line: 626, column: 35, scope: !30)
!445 = !DILocation(line: 0, scope: !30)
!446 = !DILocation(line: 628, column: 12, scope: !447)
!447 = distinct !DILexicalBlock(scope: !448, file: !31, line: 628, column: 11)
!448 = distinct !DILexicalBlock(scope: !30, file: !31, line: 627, column: 5)
!449 = !DILocation(line: 628, column: 11, scope: !447)
!450 = !DILocation(line: 628, column: 22, scope: !447)
!451 = !DILocation(line: 628, column: 29, scope: !447)
!452 = !DILocation(line: 628, column: 34, scope: !447)
!453 = !DILocation(line: 628, column: 44, scope: !447)
!454 = !DILocation(line: 628, column: 32, scope: !447)
!455 = !DILocation(line: 628, column: 49, scope: !447)
!456 = !DILocation(line: 628, column: 11, scope: !448)
!457 = !DILocation(line: 629, column: 22, scope: !447)
!458 = !DILocation(line: 629, column: 9, scope: !447)
!459 = !DILocation(line: 630, column: 11, scope: !460)
!460 = distinct !DILexicalBlock(scope: !448, file: !31, line: 630, column: 11)
!461 = !DILocation(line: 630, column: 11, scope: !448)
!462 = !DILocation(line: 632, column: 16, scope: !463)
!463 = distinct !DILexicalBlock(scope: !464, file: !31, line: 632, column: 15)
!464 = distinct !DILexicalBlock(scope: !460, file: !31, line: 631, column: 9)
!465 = !DILocation(line: 632, column: 15, scope: !463)
!466 = !DILocation(line: 632, column: 26, scope: !463)
!467 = !DILocation(line: 632, column: 34, scope: !463)
!468 = !DILocation(line: 632, column: 37, scope: !463)
!469 = !DILocation(line: 632, column: 15, scope: !464)
!470 = !DILocation(line: 633, column: 13, scope: !463)
!471 = !DILocation(line: 636, column: 16, scope: !472)
!472 = distinct !DILexicalBlock(scope: !464, file: !31, line: 636, column: 15)
!473 = !DILocation(line: 636, column: 29, scope: !472)
!474 = !DILocation(line: 636, column: 34, scope: !472)
!475 = !DILocation(line: 636, column: 44, scope: !472)
!476 = !DILocation(line: 636, column: 32, scope: !472)
!477 = !DILocation(line: 636, column: 49, scope: !472)
!478 = !DILocation(line: 636, column: 15, scope: !464)
!479 = !DILocation(line: 637, column: 13, scope: !472)
!480 = !DILocation(line: 638, column: 9, scope: !464)
!481 = !DILocation(line: 640, column: 16, scope: !448)
!482 = distinct !{!482, !438, !483, !418}
!483 = !DILocation(line: 641, column: 5, scope: !30)
!484 = !DILocation(line: 644, column: 3, scope: !30)
!485 = !DILocalVariable(name: "url_program", scope: !30, file: !31, line: 648, type: !34)
!486 = !DILocation(line: 648, column: 15, scope: !30)
!487 = !DILocation(line: 648, column: 38, scope: !30)
!488 = !DILocation(line: 648, column: 31, scope: !30)
!489 = !DILocation(line: 649, column: 38, scope: !30)
!490 = !DILocation(line: 649, column: 31, scope: !30)
!491 = !DILocation(line: 650, column: 38, scope: !30)
!492 = !DILocation(line: 650, column: 31, scope: !30)
!493 = !DILocation(line: 651, column: 38, scope: !30)
!494 = !DILocation(line: 651, column: 31, scope: !30)
!495 = !DILocation(line: 652, column: 38, scope: !30)
!496 = !DILocation(line: 652, column: 31, scope: !30)
!497 = !DILocation(line: 653, column: 38, scope: !30)
!498 = !DILocation(line: 653, column: 31, scope: !30)
!499 = !DILocation(line: 654, column: 38, scope: !30)
!500 = !DILocation(line: 654, column: 31, scope: !30)
!501 = !DILocation(line: 655, column: 38, scope: !30)
!502 = !DILocation(line: 655, column: 31, scope: !30)
!503 = !DILocation(line: 656, column: 38, scope: !30)
!504 = !DILocation(line: 656, column: 31, scope: !30)
!505 = !DILocation(line: 657, column: 38, scope: !30)
!506 = !DILocation(line: 657, column: 31, scope: !30)
!507 = !DILocation(line: 658, column: 31, scope: !30)
!508 = !DILocation(line: 663, column: 7, scope: !509)
!509 = distinct !DILexicalBlock(scope: !30, file: !31, line: 663, column: 7)
!510 = !DILocation(line: 664, column: 7, scope: !509)
!511 = !DILocation(line: 664, column: 10, scope: !509)
!512 = !DILocation(line: 663, column: 7, scope: !30)
!513 = !DILocation(line: 670, column: 15, scope: !514)
!514 = distinct !DILexicalBlock(scope: !509, file: !31, line: 665, column: 5)
!515 = !DILocation(line: 670, column: 28, scope: !514)
!516 = !DILocation(line: 670, column: 47, scope: !514)
!517 = !DILocation(line: 670, column: 41, scope: !514)
!518 = !DILocation(line: 670, column: 59, scope: !514)
!519 = !DILocation(line: 669, column: 7, scope: !514)
!520 = !DILocation(line: 671, column: 5, scope: !514)
!521 = !DILocation(line: 676, column: 48, scope: !522)
!522 = distinct !DILexicalBlock(scope: !509, file: !31, line: 673, column: 5)
!523 = !DILocation(line: 677, column: 21, scope: !522)
!524 = !DILocation(line: 677, column: 15, scope: !522)
!525 = !DILocation(line: 677, column: 33, scope: !522)
!526 = !DILocation(line: 676, column: 7, scope: !522)
!527 = !DILocation(line: 679, column: 3, scope: !30)
!528 = !DILocation(line: 683, column: 3, scope: !30)
!529 = !DILocation(line: 686, column: 3, scope: !30)
!530 = !DILocation(line: 688, column: 3, scope: !30)
!531 = !DILocation(line: 691, column: 3, scope: !30)
!532 = !DILocation(line: 695, column: 3, scope: !30)
!533 = !DILocation(line: 696, column: 1, scope: !30)
!534 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !31, file: !31, line: 836, type: !535, scopeLine: 837, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !36)
!535 = !DISubroutineType(types: !536)
!536 = !{null, !34}
!537 = !DILocalVariable(name: "program", arg: 1, scope: !534, file: !31, line: 836, type: !34)
!538 = !DILocation(line: 836, column: 34, scope: !534)
!539 = !DILocalVariable(name: "infomap", scope: !534, file: !31, line: 838, type: !540)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 896, elements: !546)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !534, file: !31, line: 838, size: 128, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !542, file: !31, line: 838, baseType: !34, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !542, file: !31, line: 838, baseType: !34, size: 64, offset: 64)
!546 = !{!547}
!547 = !DISubrange(count: 7)
!548 = !DILocation(line: 838, column: 67, scope: !534)
!549 = !DILocalVariable(name: "node", scope: !534, file: !31, line: 848, type: !34)
!550 = !DILocation(line: 848, column: 15, scope: !534)
!551 = !DILocation(line: 848, column: 22, scope: !534)
!552 = !DILocalVariable(name: "map_prog", scope: !534, file: !31, line: 849, type: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!554 = !DILocation(line: 849, column: 25, scope: !534)
!555 = !DILocation(line: 849, column: 36, scope: !534)
!556 = !DILocation(line: 851, column: 3, scope: !534)
!557 = !DILocation(line: 851, column: 10, scope: !534)
!558 = !DILocation(line: 851, column: 20, scope: !534)
!559 = !DILocation(line: 851, column: 28, scope: !534)
!560 = !DILocation(line: 851, column: 40, scope: !534)
!561 = !DILocation(line: 851, column: 49, scope: !534)
!562 = !DILocation(line: 851, column: 59, scope: !534)
!563 = !DILocation(line: 851, column: 33, scope: !534)
!564 = !DILocation(line: 851, column: 31, scope: !534)
!565 = !DILocation(line: 0, scope: !534)
!566 = !DILocation(line: 852, column: 13, scope: !534)
!567 = distinct !{!567, !556, !566, !418}
!568 = !DILocation(line: 854, column: 7, scope: !569)
!569 = distinct !DILexicalBlock(scope: !534, file: !31, line: 854, column: 7)
!570 = !DILocation(line: 854, column: 17, scope: !569)
!571 = !DILocation(line: 854, column: 7, scope: !534)
!572 = !DILocation(line: 855, column: 12, scope: !569)
!573 = !DILocation(line: 855, column: 22, scope: !569)
!574 = !DILocation(line: 855, column: 10, scope: !569)
!575 = !DILocation(line: 855, column: 5, scope: !569)
!576 = !DILocation(line: 857, column: 3, scope: !534)
!577 = !DILocalVariable(name: "lc_messages", scope: !534, file: !31, line: 861, type: !34)
!578 = !DILocation(line: 861, column: 15, scope: !534)
!579 = !DILocation(line: 861, column: 29, scope: !534)
!580 = !DILocation(line: 862, column: 7, scope: !581)
!581 = distinct !DILexicalBlock(scope: !534, file: !31, line: 862, column: 7)
!582 = !DILocation(line: 862, column: 19, scope: !581)
!583 = !DILocation(line: 862, column: 22, scope: !581)
!584 = !DILocation(line: 862, column: 7, scope: !534)
!585 = !DILocation(line: 868, column: 7, scope: !586)
!586 = distinct !DILexicalBlock(scope: !581, file: !31, line: 863, column: 5)
!587 = !DILocation(line: 870, column: 5, scope: !586)
!588 = !DILocalVariable(name: "url_program", scope: !534, file: !31, line: 874, type: !34)
!589 = !DILocation(line: 874, column: 15, scope: !534)
!590 = !DILocation(line: 874, column: 36, scope: !534)
!591 = !DILocation(line: 874, column: 29, scope: !534)
!592 = !DILocation(line: 874, column: 61, scope: !534)
!593 = !DILocation(line: 875, column: 11, scope: !534)
!594 = !DILocation(line: 876, column: 24, scope: !534)
!595 = !DILocation(line: 875, column: 3, scope: !534)
!596 = !DILocation(line: 877, column: 11, scope: !534)
!597 = !DILocation(line: 878, column: 11, scope: !534)
!598 = !DILocation(line: 878, column: 17, scope: !534)
!599 = !DILocation(line: 878, column: 25, scope: !534)
!600 = !DILocation(line: 878, column: 22, scope: !534)
!601 = !DILocation(line: 877, column: 3, scope: !534)
!602 = !DILocation(line: 879, column: 1, scope: !534)
!603 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 67, type: !604, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !36)
!604 = !DISubroutineType(types: !605)
!605 = !{!25, !25, !606}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!607 = !DILocalVariable(name: "argc", arg: 1, scope: !603, file: !3, line: 67, type: !25)
!608 = !DILocation(line: 67, column: 11, scope: !603)
!609 = !DILocalVariable(name: "argv", arg: 2, scope: !603, file: !3, line: 67, type: !606)
!610 = !DILocation(line: 67, column: 24, scope: !603)
!611 = !DILocation(line: 70, column: 21, scope: !603)
!612 = !DILocation(line: 70, column: 3, scope: !603)
!613 = !DILocation(line: 71, column: 3, scope: !603)
!614 = !DILocation(line: 72, column: 3, scope: !603)
!615 = !DILocation(line: 73, column: 3, scope: !603)
!616 = !DILocation(line: 75, column: 3, scope: !603)
!617 = !DILocalVariable(name: "optc", scope: !603, file: !3, line: 79, type: !25)
!618 = !DILocation(line: 79, column: 7, scope: !603)
!619 = !DILocation(line: 80, column: 3, scope: !603)
!620 = !DILocation(line: 80, column: 31, scope: !603)
!621 = !DILocation(line: 80, column: 37, scope: !603)
!622 = !DILocation(line: 80, column: 18, scope: !603)
!623 = !DILocation(line: 80, column: 16, scope: !603)
!624 = !DILocation(line: 80, column: 64, scope: !603)
!625 = !DILocation(line: 82, column: 15, scope: !626)
!626 = distinct !DILexicalBlock(scope: !603, file: !3, line: 81, column: 5)
!627 = !DILocation(line: 82, column: 7, scope: !626)
!628 = !DILocation(line: 84, column: 9, scope: !629)
!629 = distinct !DILexicalBlock(scope: !626, file: !3, line: 83, column: 9)
!630 = !DILocation(line: 85, column: 9, scope: !629)
!631 = !DILocation(line: 87, column: 11, scope: !629)
!632 = !DILocalVariable(name: "ok", scope: !603, file: !3, line: 91, type: !61)
!633 = !DILocation(line: 91, column: 8, scope: !603)
!634 = !DILocation(line: 92, column: 7, scope: !635)
!635 = distinct !DILexicalBlock(scope: !603, file: !3, line: 92, column: 7)
!636 = !DILocation(line: 92, column: 17, scope: !635)
!637 = !DILocation(line: 92, column: 14, scope: !635)
!638 = !DILocation(line: 92, column: 7, scope: !603)
!639 = !DILocalVariable(name: "NO_UID", scope: !640, file: !3, line: 95, type: !641)
!640 = distinct !DILexicalBlock(scope: !635, file: !3, line: 93, column: 5)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !292, line: 79, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !231, line: 146, baseType: !7)
!643 = !DILocation(line: 95, column: 13, scope: !640)
!644 = !DILocalVariable(name: "NO_GID", scope: !640, file: !3, line: 96, type: !291)
!645 = !DILocation(line: 96, column: 13, scope: !640)
!646 = !DILocation(line: 98, column: 7, scope: !640)
!647 = !DILocation(line: 98, column: 13, scope: !640)
!648 = !DILocalVariable(name: "ruid", scope: !640, file: !3, line: 99, type: !641)
!649 = !DILocation(line: 99, column: 13, scope: !640)
!650 = !DILocation(line: 99, column: 20, scope: !640)
!651 = !DILocation(line: 100, column: 11, scope: !652)
!652 = distinct !DILexicalBlock(scope: !640, file: !3, line: 100, column: 11)
!653 = !DILocation(line: 100, column: 19, scope: !652)
!654 = !DILocation(line: 100, column: 16, scope: !652)
!655 = !DILocation(line: 100, column: 26, scope: !652)
!656 = !DILocation(line: 100, column: 29, scope: !652)
!657 = !DILocation(line: 100, column: 11, scope: !640)
!658 = !DILocation(line: 101, column: 9, scope: !652)
!659 = !DILocation(line: 103, column: 7, scope: !640)
!660 = !DILocation(line: 103, column: 13, scope: !640)
!661 = !DILocalVariable(name: "egid", scope: !640, file: !3, line: 104, type: !291)
!662 = !DILocation(line: 104, column: 13, scope: !640)
!663 = !DILocation(line: 104, column: 20, scope: !640)
!664 = !DILocation(line: 105, column: 11, scope: !665)
!665 = distinct !DILexicalBlock(scope: !640, file: !3, line: 105, column: 11)
!666 = !DILocation(line: 105, column: 19, scope: !665)
!667 = !DILocation(line: 105, column: 16, scope: !665)
!668 = !DILocation(line: 105, column: 26, scope: !665)
!669 = !DILocation(line: 105, column: 29, scope: !665)
!670 = !DILocation(line: 105, column: 11, scope: !640)
!671 = !DILocation(line: 106, column: 9, scope: !665)
!672 = !DILocation(line: 108, column: 7, scope: !640)
!673 = !DILocation(line: 108, column: 13, scope: !640)
!674 = !DILocalVariable(name: "rgid", scope: !640, file: !3, line: 109, type: !291)
!675 = !DILocation(line: 109, column: 13, scope: !640)
!676 = !DILocation(line: 109, column: 20, scope: !640)
!677 = !DILocation(line: 110, column: 11, scope: !678)
!678 = distinct !DILexicalBlock(scope: !640, file: !3, line: 110, column: 11)
!679 = !DILocation(line: 110, column: 19, scope: !678)
!680 = !DILocation(line: 110, column: 16, scope: !678)
!681 = !DILocation(line: 110, column: 26, scope: !678)
!682 = !DILocation(line: 110, column: 29, scope: !678)
!683 = !DILocation(line: 110, column: 11, scope: !640)
!684 = !DILocation(line: 111, column: 9, scope: !678)
!685 = !DILocation(line: 113, column: 36, scope: !686)
!686 = distinct !DILexicalBlock(scope: !640, file: !3, line: 113, column: 11)
!687 = !DILocation(line: 113, column: 42, scope: !686)
!688 = !DILocation(line: 113, column: 48, scope: !686)
!689 = !DILocation(line: 113, column: 12, scope: !686)
!690 = !DILocation(line: 113, column: 11, scope: !640)
!691 = !DILocation(line: 114, column: 12, scope: !686)
!692 = !DILocation(line: 114, column: 9, scope: !686)
!693 = !DILocation(line: 115, column: 7, scope: !640)
!694 = !DILocation(line: 116, column: 5, scope: !640)
!695 = !DILocation(line: 120, column: 7, scope: !696)
!696 = distinct !DILexicalBlock(scope: !635, file: !3, line: 118, column: 5)
!697 = !DILocation(line: 120, column: 15, scope: !698)
!698 = distinct !DILexicalBlock(scope: !699, file: !3, line: 120, column: 7)
!699 = distinct !DILexicalBlock(scope: !696, file: !3, line: 120, column: 7)
!700 = !DILocation(line: 120, column: 24, scope: !698)
!701 = !DILocation(line: 120, column: 22, scope: !698)
!702 = !DILocation(line: 120, column: 7, scope: !699)
!703 = !DILocalVariable(name: "pwd", scope: !704, file: !3, line: 122, type: !705)
!704 = distinct !DILexicalBlock(scope: !698, file: !3, line: 121, column: 9)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !707, line: 49, size: 384, elements: !708)
!707 = !DIFile(filename: "/usr/include/pwd.h", directory: "", checksumkind: CSK_MD5, checksum: "6682d47abdfe13134f841d46e0eadc7b")
!708 = !{!709, !710, !711, !712, !713, !714, !715}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !706, file: !707, line: 51, baseType: !22, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !706, file: !707, line: 52, baseType: !22, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !706, file: !707, line: 54, baseType: !642, size: 32, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !706, file: !707, line: 55, baseType: !293, size: 32, offset: 160)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !706, file: !707, line: 56, baseType: !22, size: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !706, file: !707, line: 57, baseType: !22, size: 64, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !706, file: !707, line: 58, baseType: !22, size: 64, offset: 320)
!716 = !DILocation(line: 122, column: 26, scope: !704)
!717 = !DILocation(line: 122, column: 42, scope: !704)
!718 = !DILocation(line: 122, column: 47, scope: !704)
!719 = !DILocation(line: 122, column: 32, scope: !704)
!720 = !DILocation(line: 123, column: 15, scope: !721)
!721 = distinct !DILexicalBlock(scope: !704, file: !3, line: 123, column: 15)
!722 = !DILocation(line: 123, column: 19, scope: !721)
!723 = !DILocation(line: 123, column: 15, scope: !704)
!724 = !DILocation(line: 125, column: 15, scope: !725)
!725 = distinct !DILexicalBlock(scope: !721, file: !3, line: 124, column: 13)
!726 = !DILocation(line: 126, column: 18, scope: !725)
!727 = !DILocation(line: 127, column: 15, scope: !725)
!728 = !DILocalVariable(name: "ruid", scope: !704, file: !3, line: 129, type: !641)
!729 = !DILocation(line: 129, column: 17, scope: !704)
!730 = !DILocation(line: 129, column: 24, scope: !704)
!731 = !DILocation(line: 129, column: 29, scope: !704)
!732 = !DILocalVariable(name: "rgid", scope: !704, file: !3, line: 130, type: !291)
!733 = !DILocation(line: 130, column: 17, scope: !704)
!734 = !DILocation(line: 130, column: 24, scope: !704)
!735 = !DILocation(line: 130, column: 29, scope: !704)
!736 = !DILocalVariable(name: "egid", scope: !704, file: !3, line: 131, type: !291)
!737 = !DILocation(line: 131, column: 17, scope: !704)
!738 = !DILocation(line: 131, column: 24, scope: !704)
!739 = !DILocation(line: 133, column: 28, scope: !704)
!740 = !DILocation(line: 133, column: 33, scope: !704)
!741 = !DILocation(line: 133, column: 11, scope: !704)
!742 = !DILocation(line: 134, column: 34, scope: !743)
!743 = distinct !DILexicalBlock(scope: !704, file: !3, line: 134, column: 15)
!744 = !DILocation(line: 134, column: 39, scope: !743)
!745 = !DILocation(line: 134, column: 48, scope: !743)
!746 = !DILocation(line: 134, column: 54, scope: !743)
!747 = !DILocation(line: 134, column: 60, scope: !743)
!748 = !DILocation(line: 134, column: 16, scope: !743)
!749 = !DILocation(line: 134, column: 15, scope: !704)
!750 = !DILocation(line: 135, column: 16, scope: !743)
!751 = !DILocation(line: 135, column: 13, scope: !743)
!752 = !DILocation(line: 136, column: 11, scope: !704)
!753 = !DILocation(line: 138, column: 15, scope: !754)
!754 = distinct !DILexicalBlock(scope: !704, file: !3, line: 138, column: 15)
!755 = !DILocation(line: 138, column: 15, scope: !704)
!756 = !DILocation(line: 139, column: 13, scope: !754)
!757 = !DILocation(line: 140, column: 9, scope: !704)
!758 = !DILocation(line: 120, column: 36, scope: !698)
!759 = !DILocation(line: 120, column: 7, scope: !698)
!760 = distinct !{!760, !702, !761, !418}
!761 = !DILocation(line: 140, column: 9, scope: !699)
!762 = !DILocation(line: 143, column: 10, scope: !603)
!763 = !DILocation(line: 143, column: 3, scope: !603)
!764 = distinct !DISubprogram(name: "write_error", scope: !31, file: !31, line: 946, type: !94, scopeLine: 947, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !36)
!765 = !DILocalVariable(name: "saved_errno", scope: !764, file: !31, line: 948, type: !25)
!766 = !DILocation(line: 948, column: 7, scope: !764)
!767 = !DILocation(line: 948, column: 21, scope: !764)
!768 = !DILocation(line: 949, column: 3, scope: !764)
!769 = !DILocation(line: 950, column: 11, scope: !764)
!770 = !DILocation(line: 950, column: 3, scope: !764)
!771 = !DILocation(line: 951, column: 3, scope: !764)
!772 = !DILocation(line: 952, column: 3, scope: !764)
!773 = distinct !DISubprogram(name: "print_group_list", scope: !226, file: !226, line: 35, type: !774, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !225, retainedNodes: !36)
!774 = !DISubroutineType(types: !775)
!775 = !{!61, !34, !641, !291, !291, !61, !23}
!776 = !DILocalVariable(name: "username", arg: 1, scope: !773, file: !226, line: 35, type: !34)
!777 = !DILocation(line: 35, column: 31, scope: !773)
!778 = !DILocalVariable(name: "ruid", arg: 2, scope: !773, file: !226, line: 36, type: !641)
!779 = !DILocation(line: 36, column: 25, scope: !773)
!780 = !DILocalVariable(name: "rgid", arg: 3, scope: !773, file: !226, line: 36, type: !291)
!781 = !DILocation(line: 36, column: 37, scope: !773)
!782 = !DILocalVariable(name: "egid", arg: 4, scope: !773, file: !226, line: 36, type: !291)
!783 = !DILocation(line: 36, column: 49, scope: !773)
!784 = !DILocalVariable(name: "use_names", arg: 5, scope: !773, file: !226, line: 37, type: !61)
!785 = !DILocation(line: 37, column: 24, scope: !773)
!786 = !DILocalVariable(name: "delim", arg: 6, scope: !773, file: !226, line: 37, type: !23)
!787 = !DILocation(line: 37, column: 40, scope: !773)
!788 = !DILocalVariable(name: "ok", scope: !773, file: !226, line: 39, type: !61)
!789 = !DILocation(line: 39, column: 8, scope: !773)
!790 = !DILocalVariable(name: "pwd", scope: !773, file: !226, line: 40, type: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !707, line: 49, size: 384, elements: !793)
!793 = !{!794, !795, !796, !797, !798, !799, !800}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !792, file: !707, line: 51, baseType: !22, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !792, file: !707, line: 52, baseType: !22, size: 64, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !792, file: !707, line: 54, baseType: !642, size: 32, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !792, file: !707, line: 55, baseType: !293, size: 32, offset: 160)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !792, file: !707, line: 56, baseType: !22, size: 64, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !792, file: !707, line: 57, baseType: !22, size: 64, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !792, file: !707, line: 58, baseType: !22, size: 64, offset: 320)
!801 = !DILocation(line: 40, column: 18, scope: !773)
!802 = !DILocation(line: 42, column: 7, scope: !803)
!803 = distinct !DILexicalBlock(scope: !773, file: !226, line: 42, column: 7)
!804 = !DILocation(line: 42, column: 7, scope: !773)
!805 = !DILocation(line: 44, column: 23, scope: !806)
!806 = distinct !DILexicalBlock(scope: !803, file: !226, line: 43, column: 5)
!807 = !DILocation(line: 44, column: 13, scope: !806)
!808 = !DILocation(line: 44, column: 11, scope: !806)
!809 = !DILocation(line: 45, column: 11, scope: !810)
!810 = distinct !DILexicalBlock(scope: !806, file: !226, line: 45, column: 11)
!811 = !DILocation(line: 45, column: 15, scope: !810)
!812 = !DILocation(line: 45, column: 11, scope: !806)
!813 = !DILocation(line: 46, column: 12, scope: !810)
!814 = !DILocation(line: 46, column: 9, scope: !810)
!815 = !DILocation(line: 47, column: 5, scope: !806)
!816 = !DILocation(line: 49, column: 21, scope: !817)
!817 = distinct !DILexicalBlock(scope: !773, file: !226, line: 49, column: 7)
!818 = !DILocation(line: 49, column: 27, scope: !817)
!819 = !DILocation(line: 49, column: 8, scope: !817)
!820 = !DILocation(line: 49, column: 7, scope: !773)
!821 = !DILocation(line: 50, column: 8, scope: !817)
!822 = !DILocation(line: 50, column: 5, scope: !817)
!823 = !DILocation(line: 52, column: 7, scope: !824)
!824 = distinct !DILexicalBlock(scope: !773, file: !226, line: 52, column: 7)
!825 = !DILocation(line: 52, column: 15, scope: !824)
!826 = !DILocation(line: 52, column: 12, scope: !824)
!827 = !DILocation(line: 52, column: 7, scope: !773)
!828 = !DILocation(line: 54, column: 7, scope: !829)
!829 = distinct !DILexicalBlock(scope: !824, file: !226, line: 53, column: 5)
!830 = !DILocation(line: 55, column: 25, scope: !831)
!831 = distinct !DILexicalBlock(scope: !829, file: !226, line: 55, column: 11)
!832 = !DILocation(line: 55, column: 31, scope: !831)
!833 = !DILocation(line: 55, column: 12, scope: !831)
!834 = !DILocation(line: 55, column: 11, scope: !829)
!835 = !DILocation(line: 56, column: 12, scope: !831)
!836 = !DILocation(line: 56, column: 9, scope: !831)
!837 = !DILocation(line: 57, column: 5, scope: !829)
!838 = !DILocalVariable(name: "groups", scope: !839, file: !226, line: 60, type: !295)
!839 = distinct !DILexicalBlock(scope: !773, file: !226, line: 59, column: 3)
!840 = !DILocation(line: 60, column: 12, scope: !839)
!841 = !DILocalVariable(name: "n_groups", scope: !839, file: !226, line: 62, type: !25)
!842 = !DILocation(line: 62, column: 9, scope: !839)
!843 = !DILocation(line: 62, column: 32, scope: !839)
!844 = !DILocation(line: 62, column: 43, scope: !839)
!845 = !DILocation(line: 62, column: 49, scope: !839)
!846 = !DILocation(line: 62, column: 54, scope: !839)
!847 = !DILocation(line: 62, column: 63, scope: !839)
!848 = !DILocation(line: 62, column: 20, scope: !839)
!849 = !DILocation(line: 63, column: 9, scope: !850)
!850 = distinct !DILexicalBlock(scope: !839, file: !226, line: 63, column: 9)
!851 = !DILocation(line: 63, column: 18, scope: !850)
!852 = !DILocation(line: 63, column: 9, scope: !839)
!853 = !DILocation(line: 65, column: 13, scope: !854)
!854 = distinct !DILexicalBlock(scope: !855, file: !226, line: 65, column: 13)
!855 = distinct !DILexicalBlock(scope: !850, file: !226, line: 64, column: 7)
!856 = !DILocation(line: 65, column: 13, scope: !855)
!857 = !DILocation(line: 67, column: 13, scope: !858)
!858 = distinct !DILexicalBlock(scope: !854, file: !226, line: 66, column: 11)
!859 = !DILocation(line: 69, column: 11, scope: !858)
!860 = !DILocation(line: 72, column: 13, scope: !861)
!861 = distinct !DILexicalBlock(scope: !854, file: !226, line: 71, column: 11)
!862 = !DILocation(line: 74, column: 9, scope: !855)
!863 = !DILocalVariable(name: "i", scope: !864, file: !226, line: 77, type: !25)
!864 = distinct !DILexicalBlock(scope: !839, file: !226, line: 77, column: 5)
!865 = !DILocation(line: 77, column: 14, scope: !864)
!866 = !DILocation(line: 77, column: 10, scope: !864)
!867 = !DILocation(line: 77, column: 21, scope: !868)
!868 = distinct !DILexicalBlock(scope: !864, file: !226, line: 77, column: 5)
!869 = !DILocation(line: 77, column: 25, scope: !868)
!870 = !DILocation(line: 77, column: 23, scope: !868)
!871 = !DILocation(line: 77, column: 5, scope: !864)
!872 = !DILocation(line: 78, column: 11, scope: !873)
!873 = distinct !DILexicalBlock(scope: !868, file: !226, line: 78, column: 11)
!874 = !DILocation(line: 78, column: 18, scope: !873)
!875 = !DILocation(line: 78, column: 24, scope: !873)
!876 = !DILocation(line: 78, column: 21, scope: !873)
!877 = !DILocation(line: 78, column: 29, scope: !873)
!878 = !DILocation(line: 78, column: 32, scope: !873)
!879 = !DILocation(line: 78, column: 39, scope: !873)
!880 = !DILocation(line: 78, column: 45, scope: !873)
!881 = !DILocation(line: 78, column: 42, scope: !873)
!882 = !DILocation(line: 78, column: 11, scope: !868)
!883 = !DILocation(line: 80, column: 11, scope: !884)
!884 = distinct !DILexicalBlock(scope: !873, file: !226, line: 79, column: 9)
!885 = !DILocation(line: 81, column: 29, scope: !886)
!886 = distinct !DILexicalBlock(scope: !884, file: !226, line: 81, column: 15)
!887 = !DILocation(line: 81, column: 36, scope: !886)
!888 = !DILocation(line: 81, column: 40, scope: !886)
!889 = !DILocation(line: 81, column: 16, scope: !886)
!890 = !DILocation(line: 81, column: 15, scope: !884)
!891 = !DILocation(line: 82, column: 16, scope: !886)
!892 = !DILocation(line: 82, column: 13, scope: !886)
!893 = !DILocation(line: 83, column: 9, scope: !884)
!894 = !DILocation(line: 77, column: 36, scope: !868)
!895 = !DILocation(line: 77, column: 5, scope: !868)
!896 = distinct !{!896, !871, !897, !418}
!897 = !DILocation(line: 83, column: 9, scope: !864)
!898 = !DILocation(line: 84, column: 11, scope: !839)
!899 = !DILocation(line: 84, column: 5, scope: !839)
!900 = !DILocation(line: 86, column: 10, scope: !773)
!901 = !DILocation(line: 86, column: 3, scope: !773)
!902 = !DILocation(line: 87, column: 1, scope: !773)
!903 = distinct !DISubprogram(name: "print_group", scope: !226, file: !226, line: 91, type: !904, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !225, retainedNodes: !36)
!904 = !DISubroutineType(types: !905)
!905 = !{!61, !291, !61}
!906 = !DILocalVariable(name: "gid", arg: 1, scope: !903, file: !226, line: 91, type: !291)
!907 = !DILocation(line: 91, column: 20, scope: !903)
!908 = !DILocalVariable(name: "use_name", arg: 2, scope: !903, file: !226, line: 91, type: !61)
!909 = !DILocation(line: 91, column: 30, scope: !903)
!910 = !DILocalVariable(name: "grp", scope: !903, file: !226, line: 93, type: !911)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !913, line: 42, size: 256, elements: !914)
!913 = !DIFile(filename: "/usr/include/grp.h", directory: "", checksumkind: CSK_MD5, checksum: "17838c4acd24e08e5bed6821e9e2c084")
!914 = !{!915, !916, !917, !918}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !912, file: !913, line: 44, baseType: !22, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !912, file: !913, line: 45, baseType: !22, size: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !912, file: !913, line: 46, baseType: !293, size: 32, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !912, file: !913, line: 47, baseType: !606, size: 64, offset: 192)
!919 = !DILocation(line: 93, column: 17, scope: !903)
!920 = !DILocalVariable(name: "ok", scope: !903, file: !226, line: 94, type: !61)
!921 = !DILocation(line: 94, column: 8, scope: !903)
!922 = !DILocation(line: 96, column: 7, scope: !923)
!923 = distinct !DILexicalBlock(scope: !903, file: !226, line: 96, column: 7)
!924 = !DILocation(line: 96, column: 7, scope: !903)
!925 = !DILocation(line: 98, column: 23, scope: !926)
!926 = distinct !DILexicalBlock(scope: !923, file: !226, line: 97, column: 5)
!927 = !DILocation(line: 98, column: 13, scope: !926)
!928 = !DILocation(line: 98, column: 11, scope: !926)
!929 = !DILocation(line: 99, column: 11, scope: !930)
!930 = distinct !DILexicalBlock(scope: !926, file: !226, line: 99, column: 11)
!931 = !DILocation(line: 99, column: 15, scope: !930)
!932 = !DILocation(line: 99, column: 11, scope: !926)
!933 = !DILocalVariable(name: "g", scope: !934, file: !226, line: 108, type: !228)
!934 = distinct !DILexicalBlock(scope: !935, file: !226, line: 107, column: 13)
!935 = distinct !DILexicalBlock(scope: !936, file: !226, line: 101, column: 15)
!936 = distinct !DILexicalBlock(scope: !930, file: !226, line: 100, column: 9)
!937 = !DILocation(line: 108, column: 25, scope: !934)
!938 = !DILocation(line: 108, column: 29, scope: !934)
!939 = !DILocation(line: 109, column: 15, scope: !934)
!940 = !DILocation(line: 111, column: 14, scope: !936)
!941 = !DILocation(line: 112, column: 9, scope: !936)
!942 = !DILocation(line: 113, column: 5, scope: !926)
!943 = !DILocation(line: 115, column: 7, scope: !944)
!944 = distinct !DILexicalBlock(scope: !903, file: !226, line: 115, column: 7)
!945 = !DILocation(line: 115, column: 7, scope: !903)
!946 = !DILocation(line: 116, column: 19, scope: !944)
!947 = !DILocation(line: 116, column: 24, scope: !944)
!948 = !DILocation(line: 116, column: 5, scope: !944)
!949 = !DILocation(line: 118, column: 32, scope: !944)
!950 = !DILocation(line: 118, column: 20, scope: !944)
!951 = !DILocation(line: 118, column: 5, scope: !944)
!952 = !DILocation(line: 119, column: 10, scope: !903)
!953 = !DILocation(line: 119, column: 3, scope: !903)
!954 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !57, file: !57, line: 50, type: !535, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !56, retainedNodes: !36)
!955 = !DILocalVariable(name: "file", arg: 1, scope: !954, file: !57, line: 50, type: !34)
!956 = !DILocation(line: 50, column: 41, scope: !954)
!957 = !DILocation(line: 52, column: 15, scope: !954)
!958 = !DILocation(line: 52, column: 13, scope: !954)
!959 = !DILocation(line: 53, column: 1, scope: !954)
!960 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !57, file: !57, line: 87, type: !961, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !56, retainedNodes: !36)
!961 = !DISubroutineType(types: !962)
!962 = !{null, !61}
!963 = !DILocalVariable(name: "ignore", arg: 1, scope: !960, file: !57, line: 87, type: !61)
!964 = !DILocation(line: 87, column: 37, scope: !960)
!965 = !DILocation(line: 89, column: 18, scope: !960)
!966 = !DILocation(line: 89, column: 16, scope: !960)
!967 = !DILocation(line: 90, column: 1, scope: !960)
!968 = distinct !DISubprogram(name: "close_stdout", scope: !57, file: !57, line: 116, type: !94, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !56, retainedNodes: !36)
!969 = !DILocation(line: 118, column: 21, scope: !970)
!970 = distinct !DILexicalBlock(scope: !968, file: !57, line: 118, column: 7)
!971 = !DILocation(line: 118, column: 7, scope: !970)
!972 = !DILocation(line: 118, column: 29, scope: !970)
!973 = !DILocation(line: 119, column: 7, scope: !970)
!974 = !DILocation(line: 119, column: 12, scope: !970)
!975 = !DILocation(line: 119, column: 25, scope: !970)
!976 = !DILocation(line: 119, column: 28, scope: !970)
!977 = !DILocation(line: 119, column: 34, scope: !970)
!978 = !DILocation(line: 118, column: 7, scope: !968)
!979 = !DILocalVariable(name: "write_error", scope: !980, file: !57, line: 121, type: !34)
!980 = distinct !DILexicalBlock(scope: !970, file: !57, line: 120, column: 5)
!981 = !DILocation(line: 121, column: 19, scope: !980)
!982 = !DILocation(line: 121, column: 33, scope: !980)
!983 = !DILocation(line: 122, column: 11, scope: !984)
!984 = distinct !DILexicalBlock(scope: !980, file: !57, line: 122, column: 11)
!985 = !DILocation(line: 122, column: 11, scope: !980)
!986 = !DILocation(line: 123, column: 9, scope: !984)
!987 = !DILocation(line: 126, column: 9, scope: !984)
!988 = !DILocation(line: 128, column: 14, scope: !980)
!989 = !DILocation(line: 128, column: 7, scope: !980)
!990 = !DILocation(line: 133, column: 42, scope: !991)
!991 = distinct !DILexicalBlock(scope: !968, file: !57, line: 133, column: 7)
!992 = !DILocation(line: 133, column: 28, scope: !991)
!993 = !DILocation(line: 133, column: 50, scope: !991)
!994 = !DILocation(line: 133, column: 7, scope: !968)
!995 = !DILocation(line: 134, column: 12, scope: !991)
!996 = !DILocation(line: 134, column: 5, scope: !991)
!997 = !DILocation(line: 135, column: 1, scope: !968)
!998 = distinct !DISubprogram(name: "verror", scope: !65, file: !65, line: 251, type: !999, scopeLine: 253, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !64, retainedNodes: !36)
!999 = !DISubroutineType(types: !1000)
!1000 = !{null, !25, !25, !34, !73}
!1001 = !DILocalVariable(name: "status", arg: 1, scope: !998, file: !65, line: 251, type: !25)
!1002 = !DILocation(line: 251, column: 1, scope: !998)
!1003 = !DILocalVariable(name: "errnum", arg: 2, scope: !998, file: !65, line: 251, type: !25)
!1004 = !DILocalVariable(name: "message", arg: 3, scope: !998, file: !65, line: 251, type: !34)
!1005 = !DILocalVariable(name: "args", arg: 4, scope: !998, file: !65, line: 251, type: !73)
!1006 = !DILocation(line: 261, column: 3, scope: !998)
!1007 = !DILocation(line: 265, column: 7, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !998, file: !65, line: 265, column: 7)
!1009 = !DILocation(line: 265, column: 7, scope: !998)
!1010 = !DILocation(line: 266, column: 7, scope: !1008)
!1011 = !DILocation(line: 266, column: 5, scope: !1008)
!1012 = !DILocation(line: 272, column: 16, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1008, file: !65, line: 268, column: 5)
!1014 = !DILocation(line: 272, column: 32, scope: !1013)
!1015 = !DILocation(line: 272, column: 7, scope: !1013)
!1016 = !DILocation(line: 276, column: 3, scope: !998)
!1017 = !DILocation(line: 282, column: 1, scope: !998)
!1018 = distinct !DISubprogram(name: "flush_stdout", scope: !65, file: !65, line: 163, type: !94, scopeLine: 164, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !64, retainedNodes: !36)
!1019 = !DILocalVariable(name: "stdout_fd", scope: !1018, file: !65, line: 166, type: !25)
!1020 = !DILocation(line: 166, column: 7, scope: !1018)
!1021 = !DILocation(line: 172, column: 13, scope: !1018)
!1022 = !DILocation(line: 182, column: 12, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1018, file: !65, line: 182, column: 7)
!1024 = !DILocation(line: 182, column: 9, scope: !1023)
!1025 = !DILocation(line: 182, column: 22, scope: !1023)
!1026 = !DILocation(line: 182, column: 34, scope: !1023)
!1027 = !DILocation(line: 182, column: 25, scope: !1023)
!1028 = !DILocation(line: 182, column: 7, scope: !1018)
!1029 = !DILocation(line: 184, column: 5, scope: !1023)
!1030 = !DILocation(line: 185, column: 1, scope: !1018)
!1031 = distinct !DISubprogram(name: "error_tail", scope: !65, file: !65, line: 219, type: !999, scopeLine: 221, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !64, retainedNodes: !36)
!1032 = !DILocalVariable(name: "status", arg: 1, scope: !1031, file: !65, line: 219, type: !25)
!1033 = !DILocation(line: 219, column: 1, scope: !1031)
!1034 = !DILocalVariable(name: "errnum", arg: 2, scope: !1031, file: !65, line: 219, type: !25)
!1035 = !DILocalVariable(name: "message", arg: 3, scope: !1031, file: !65, line: 219, type: !34)
!1036 = !DILocalVariable(name: "args", arg: 4, scope: !1031, file: !65, line: 219, type: !73)
!1037 = !DILocation(line: 229, column: 13, scope: !1031)
!1038 = !DILocation(line: 229, column: 21, scope: !1031)
!1039 = !DILocation(line: 229, column: 3, scope: !1031)
!1040 = !DILocation(line: 232, column: 3, scope: !1031)
!1041 = !DILocation(line: 233, column: 7, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1031, file: !65, line: 233, column: 7)
!1043 = !DILocation(line: 233, column: 7, scope: !1031)
!1044 = !DILocation(line: 234, column: 26, scope: !1042)
!1045 = !DILocation(line: 234, column: 5, scope: !1042)
!1046 = !DILocation(line: 238, column: 3, scope: !1031)
!1047 = !DILocation(line: 240, column: 3, scope: !1031)
!1048 = !DILocation(line: 241, column: 7, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1031, file: !65, line: 241, column: 7)
!1050 = !DILocation(line: 241, column: 7, scope: !1031)
!1051 = !DILocation(line: 242, column: 11, scope: !1049)
!1052 = !DILocation(line: 242, column: 5, scope: !1049)
!1053 = !DILocation(line: 243, column: 1, scope: !1031)
!1054 = distinct !DISubprogram(name: "print_errno_message", scope: !65, file: !65, line: 188, type: !326, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !64, retainedNodes: !36)
!1055 = !DILocalVariable(name: "errnum", arg: 1, scope: !1054, file: !65, line: 188, type: !25)
!1056 = !DILocation(line: 188, column: 26, scope: !1054)
!1057 = !DILocalVariable(name: "s", scope: !1054, file: !65, line: 190, type: !34)
!1058 = !DILocation(line: 190, column: 15, scope: !1054)
!1059 = !DILocalVariable(name: "errbuf", scope: !1054, file: !65, line: 193, type: !1060)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8192, elements: !1061)
!1061 = !{!1062}
!1062 = !DISubrange(count: 1024)
!1063 = !DILocation(line: 193, column: 8, scope: !1054)
!1064 = !DILocation(line: 195, column: 21, scope: !1054)
!1065 = !DILocation(line: 195, column: 29, scope: !1054)
!1066 = !DILocation(line: 195, column: 7, scope: !1054)
!1067 = !DILocation(line: 195, column: 5, scope: !1054)
!1068 = !DILocation(line: 207, column: 9, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1054, file: !65, line: 207, column: 7)
!1070 = !DILocation(line: 207, column: 7, scope: !1054)
!1071 = !DILocation(line: 208, column: 9, scope: !1069)
!1072 = !DILocation(line: 208, column: 7, scope: !1069)
!1073 = !DILocation(line: 208, column: 5, scope: !1069)
!1074 = !DILocation(line: 214, column: 12, scope: !1054)
!1075 = !DILocation(line: 214, column: 28, scope: !1054)
!1076 = !DILocation(line: 214, column: 3, scope: !1054)
!1077 = !DILocation(line: 216, column: 1, scope: !1054)
!1078 = distinct !DISubprogram(name: "is_open", scope: !65, file: !65, line: 145, type: !1079, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !64, retainedNodes: !36)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!25, !25}
!1081 = !DILocalVariable(name: "fd", arg: 1, scope: !1078, file: !65, line: 145, type: !25)
!1082 = !DILocation(line: 145, column: 14, scope: !1078)
!1083 = !DILocation(line: 157, column: 22, scope: !1078)
!1084 = !DILocation(line: 157, column: 15, scope: !1078)
!1085 = !DILocation(line: 157, column: 12, scope: !1078)
!1086 = !DILocation(line: 157, column: 3, scope: !1078)
!1087 = distinct !DISubprogram(name: "error", scope: !65, file: !65, line: 285, type: !1088, scopeLine: 286, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !64, retainedNodes: !36)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{null, !25, !25, !34, null}
!1090 = !DILocalVariable(name: "status", arg: 1, scope: !1087, file: !65, line: 285, type: !25)
!1091 = !DILocation(line: 285, column: 12, scope: !1087)
!1092 = !DILocalVariable(name: "errnum", arg: 2, scope: !1087, file: !65, line: 285, type: !25)
!1093 = !DILocation(line: 285, column: 24, scope: !1087)
!1094 = !DILocalVariable(name: "message", arg: 3, scope: !1087, file: !65, line: 285, type: !34)
!1095 = !DILocation(line: 285, column: 44, scope: !1087)
!1096 = !DILocalVariable(name: "ap", scope: !1087, file: !65, line: 287, type: !73)
!1097 = !DILocation(line: 287, column: 11, scope: !1087)
!1098 = !DILocation(line: 288, column: 3, scope: !1087)
!1099 = !DILocation(line: 289, column: 3, scope: !1087)
!1100 = !DILocation(line: 290, column: 3, scope: !1087)
!1101 = !DILocation(line: 291, column: 1, scope: !1087)
!1102 = !DILocalVariable(name: "status", arg: 1, scope: !70, file: !65, line: 298, type: !25)
!1103 = !DILocation(line: 298, column: 1, scope: !70)
!1104 = !DILocalVariable(name: "errnum", arg: 2, scope: !70, file: !65, line: 298, type: !25)
!1105 = !DILocalVariable(name: "file_name", arg: 3, scope: !70, file: !65, line: 298, type: !34)
!1106 = !DILocalVariable(name: "line_number", arg: 4, scope: !70, file: !65, line: 298, type: !7)
!1107 = !DILocalVariable(name: "message", arg: 5, scope: !70, file: !65, line: 298, type: !34)
!1108 = !DILocalVariable(name: "args", arg: 6, scope: !70, file: !65, line: 298, type: !73)
!1109 = !DILocation(line: 302, column: 7, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !70, file: !65, line: 302, column: 7)
!1111 = !DILocation(line: 302, column: 7, scope: !70)
!1112 = !DILocation(line: 307, column: 11, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1114, file: !65, line: 307, column: 11)
!1114 = distinct !DILexicalBlock(scope: !1110, file: !65, line: 303, column: 5)
!1115 = !DILocation(line: 307, column: 30, scope: !1113)
!1116 = !DILocation(line: 307, column: 27, scope: !1113)
!1117 = !DILocation(line: 308, column: 11, scope: !1113)
!1118 = !DILocation(line: 308, column: 15, scope: !1113)
!1119 = !DILocation(line: 308, column: 28, scope: !1113)
!1120 = !DILocation(line: 308, column: 25, scope: !1113)
!1121 = !DILocation(line: 309, column: 15, scope: !1113)
!1122 = !DILocation(line: 309, column: 19, scope: !1113)
!1123 = !DILocation(line: 309, column: 33, scope: !1113)
!1124 = !DILocation(line: 310, column: 19, scope: !1113)
!1125 = !DILocation(line: 310, column: 22, scope: !1113)
!1126 = !DILocation(line: 310, column: 32, scope: !1113)
!1127 = !DILocation(line: 311, column: 19, scope: !1113)
!1128 = !DILocation(line: 311, column: 30, scope: !1113)
!1129 = !DILocation(line: 311, column: 45, scope: !1113)
!1130 = !DILocation(line: 311, column: 22, scope: !1113)
!1131 = !DILocation(line: 311, column: 56, scope: !1113)
!1132 = !DILocation(line: 307, column: 11, scope: !1114)
!1133 = !DILocation(line: 314, column: 9, scope: !1113)
!1134 = !DILocation(line: 316, column: 23, scope: !1114)
!1135 = !DILocation(line: 316, column: 21, scope: !1114)
!1136 = !DILocation(line: 317, column: 25, scope: !1114)
!1137 = !DILocation(line: 317, column: 23, scope: !1114)
!1138 = !DILocation(line: 318, column: 5, scope: !1114)
!1139 = !DILocation(line: 327, column: 3, scope: !70)
!1140 = !DILocation(line: 331, column: 7, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !70, file: !65, line: 331, column: 7)
!1142 = !DILocation(line: 331, column: 7, scope: !70)
!1143 = !DILocation(line: 332, column: 7, scope: !1141)
!1144 = !DILocation(line: 332, column: 5, scope: !1141)
!1145 = !DILocation(line: 338, column: 16, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1141, file: !65, line: 334, column: 5)
!1147 = !DILocation(line: 338, column: 31, scope: !1146)
!1148 = !DILocation(line: 338, column: 7, scope: !1146)
!1149 = !DILocation(line: 346, column: 12, scope: !70)
!1150 = !DILocation(line: 346, column: 20, scope: !70)
!1151 = !DILocation(line: 346, column: 30, scope: !70)
!1152 = !DILocation(line: 347, column: 12, scope: !70)
!1153 = !DILocation(line: 347, column: 23, scope: !70)
!1154 = !DILocation(line: 346, column: 3, scope: !70)
!1155 = !DILocation(line: 350, column: 3, scope: !70)
!1156 = !DILocation(line: 356, column: 1, scope: !70)
!1157 = distinct !DISubprogram(name: "error_at_line", scope: !65, file: !65, line: 359, type: !1158, scopeLine: 361, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !64, retainedNodes: !36)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{null, !25, !25, !34, !7, !34, null}
!1160 = !DILocalVariable(name: "status", arg: 1, scope: !1157, file: !65, line: 359, type: !25)
!1161 = !DILocation(line: 359, column: 20, scope: !1157)
!1162 = !DILocalVariable(name: "errnum", arg: 2, scope: !1157, file: !65, line: 359, type: !25)
!1163 = !DILocation(line: 359, column: 32, scope: !1157)
!1164 = !DILocalVariable(name: "file_name", arg: 3, scope: !1157, file: !65, line: 359, type: !34)
!1165 = !DILocation(line: 359, column: 52, scope: !1157)
!1166 = !DILocalVariable(name: "line_number", arg: 4, scope: !1157, file: !65, line: 360, type: !7)
!1167 = !DILocation(line: 360, column: 29, scope: !1157)
!1168 = !DILocalVariable(name: "message", arg: 5, scope: !1157, file: !65, line: 360, type: !34)
!1169 = !DILocation(line: 360, column: 54, scope: !1157)
!1170 = !DILocalVariable(name: "ap", scope: !1157, file: !65, line: 362, type: !73)
!1171 = !DILocation(line: 362, column: 11, scope: !1157)
!1172 = !DILocation(line: 363, column: 3, scope: !1157)
!1173 = !DILocation(line: 364, column: 3, scope: !1157)
!1174 = !DILocation(line: 366, column: 3, scope: !1157)
!1175 = !DILocation(line: 367, column: 1, scope: !1157)
!1176 = distinct !DISubprogram(name: "fpurge", scope: !233, file: !233, line: 32, type: !1177, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !232, retainedNodes: !36)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!25, !1179}
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1181, line: 7, baseType: !1182)
!1181 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1183, line: 49, size: 1728, elements: !1184)
!1183 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!1184 = !{!1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1200, !1202, !1203, !1204, !1206, !1207, !1209, !1213, !1216, !1218, !1221, !1224, !1225, !1226, !1227, !1228}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1182, file: !1183, line: 51, baseType: !25, size: 32)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1182, file: !1183, line: 54, baseType: !22, size: 64, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1182, file: !1183, line: 55, baseType: !22, size: 64, offset: 128)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1182, file: !1183, line: 56, baseType: !22, size: 64, offset: 192)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1182, file: !1183, line: 57, baseType: !22, size: 64, offset: 256)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1182, file: !1183, line: 58, baseType: !22, size: 64, offset: 320)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1182, file: !1183, line: 59, baseType: !22, size: 64, offset: 384)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1182, file: !1183, line: 60, baseType: !22, size: 64, offset: 448)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1182, file: !1183, line: 61, baseType: !22, size: 64, offset: 512)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1182, file: !1183, line: 64, baseType: !22, size: 64, offset: 576)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1182, file: !1183, line: 65, baseType: !22, size: 64, offset: 640)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1182, file: !1183, line: 66, baseType: !22, size: 64, offset: 704)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1182, file: !1183, line: 68, baseType: !1198, size: 64, offset: 768)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1183, line: 36, flags: DIFlagFwdDecl)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1182, file: !1183, line: 70, baseType: !1201, size: 64, offset: 832)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1182, file: !1183, line: 72, baseType: !25, size: 32, offset: 896)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1182, file: !1183, line: 73, baseType: !25, size: 32, offset: 928)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1182, file: !1183, line: 74, baseType: !1205, size: 64, offset: 960)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !231, line: 152, baseType: !262)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1182, file: !1183, line: 77, baseType: !26, size: 16, offset: 1024)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1182, file: !1183, line: 78, baseType: !1208, size: 8, offset: 1040)
!1208 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1182, file: !1183, line: 79, baseType: !1210, size: 8, offset: 1048)
!1210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, elements: !1211)
!1211 = !{!1212}
!1212 = !DISubrange(count: 1)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1182, file: !1183, line: 81, baseType: !1214, size: 64, offset: 1088)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1183, line: 43, baseType: null)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1182, file: !1183, line: 89, baseType: !1217, size: 64, offset: 1152)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !231, line: 153, baseType: !262)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1182, file: !1183, line: 91, baseType: !1219, size: 64, offset: 1216)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1183, line: 37, flags: DIFlagFwdDecl)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1182, file: !1183, line: 92, baseType: !1222, size: 64, offset: 1280)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1183, line: 38, flags: DIFlagFwdDecl)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1182, file: !1183, line: 93, baseType: !1201, size: 64, offset: 1344)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1182, file: !1183, line: 94, baseType: !24, size: 64, offset: 1408)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1182, file: !1183, line: 95, baseType: !138, size: 64, offset: 1472)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1182, file: !1183, line: 96, baseType: !25, size: 32, offset: 1536)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1182, file: !1183, line: 98, baseType: !1229, size: 160, offset: 1568)
!1229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 160, elements: !1230)
!1230 = !{!1231}
!1231 = !DISubrange(count: 20)
!1232 = !DILocalVariable(name: "fp", arg: 1, scope: !1176, file: !233, line: 32, type: !1179)
!1233 = !DILocation(line: 32, column: 15, scope: !1176)
!1234 = !DILocation(line: 36, column: 13, scope: !1176)
!1235 = !DILocation(line: 36, column: 3, scope: !1176)
!1236 = !DILocation(line: 38, column: 3, scope: !1176)
!1237 = distinct !DISubprogram(name: "getprogname", scope: !235, file: !235, line: 54, type: !1238, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !234, retainedNodes: !36)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!34}
!1240 = !DILocation(line: 58, column: 10, scope: !1237)
!1241 = !DILocation(line: 58, column: 3, scope: !1237)
!1242 = distinct !DISubprogram(name: "set_program_name", scope: !99, file: !99, line: 37, type: !535, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !98, retainedNodes: !36)
!1243 = !DILocalVariable(name: "argv0", arg: 1, scope: !1242, file: !99, line: 37, type: !34)
!1244 = !DILocation(line: 37, column: 31, scope: !1242)
!1245 = !DILocalVariable(name: "slash", scope: !1242, file: !99, line: 44, type: !34)
!1246 = !DILocation(line: 44, column: 15, scope: !1242)
!1247 = !DILocation(line: 44, column: 32, scope: !1242)
!1248 = !DILocation(line: 44, column: 23, scope: !1242)
!1249 = !DILocalVariable(name: "base", scope: !1242, file: !99, line: 45, type: !34)
!1250 = !DILocation(line: 45, column: 15, scope: !1242)
!1251 = !DILocation(line: 45, column: 22, scope: !1242)
!1252 = !DILocation(line: 45, column: 30, scope: !1242)
!1253 = !DILocation(line: 45, column: 36, scope: !1242)
!1254 = !DILocation(line: 45, column: 42, scope: !1242)
!1255 = !DILocation(line: 46, column: 12, scope: !1256)
!1256 = distinct !DILexicalBlock(scope: !1242, file: !99, line: 46, column: 7)
!1257 = !DILocation(line: 46, column: 19, scope: !1256)
!1258 = !DILocation(line: 46, column: 17, scope: !1256)
!1259 = !DILocation(line: 46, column: 9, scope: !1256)
!1260 = !DILocation(line: 46, column: 25, scope: !1256)
!1261 = !DILocation(line: 46, column: 35, scope: !1256)
!1262 = !DILocation(line: 46, column: 40, scope: !1256)
!1263 = !DILocation(line: 46, column: 28, scope: !1256)
!1264 = !DILocation(line: 46, column: 7, scope: !1242)
!1265 = !DILocation(line: 48, column: 15, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !1256, file: !99, line: 47, column: 5)
!1267 = !DILocation(line: 48, column: 13, scope: !1266)
!1268 = !DILocation(line: 49, column: 20, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1266, file: !99, line: 49, column: 11)
!1270 = !DILocation(line: 49, column: 11, scope: !1269)
!1271 = !DILocation(line: 49, column: 36, scope: !1269)
!1272 = !DILocation(line: 49, column: 11, scope: !1266)
!1273 = !DILocation(line: 51, column: 16, scope: !1274)
!1274 = distinct !DILexicalBlock(scope: !1269, file: !99, line: 50, column: 9)
!1275 = !DILocation(line: 52, column: 19, scope: !1274)
!1276 = !DILocation(line: 52, column: 17, scope: !1274)
!1277 = !DILocation(line: 53, column: 9, scope: !1274)
!1278 = !DILocation(line: 54, column: 5, scope: !1266)
!1279 = !DILocation(line: 65, column: 18, scope: !1242)
!1280 = !DILocation(line: 65, column: 16, scope: !1242)
!1281 = !DILocation(line: 71, column: 38, scope: !1242)
!1282 = !DILocation(line: 71, column: 27, scope: !1242)
!1283 = !DILocation(line: 74, column: 44, scope: !1242)
!1284 = !DILocation(line: 74, column: 33, scope: !1242)
!1285 = !DILocation(line: 76, column: 1, scope: !1242)
!1286 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !104, file: !105, line: 38, type: !34)
!1287 = !DILocation(line: 38, column: 31, scope: !104)
!1288 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !104, file: !105, line: 38, type: !34)
!1289 = !DILocation(line: 38, column: 66, scope: !104)
!1290 = !DILocalVariable(name: "translation", scope: !104, file: !105, line: 40, type: !34)
!1291 = !DILocation(line: 40, column: 15, scope: !104)
!1292 = !DILocation(line: 40, column: 38, scope: !104)
!1293 = !DILocation(line: 40, column: 29, scope: !104)
!1294 = !DILocation(line: 41, column: 7, scope: !1295)
!1295 = distinct !DILexicalBlock(scope: !104, file: !105, line: 41, column: 7)
