; ModuleID = 'src/expand.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.mbbuf_t = type { i8*, %struct._IO_FILE*, i64, i64, i64 }
%struct.mcel_t = type { i32, i8, i8 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [66 x i8] c"Convert tabs in each FILE to spaces, writing to standard output.\0A\00", align 1
@.str.3 = private unnamed_addr constant [7 x i8] c"expand\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "shortopts", scope: !2, file: !3, line: 52, type: !60, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !28, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/expand.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c80215ff64ab09027a1b86db960a2307")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256)
!10 = !DIEnumerator(name: "_ISlower", value: 512)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!14 = !DIEnumerator(name: "_ISspace", value: 8192)
!15 = !DIEnumerator(name: "_ISprint", value: 16384)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768)
!17 = !DIEnumerator(name: "_ISblank", value: 1)
!18 = !DIEnumerator(name: "_IScntrl", value: 2)
!19 = !DIEnumerator(name: "_ISpunct", value: 4)
!20 = !DIEnumerator(name: "_ISalnum", value: 8)
!21 = !{!22, !24, !25, !26, !27}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!27 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!28 = !{!29, !0, !38, !52}
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !31, file: !32, line: 575, type: !25, isLocal: true, isDefinition: true)
!31 = distinct !DISubprogram(name: "oputs_", scope: !32, file: !32, line: 573, type: !33, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !37)
!32 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!33 = !DISubroutineType(types: !34)
!34 = !{null, !35, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!37 = !{}
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 54, type: !40, isLocal: true, isDefinition: true)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 1280, elements: !50)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !43, line: 50, size: 256, elements: !44)
!43 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!44 = !{!45, !46, !47, !49}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !42, file: !43, line: 52, baseType: !35, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !42, file: !43, line: 55, baseType: !25, size: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !42, file: !43, line: 56, baseType: !48, size: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !42, file: !43, line: 57, baseType: !25, size: 32, offset: 192)
!50 = !{!51}
!51 = !DISubrange(count: 5)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "line_in", scope: !54, file: !3, line: 110, type: !57, isLocal: true, isDefinition: true)
!54 = distinct !DISubprogram(name: "expand", scope: !3, file: !3, line: 102, type: !55, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !37)
!55 = !DISubroutineType(types: !56)
!56 = !{null}
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2097152, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 262144)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 272, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 34)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "convert_entire_line", scope: !65, file: !66, line: 30, type: !27, isLocal: false, isDefinition: true)
!65 = distinct !DICompileUnit(language: DW_LANG_C99, file: !66, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !67, retainedTypes: !91, globals: !94, splitDebugInlining: false, nameTableKind: None)
!66 = !DIFile(filename: "src/expand-common.c", directory: "/src", checksumkind: CSK_MD5, checksum: "942c25878b2cf9f4cd3ad8d127f8f292")
!67 = !{!5, !68, !82}
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !69, line: 42, baseType: !7, size: 32, elements: !70)
!69 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81}
!71 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!72 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!73 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!74 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!75 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!76 = !DIEnumerator(name: "c_quoting_style", value: 5)
!77 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!78 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!79 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!80 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!81 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !83, line: 44, baseType: !7, size: 32, elements: !84)
!83 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!84 = !{!85, !86, !87, !88, !89, !90}
!85 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!86 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!87 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!88 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!89 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!90 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!91 = !{!25, !26, !27, !92, !93, !24}
!92 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!93 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!94 = !{!63, !95, !97, !158, !163, !165, !173, !175, !177, !179, !181, !183, !188, !191}
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "exit_status", scope: !65, file: !66, line: 69, type: !25, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "prev_file", scope: !99, file: !66, line: 351, type: !22, isLocal: true, isDefinition: true)
!99 = distinct !DISubprogram(name: "next_file", scope: !66, file: !66, line: 349, type: !100, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !65, retainedNodes: !37)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !104, line: 7, baseType: !105)
!104 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !106, line: 49, size: 1728, elements: !107)
!106 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !123, !125, !126, !127, !130, !131, !133, !137, !140, !142, !145, !148, !149, !150, !153, !154}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !105, file: !106, line: 51, baseType: !25, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !105, file: !106, line: 54, baseType: !22, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !105, file: !106, line: 55, baseType: !22, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !105, file: !106, line: 56, baseType: !22, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !105, file: !106, line: 57, baseType: !22, size: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !105, file: !106, line: 58, baseType: !22, size: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !105, file: !106, line: 59, baseType: !22, size: 64, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !105, file: !106, line: 60, baseType: !22, size: 64, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !105, file: !106, line: 61, baseType: !22, size: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !105, file: !106, line: 64, baseType: !22, size: 64, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !105, file: !106, line: 65, baseType: !22, size: 64, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !105, file: !106, line: 66, baseType: !22, size: 64, offset: 704)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !105, file: !106, line: 68, baseType: !121, size: 64, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !106, line: 36, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !105, file: !106, line: 70, baseType: !124, size: 64, offset: 832)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !105, file: !106, line: 72, baseType: !25, size: 32, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !105, file: !106, line: 73, baseType: !25, size: 32, offset: 928)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !105, file: !106, line: 74, baseType: !128, size: 64, offset: 960)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !129, line: 152, baseType: !92)
!129 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !105, file: !106, line: 77, baseType: !26, size: 16, offset: 1024)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !105, file: !106, line: 78, baseType: !132, size: 8, offset: 1040)
!132 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !105, file: !106, line: 79, baseType: !134, size: 8, offset: 1048)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 1)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !105, file: !106, line: 81, baseType: !138, size: 64, offset: 1088)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !106, line: 43, baseType: null)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !105, file: !106, line: 89, baseType: !141, size: 64, offset: 1152)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !129, line: 153, baseType: !92)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !105, file: !106, line: 91, baseType: !143, size: 64, offset: 1216)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !106, line: 37, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !105, file: !106, line: 92, baseType: !146, size: 64, offset: 1280)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !106, line: 38, flags: DIFlagFwdDecl)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !105, file: !106, line: 93, baseType: !124, size: 64, offset: 1344)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !105, file: !106, line: 94, baseType: !24, size: 64, offset: 1408)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !105, file: !106, line: 95, baseType: !151, size: 64, offset: 1472)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !152, line: 46, baseType: !93)
!152 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !105, file: !106, line: 96, baseType: !25, size: 32, offset: 1536)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !105, file: !106, line: 98, baseType: !155, size: 160, offset: 1568)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 160, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 20)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "max_column_width", scope: !65, file: !66, line: 42, type: !160, isLocal: false, isDefinition: true)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !161, line: 130, baseType: !162)
!161 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !152, line: 35, baseType: !92)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "first_free_tab", scope: !65, file: !66, line: 54, type: !160, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "tab_list", scope: !65, file: !66, line: 47, type: !167, isLocal: true, isDefinition: true)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "colno", file: !169, line: 20, baseType: !170)
!169 = !DIFile(filename: "src/expand-common.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a812a23c6054c0178c7555c3090cc098")
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !171, line: 101, baseType: !172)
!171 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !129, line: 72, baseType: !92)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "n_tabs_allocated", scope: !65, file: !66, line: 50, type: !160, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "extend_size", scope: !65, file: !66, line: 36, type: !168, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "increment_size", scope: !65, file: !66, line: 39, type: !168, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "tab_size", scope: !65, file: !66, line: 33, type: !168, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !65, file: !66, line: 66, type: !27, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "stdin_argv", scope: !65, file: !66, line: 60, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 2)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "file_list", scope: !65, file: !66, line: 57, type: !190, isLocal: true, isDefinition: true)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !193, file: !32, line: 575, type: !25, isLocal: true, isDefinition: true)
!193 = distinct !DISubprogram(name: "oputs_", scope: !32, file: !32, line: 573, type: !33, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !37)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "Version", scope: !196, file: !197, line: 3, type: !35, isLocal: false, isDefinition: true)
!196 = distinct !DICompileUnit(language: DW_LANG_C99, file: !197, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !198, splitDebugInlining: false, nameTableKind: None)
!197 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!198 = !{!194}
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "file_name", scope: !201, file: !202, line: 45, type: !35, isLocal: true, isDefinition: true)
!201 = distinct !DICompileUnit(language: DW_LANG_C99, file: !202, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !203, splitDebugInlining: false, nameTableKind: None)
!202 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!203 = !{!199, !204}
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !201, file: !202, line: 55, type: !27, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !208, file: !209, line: 66, type: !237, isLocal: false, isDefinition: true)
!208 = distinct !DICompileUnit(language: DW_LANG_C99, file: !209, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !210, globals: !211, splitDebugInlining: false, nameTableKind: None)
!209 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!210 = !{!24}
!211 = !{!212, !231, !206, !233, !235}
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "old_file_name", scope: !214, file: !209, line: 304, type: !35, isLocal: true, isDefinition: true)
!214 = distinct !DISubprogram(name: "verror_at_line", scope: !209, file: !209, line: 298, type: !215, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !208, retainedNodes: !37)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !25, !25, !35, !7, !35, !217}
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !218, line: 52, baseType: !219)
!218 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !220, line: 32, baseType: !221)
!220 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !222, baseType: !223)
!222 = !DIFile(filename: "lib/error.c", directory: "/src")
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !224, size: 256, elements: !225)
!224 = !DINamespace(name: "std", scope: null)
!225 = !{!226, !227, !228, !229, !230}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !223, file: !222, baseType: !24, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !223, file: !222, baseType: !24, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !223, file: !222, baseType: !24, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !223, file: !222, baseType: !25, size: 32, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !223, file: !222, baseType: !25, size: 32, offset: 224)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "old_line_number", scope: !214, file: !209, line: 305, type: !7, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "error_message_count", scope: !208, file: !209, line: 69, type: !7, isLocal: false, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !208, file: !209, line: 295, type: !25, isLocal: false, isDefinition: true)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "program_name", scope: !240, file: !241, line: 31, type: !35, isLocal: false, isDefinition: true)
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !242, globals: !243, splitDebugInlining: false, nameTableKind: None)
!241 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!242 = !{!22}
!243 = !{!238}
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "utf07FF", scope: !246, file: !247, line: 46, type: !252, isLocal: true, isDefinition: true)
!246 = distinct !DISubprogram(name: "proper_name_lite", scope: !247, file: !247, line: 38, type: !248, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !250, retainedNodes: !37)
!247 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!248 = !DISubroutineType(types: !249)
!249 = !{!35, !35, !35}
!250 = distinct !DICompileUnit(language: DW_LANG_C99, file: !247, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !251, splitDebugInlining: false, nameTableKind: None)
!251 = !{!244}
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 16, elements: !186)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !255, file: !256, line: 76, type: !309, isLocal: false, isDefinition: true)
!255 = distinct !DICompileUnit(language: DW_LANG_C99, file: !256, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !257, retainedTypes: !263, globals: !264, splitDebugInlining: false, nameTableKind: None)
!256 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!257 = !{!68, !258, !5}
!258 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !69, line: 254, baseType: !7, size: 32, elements: !259)
!259 = !{!260, !261, !262}
!260 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!261 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!262 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!263 = !{!25, !26, !151}
!264 = !{!253, !265, !271, !283, !285, !290, !298, !305, !307}
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !255, file: !256, line: 92, type: !267, isLocal: false, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 320, elements: !269)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!269 = !{!270}
!270 = !DISubrange(count: 10)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !255, file: !256, line: 1040, type: !273, isLocal: false, isDefinition: true)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !256, line: 56, size: 448, elements: !274)
!274 = !{!275, !276, !277, !281, !282}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !273, file: !256, line: 59, baseType: !68, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !273, file: !256, line: 62, baseType: !25, size: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !273, file: !256, line: 66, baseType: !278, size: 256, offset: 64)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 8)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !273, file: !256, line: 69, baseType: !35, size: 64, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !273, file: !256, line: 72, baseType: !35, size: 64, offset: 384)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !255, file: !256, line: 107, type: !273, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "slot0", scope: !255, file: !256, line: 831, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2048, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 256)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "quote", scope: !292, file: !256, line: 228, type: !295, isLocal: true, isDefinition: true)
!292 = distinct !DISubprogram(name: "gettext_quote", scope: !256, file: !256, line: 197, type: !293, scopeLine: 198, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !255, retainedNodes: !37)
!293 = !DISubroutineType(types: !294)
!294 = !{!35, !35, !68}
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 64, elements: !296)
!296 = !{!187, !297}
!297 = !DISubrange(count: 4)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "slotvec", scope: !255, file: !256, line: 834, type: !300, isLocal: true, isDefinition: true)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !256, line: 823, size: 128, elements: !302)
!302 = !{!303, !304}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !301, file: !256, line: 825, baseType: !151, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !301, file: !256, line: 826, baseType: !22, size: 64, offset: 64)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "nslots", scope: !255, file: !256, line: 832, type: !25, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "slotvec0", scope: !255, file: !256, line: 833, type: !301, isLocal: true, isDefinition: true)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 704, elements: !311)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!311 = !{!312}
!312 = !DISubrange(count: 11)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !315, file: !316, line: 26, type: !318, isLocal: false, isDefinition: true)
!315 = distinct !DICompileUnit(language: DW_LANG_C99, file: !316, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !317, splitDebugInlining: false, nameTableKind: None)
!316 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!317 = !{!313}
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 376, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 47)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "exit_failure", scope: !323, file: !324, line: 24, type: !326, isLocal: false, isDefinition: true)
!323 = distinct !DICompileUnit(language: DW_LANG_C99, file: !324, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !325, splitDebugInlining: false, nameTableKind: None)
!324 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!325 = !{!321}
!326 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !25)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "internal_state", scope: !329, file: !330, line: 97, type: !334, isLocal: true, isDefinition: true)
!329 = distinct !DICompileUnit(language: DW_LANG_C99, file: !330, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !331, globals: !333, splitDebugInlining: false, nameTableKind: None)
!330 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!331 = !{!24, !151, !332}
!332 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!333 = !{!327}
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !335, line: 6, baseType: !336)
!335 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !337, line: 21, baseType: !338)
!337 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !337, line: 13, size: 64, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !338, file: !337, line: 15, baseType: !25, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !338, file: !337, line: 20, baseType: !342, size: 32, offset: 32)
!342 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !338, file: !337, line: 16, size: 32, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !342, file: !337, line: 18, baseType: !7, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !342, file: !337, line: 19, baseType: !346, size: 32)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 32, elements: !347)
!347 = !{!297}
!348 = distinct !DICompileUnit(language: DW_LANG_C99, file: !349, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!349 = !DIFile(filename: "lib/c-ctype.c", directory: "/src", checksumkind: CSK_MD5, checksum: "245df19f202f37bba31cfa46647ceb93")
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "lib/c32isblank.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fdc50bdf98dbcb7b574dd3202ecd546c")
!352 = distinct !DICompileUnit(language: DW_LANG_C99, file: !353, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!353 = !DIFile(filename: "lib/c32width.c", directory: "/src", checksumkind: CSK_MD5, checksum: "85b2c5ee6f572eb09c0f075561e000ef")
!354 = distinct !DICompileUnit(language: DW_LANG_C99, file: !355, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !356, splitDebugInlining: false, nameTableKind: None)
!355 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!356 = !{!82}
!357 = distinct !DICompileUnit(language: DW_LANG_C99, file: !358, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!358 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!359 = distinct !DICompileUnit(language: DW_LANG_C99, file: !360, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !210, splitDebugInlining: false, nameTableKind: None)
!360 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !362, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!362 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!363 = distinct !DICompileUnit(language: DW_LANG_C99, file: !364, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !210, splitDebugInlining: false, nameTableKind: None)
!364 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!365 = distinct !DICompileUnit(language: DW_LANG_C99, file: !366, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!366 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!367 = distinct !DICompileUnit(language: DW_LANG_C99, file: !368, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !369, retainedTypes: !374, splitDebugInlining: false, nameTableKind: None)
!368 = !DIFile(filename: "lib/mbbuf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b7bac851fa0e451a46f67e401f301ae1")
!369 = !{!370}
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !371, line: 127, baseType: !7, size: 32, elements: !372)
!371 = !DIFile(filename: "./lib/mcel.h", directory: "/src", checksumkind: CSK_MD5, checksum: "1a3948cda8366fd81b1605726e5920d0")
!372 = !{!373}
!373 = !DIEnumerator(name: "MCEL_LEN_MAX", value: 4)
!374 = !{!332}
!375 = distinct !DICompileUnit(language: DW_LANG_C99, file: !376, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !377, retainedTypes: !387, splitDebugInlining: false, nameTableKind: None)
!376 = !DIFile(filename: "lib/mcel.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4bc577b690b70e5442e17a02996a7034")
!377 = !{!370, !378, !381, !384}
!378 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !371, line: 130, baseType: !7, size: 32, elements: !379)
!379 = !{!380}
!380 = !DIEnumerator(name: "MCEL_CHAR_MAX", value: 1114111)
!381 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !371, line: 131, baseType: !7, size: 32, elements: !382)
!382 = !{!383}
!383 = !DIEnumerator(name: "MCEL_ERR_MIN", value: 128)
!384 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !371, line: 150, baseType: !7, size: 32, elements: !385)
!385 = !{!386}
!386 = !DIEnumerator(name: "MCEL_ERR_SHIFT", value: 14)
!387 = !{!151}
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!389 = !DIFile(filename: "lib/streq.c", directory: "/src", checksumkind: CSK_MD5, checksum: "912b0bbb2168195104931254916871aa")
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !392, retainedTypes: !210, splitDebugInlining: false, nameTableKind: None)
!391 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!392 = !{!393}
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !391, line: 40, baseType: !7, size: 32, elements: !394)
!394 = !{!395}
!395 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!396 = distinct !DICompileUnit(language: DW_LANG_C99, file: !397, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !398, retainedTypes: !411, splitDebugInlining: false, nameTableKind: None)
!397 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!398 = !{!399, !406}
!399 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !400, file: !397, line: 188, baseType: !7, size: 32, elements: !404)
!400 = distinct !DISubprogram(name: "x2nrealloc", scope: !397, file: !397, line: 176, type: !401, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !396, retainedNodes: !37)
!401 = !DISubroutineType(types: !402)
!402 = !{!24, !24, !403, !151}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!404 = !{!405}
!405 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!406 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !407, file: !397, line: 228, baseType: !7, size: 32, elements: !404)
!407 = distinct !DISubprogram(name: "xpalloc", scope: !397, file: !397, line: 223, type: !408, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !396, retainedNodes: !37)
!408 = !DISubroutineType(types: !409)
!409 = !{!24, !24, !410, !160, !162, !160}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!411 = !{!22, !24, !27, !92, !93}
!412 = distinct !DICompileUnit(language: DW_LANG_C99, file: !413, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!413 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !210, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!417 = !DIFile(filename: "lib/c32isprint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aac58442c7952a27a6ecb1773b2ef569")
!418 = distinct !DICompileUnit(language: DW_LANG_C99, file: !419, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!419 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!420 = distinct !DICompileUnit(language: DW_LANG_C99, file: !421, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !210, splitDebugInlining: false, nameTableKind: None)
!421 = !DIFile(filename: "lib/ialloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e1d85861a0099c22cc583b5eb5f30423")
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!423 = !DIFile(filename: "lib/mbszero.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1b51b91fccd359a867925f7b0fc988a4")
!424 = distinct !DICompileUnit(language: DW_LANG_C99, file: !425, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!425 = !DIFile(filename: "lib/memeq.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9bf299a5d27acbe732c4d2f0d9a2144a")
!426 = distinct !DICompileUnit(language: DW_LANG_C99, file: !427, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!427 = !DIFile(filename: "lib/realloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a76cd3b708f695a3bf546d626aa758d")
!428 = distinct !DICompileUnit(language: DW_LANG_C99, file: !429, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !430, splitDebugInlining: false, nameTableKind: None)
!429 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!430 = !{!27, !93, !24}
!431 = distinct !DICompileUnit(language: DW_LANG_C99, file: !432, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!432 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!434 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!435 = distinct !DICompileUnit(language: DW_LANG_C99, file: !436, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !210, splitDebugInlining: false, nameTableKind: None)
!436 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!437 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!438 = !{i32 7, !"Dwarf Version", i32 5}
!439 = !{i32 2, !"Debug Info Version", i32 3}
!440 = !{i32 1, !"wchar_size", i32 4}
!441 = !{i32 1, !"branch-target-enforcement", i32 0}
!442 = !{i32 1, !"sign-return-address", i32 0}
!443 = !{i32 1, !"sign-return-address-all", i32 0}
!444 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!445 = !{i32 7, !"PIC Level", i32 2}
!446 = !{i32 7, !"PIE Level", i32 2}
!447 = !{i32 7, !"uwtable", i32 1}
!448 = !{i32 7, !"frame-pointer", i32 1}
!449 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 64, type: !450, scopeLine: 65, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !37)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !25}
!452 = !DILocalVariable(name: "status", arg: 1, scope: !449, file: !3, line: 64, type: !25)
!453 = !DILocation(line: 64, column: 12, scope: !449)
!454 = !DILocation(line: 66, column: 7, scope: !455)
!455 = distinct !DILexicalBlock(scope: !449, file: !3, line: 66, column: 7)
!456 = !DILocation(line: 66, column: 14, scope: !455)
!457 = !DILocation(line: 66, column: 7, scope: !449)
!458 = !DILocation(line: 67, column: 5, scope: !455)
!459 = !DILocation(line: 67, column: 5, scope: !460)
!460 = distinct !DILexicalBlock(scope: !455, file: !3, line: 67, column: 5)
!461 = !DILocation(line: 70, column: 15, scope: !462)
!462 = distinct !DILexicalBlock(scope: !455, file: !3, line: 69, column: 5)
!463 = !DILocation(line: 73, column: 15, scope: !462)
!464 = !DILocation(line: 70, column: 7, scope: !462)
!465 = !DILocation(line: 74, column: 7, scope: !462)
!466 = !DILocation(line: 78, column: 7, scope: !462)
!467 = !DILocation(line: 79, column: 7, scope: !462)
!468 = !DILocation(line: 81, column: 7, scope: !462)
!469 = !DILocation(line: 85, column: 7, scope: !462)
!470 = !DILocation(line: 89, column: 7, scope: !462)
!471 = !DILocation(line: 90, column: 7, scope: !462)
!472 = !DILocation(line: 91, column: 7, scope: !462)
!473 = !DILocation(line: 92, column: 7, scope: !462)
!474 = !DILocation(line: 94, column: 9, scope: !449)
!475 = !DILocation(line: 94, column: 3, scope: !449)
!476 = distinct !DISubprogram(name: "emit_stdin_note", scope: !32, file: !32, line: 727, type: !55, scopeLine: 728, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !37)
!477 = !DILocation(line: 729, column: 3, scope: !476)
!478 = !DILocation(line: 732, column: 1, scope: !476)
!479 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !32, file: !32, line: 734, type: !55, scopeLine: 735, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !37)
!480 = !DILocation(line: 736, column: 3, scope: !479)
!481 = !DILocation(line: 739, column: 1, scope: !479)
!482 = !DILocalVariable(name: "program", arg: 1, scope: !31, file: !32, line: 573, type: !35)
!483 = !DILocation(line: 573, column: 34, scope: !31)
!484 = !DILocalVariable(name: "option", arg: 2, scope: !31, file: !32, line: 573, type: !35)
!485 = !DILocation(line: 573, column: 55, scope: !31)
!486 = !DILocation(line: 581, column: 7, scope: !487)
!487 = distinct !DILexicalBlock(scope: !31, file: !32, line: 581, column: 7)
!488 = !DILocation(line: 581, column: 19, scope: !487)
!489 = !DILocation(line: 581, column: 7, scope: !31)
!490 = !DILocalVariable(name: "term", scope: !491, file: !32, line: 585, type: !35)
!491 = distinct !DILexicalBlock(scope: !487, file: !32, line: 582, column: 5)
!492 = !DILocation(line: 585, column: 19, scope: !491)
!493 = !DILocation(line: 585, column: 26, scope: !491)
!494 = !DILocation(line: 586, column: 23, scope: !491)
!495 = !DILocation(line: 586, column: 28, scope: !491)
!496 = !DILocation(line: 586, column: 33, scope: !491)
!497 = !DILocation(line: 586, column: 32, scope: !491)
!498 = !DILocation(line: 586, column: 38, scope: !491)
!499 = !DILocation(line: 586, column: 48, scope: !491)
!500 = !DILocation(line: 586, column: 41, scope: !491)
!501 = !DILocation(line: 586, column: 19, scope: !491)
!502 = !DILocation(line: 587, column: 5, scope: !491)
!503 = !DILocation(line: 588, column: 7, scope: !504)
!504 = distinct !DILexicalBlock(scope: !31, file: !32, line: 588, column: 7)
!505 = !DILocation(line: 588, column: 7, scope: !31)
!506 = !DILocation(line: 590, column: 7, scope: !507)
!507 = distinct !DILexicalBlock(scope: !504, file: !32, line: 589, column: 5)
!508 = !DILocation(line: 591, column: 7, scope: !507)
!509 = !DILocalVariable(name: "double_space", scope: !31, file: !32, line: 594, type: !27)
!510 = !DILocation(line: 594, column: 8, scope: !31)
!511 = !DILocalVariable(name: "first_word", scope: !31, file: !32, line: 595, type: !35)
!512 = !DILocation(line: 595, column: 15, scope: !31)
!513 = !DILocation(line: 595, column: 28, scope: !31)
!514 = !DILocation(line: 595, column: 45, scope: !31)
!515 = !DILocation(line: 595, column: 37, scope: !31)
!516 = !DILocation(line: 595, column: 35, scope: !31)
!517 = !DILocalVariable(name: "option_text", scope: !31, file: !32, line: 596, type: !35)
!518 = !DILocation(line: 596, column: 15, scope: !31)
!519 = !DILocation(line: 596, column: 37, scope: !31)
!520 = !DILocation(line: 596, column: 29, scope: !31)
!521 = !DILocation(line: 597, column: 8, scope: !522)
!522 = distinct !DILexicalBlock(scope: !31, file: !32, line: 597, column: 7)
!523 = !DILocation(line: 597, column: 7, scope: !31)
!524 = !DILocation(line: 599, column: 21, scope: !525)
!525 = distinct !DILexicalBlock(scope: !522, file: !32, line: 598, column: 5)
!526 = !DILocation(line: 599, column: 19, scope: !525)
!527 = !DILocation(line: 602, column: 20, scope: !525)
!528 = !DILocation(line: 603, column: 5, scope: !525)
!529 = !DILocation(line: 604, column: 12, scope: !530)
!530 = distinct !DILexicalBlock(scope: !522, file: !32, line: 604, column: 12)
!531 = !DILocation(line: 604, column: 27, scope: !530)
!532 = !DILocation(line: 604, column: 24, scope: !530)
!533 = !DILocation(line: 604, column: 12, scope: !522)
!534 = !DILocalVariable(name: "s", scope: !535, file: !32, line: 608, type: !35)
!535 = distinct !DILexicalBlock(scope: !530, file: !32, line: 605, column: 5)
!536 = !DILocation(line: 608, column: 19, scope: !535)
!537 = !DILocation(line: 608, column: 23, scope: !535)
!538 = !DILocalVariable(name: "spaces", scope: !535, file: !32, line: 609, type: !151)
!539 = !DILocation(line: 609, column: 14, scope: !535)
!540 = !DILocation(line: 610, column: 7, scope: !535)
!541 = !DILocation(line: 610, column: 14, scope: !535)
!542 = !DILocation(line: 610, column: 18, scope: !535)
!543 = !DILocation(line: 610, column: 16, scope: !535)
!544 = !DILocation(line: 610, column: 30, scope: !535)
!545 = !DILocation(line: 610, column: 33, scope: !535)
!546 = !DILocation(line: 610, column: 40, scope: !535)
!547 = !DILocation(line: 0, scope: !535)
!548 = !DILocation(line: 611, column: 21, scope: !535)
!549 = !DILocation(line: 611, column: 20, scope: !535)
!550 = !DILocation(line: 611, column: 19, scope: !535)
!551 = !DILocation(line: 611, column: 16, scope: !535)
!552 = distinct !{!552, !540, !548, !553}
!553 = !{!"llvm.loop.mustprogress"}
!554 = !DILocation(line: 612, column: 11, scope: !555)
!555 = distinct !DILexicalBlock(scope: !535, file: !32, line: 612, column: 11)
!556 = !DILocation(line: 612, column: 18, scope: !555)
!557 = !DILocation(line: 612, column: 11, scope: !535)
!558 = !DILocation(line: 615, column: 25, scope: !559)
!559 = distinct !DILexicalBlock(scope: !555, file: !32, line: 613, column: 9)
!560 = !DILocation(line: 615, column: 23, scope: !559)
!561 = !DILocation(line: 616, column: 24, scope: !559)
!562 = !DILocation(line: 617, column: 9, scope: !559)
!563 = !DILocation(line: 618, column: 5, scope: !535)
!564 = !DILocalVariable(name: "anchor_len", scope: !31, file: !32, line: 620, type: !151)
!565 = !DILocation(line: 620, column: 10, scope: !31)
!566 = !DILocation(line: 620, column: 32, scope: !31)
!567 = !DILocation(line: 620, column: 23, scope: !31)
!568 = !DILocalVariable(name: "desc_text", scope: !31, file: !32, line: 625, type: !35)
!569 = !DILocation(line: 625, column: 15, scope: !31)
!570 = !DILocation(line: 625, column: 27, scope: !31)
!571 = !DILocation(line: 625, column: 41, scope: !31)
!572 = !DILocation(line: 625, column: 39, scope: !31)
!573 = !DILocation(line: 626, column: 3, scope: !31)
!574 = !DILocation(line: 626, column: 11, scope: !31)
!575 = !DILocation(line: 626, column: 10, scope: !31)
!576 = !DILocation(line: 626, column: 21, scope: !31)
!577 = !DILocation(line: 626, column: 25, scope: !31)
!578 = !DILocation(line: 626, column: 24, scope: !31)
!579 = !DILocation(line: 626, column: 35, scope: !31)
!580 = !DILocation(line: 0, scope: !31)
!581 = !DILocation(line: 628, column: 12, scope: !582)
!582 = distinct !DILexicalBlock(scope: !583, file: !32, line: 628, column: 11)
!583 = distinct !DILexicalBlock(scope: !31, file: !32, line: 627, column: 5)
!584 = !DILocation(line: 628, column: 11, scope: !582)
!585 = !DILocation(line: 628, column: 22, scope: !582)
!586 = !DILocation(line: 628, column: 29, scope: !582)
!587 = !DILocation(line: 628, column: 34, scope: !582)
!588 = !DILocation(line: 628, column: 44, scope: !582)
!589 = !DILocation(line: 628, column: 32, scope: !582)
!590 = !DILocation(line: 628, column: 49, scope: !582)
!591 = !DILocation(line: 628, column: 11, scope: !583)
!592 = !DILocation(line: 629, column: 22, scope: !582)
!593 = !DILocation(line: 629, column: 9, scope: !582)
!594 = !DILocation(line: 630, column: 11, scope: !595)
!595 = distinct !DILexicalBlock(scope: !583, file: !32, line: 630, column: 11)
!596 = !DILocation(line: 630, column: 11, scope: !583)
!597 = !DILocation(line: 632, column: 16, scope: !598)
!598 = distinct !DILexicalBlock(scope: !599, file: !32, line: 632, column: 15)
!599 = distinct !DILexicalBlock(scope: !595, file: !32, line: 631, column: 9)
!600 = !DILocation(line: 632, column: 15, scope: !598)
!601 = !DILocation(line: 632, column: 26, scope: !598)
!602 = !DILocation(line: 632, column: 34, scope: !598)
!603 = !DILocation(line: 632, column: 37, scope: !598)
!604 = !DILocation(line: 632, column: 15, scope: !599)
!605 = !DILocation(line: 633, column: 13, scope: !598)
!606 = !DILocation(line: 636, column: 16, scope: !607)
!607 = distinct !DILexicalBlock(scope: !599, file: !32, line: 636, column: 15)
!608 = !DILocation(line: 636, column: 29, scope: !607)
!609 = !DILocation(line: 636, column: 34, scope: !607)
!610 = !DILocation(line: 636, column: 44, scope: !607)
!611 = !DILocation(line: 636, column: 32, scope: !607)
!612 = !DILocation(line: 636, column: 49, scope: !607)
!613 = !DILocation(line: 636, column: 15, scope: !599)
!614 = !DILocation(line: 637, column: 13, scope: !607)
!615 = !DILocation(line: 638, column: 9, scope: !599)
!616 = !DILocation(line: 640, column: 16, scope: !583)
!617 = distinct !{!617, !573, !618, !553}
!618 = !DILocation(line: 641, column: 5, scope: !31)
!619 = !DILocation(line: 644, column: 3, scope: !31)
!620 = !DILocalVariable(name: "url_program", scope: !31, file: !32, line: 648, type: !35)
!621 = !DILocation(line: 648, column: 15, scope: !31)
!622 = !DILocation(line: 648, column: 38, scope: !31)
!623 = !DILocation(line: 648, column: 31, scope: !31)
!624 = !DILocation(line: 649, column: 38, scope: !31)
!625 = !DILocation(line: 649, column: 31, scope: !31)
!626 = !DILocation(line: 650, column: 38, scope: !31)
!627 = !DILocation(line: 650, column: 31, scope: !31)
!628 = !DILocation(line: 651, column: 38, scope: !31)
!629 = !DILocation(line: 651, column: 31, scope: !31)
!630 = !DILocation(line: 652, column: 38, scope: !31)
!631 = !DILocation(line: 652, column: 31, scope: !31)
!632 = !DILocation(line: 653, column: 38, scope: !31)
!633 = !DILocation(line: 653, column: 31, scope: !31)
!634 = !DILocation(line: 654, column: 38, scope: !31)
!635 = !DILocation(line: 654, column: 31, scope: !31)
!636 = !DILocation(line: 655, column: 38, scope: !31)
!637 = !DILocation(line: 655, column: 31, scope: !31)
!638 = !DILocation(line: 656, column: 38, scope: !31)
!639 = !DILocation(line: 656, column: 31, scope: !31)
!640 = !DILocation(line: 657, column: 38, scope: !31)
!641 = !DILocation(line: 657, column: 31, scope: !31)
!642 = !DILocation(line: 658, column: 31, scope: !31)
!643 = !DILocation(line: 663, column: 7, scope: !644)
!644 = distinct !DILexicalBlock(scope: !31, file: !32, line: 663, column: 7)
!645 = !DILocation(line: 664, column: 7, scope: !644)
!646 = !DILocation(line: 664, column: 10, scope: !644)
!647 = !DILocation(line: 663, column: 7, scope: !31)
!648 = !DILocation(line: 670, column: 15, scope: !649)
!649 = distinct !DILexicalBlock(scope: !644, file: !32, line: 665, column: 5)
!650 = !DILocation(line: 670, column: 28, scope: !649)
!651 = !DILocation(line: 670, column: 47, scope: !649)
!652 = !DILocation(line: 670, column: 41, scope: !649)
!653 = !DILocation(line: 670, column: 59, scope: !649)
!654 = !DILocation(line: 669, column: 7, scope: !649)
!655 = !DILocation(line: 671, column: 5, scope: !649)
!656 = !DILocation(line: 676, column: 48, scope: !657)
!657 = distinct !DILexicalBlock(scope: !644, file: !32, line: 673, column: 5)
!658 = !DILocation(line: 677, column: 21, scope: !657)
!659 = !DILocation(line: 677, column: 15, scope: !657)
!660 = !DILocation(line: 677, column: 33, scope: !657)
!661 = !DILocation(line: 676, column: 7, scope: !657)
!662 = !DILocation(line: 679, column: 3, scope: !31)
!663 = !DILocation(line: 683, column: 3, scope: !31)
!664 = !DILocation(line: 686, column: 3, scope: !31)
!665 = !DILocation(line: 688, column: 3, scope: !31)
!666 = !DILocation(line: 691, column: 3, scope: !31)
!667 = !DILocation(line: 695, column: 3, scope: !31)
!668 = !DILocation(line: 696, column: 1, scope: !31)
!669 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !32, file: !32, line: 836, type: !670, scopeLine: 837, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !37)
!670 = !DISubroutineType(types: !671)
!671 = !{null, !35}
!672 = !DILocalVariable(name: "program", arg: 1, scope: !669, file: !32, line: 836, type: !35)
!673 = !DILocation(line: 836, column: 34, scope: !669)
!674 = !DILocalVariable(name: "infomap", scope: !669, file: !32, line: 838, type: !675)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 896, elements: !681)
!676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !669, file: !32, line: 838, size: 128, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !677, file: !32, line: 838, baseType: !35, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !677, file: !32, line: 838, baseType: !35, size: 64, offset: 64)
!681 = !{!682}
!682 = !DISubrange(count: 7)
!683 = !DILocation(line: 838, column: 67, scope: !669)
!684 = !DILocalVariable(name: "node", scope: !669, file: !32, line: 848, type: !35)
!685 = !DILocation(line: 848, column: 15, scope: !669)
!686 = !DILocation(line: 848, column: 22, scope: !669)
!687 = !DILocalVariable(name: "map_prog", scope: !669, file: !32, line: 849, type: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!689 = !DILocation(line: 849, column: 25, scope: !669)
!690 = !DILocation(line: 849, column: 36, scope: !669)
!691 = !DILocation(line: 851, column: 3, scope: !669)
!692 = !DILocation(line: 851, column: 10, scope: !669)
!693 = !DILocation(line: 851, column: 20, scope: !669)
!694 = !DILocation(line: 851, column: 28, scope: !669)
!695 = !DILocation(line: 851, column: 40, scope: !669)
!696 = !DILocation(line: 851, column: 49, scope: !669)
!697 = !DILocation(line: 851, column: 59, scope: !669)
!698 = !DILocation(line: 851, column: 33, scope: !669)
!699 = !DILocation(line: 851, column: 31, scope: !669)
!700 = !DILocation(line: 0, scope: !669)
!701 = !DILocation(line: 852, column: 13, scope: !669)
!702 = distinct !{!702, !691, !701, !553}
!703 = !DILocation(line: 854, column: 7, scope: !704)
!704 = distinct !DILexicalBlock(scope: !669, file: !32, line: 854, column: 7)
!705 = !DILocation(line: 854, column: 17, scope: !704)
!706 = !DILocation(line: 854, column: 7, scope: !669)
!707 = !DILocation(line: 855, column: 12, scope: !704)
!708 = !DILocation(line: 855, column: 22, scope: !704)
!709 = !DILocation(line: 855, column: 10, scope: !704)
!710 = !DILocation(line: 855, column: 5, scope: !704)
!711 = !DILocation(line: 857, column: 3, scope: !669)
!712 = !DILocalVariable(name: "lc_messages", scope: !669, file: !32, line: 861, type: !35)
!713 = !DILocation(line: 861, column: 15, scope: !669)
!714 = !DILocation(line: 861, column: 29, scope: !669)
!715 = !DILocation(line: 862, column: 7, scope: !716)
!716 = distinct !DILexicalBlock(scope: !669, file: !32, line: 862, column: 7)
!717 = !DILocation(line: 862, column: 19, scope: !716)
!718 = !DILocation(line: 862, column: 22, scope: !716)
!719 = !DILocation(line: 862, column: 7, scope: !669)
!720 = !DILocation(line: 868, column: 7, scope: !721)
!721 = distinct !DILexicalBlock(scope: !716, file: !32, line: 863, column: 5)
!722 = !DILocation(line: 870, column: 5, scope: !721)
!723 = !DILocalVariable(name: "url_program", scope: !669, file: !32, line: 874, type: !35)
!724 = !DILocation(line: 874, column: 15, scope: !669)
!725 = !DILocation(line: 874, column: 36, scope: !669)
!726 = !DILocation(line: 874, column: 29, scope: !669)
!727 = !DILocation(line: 874, column: 61, scope: !669)
!728 = !DILocation(line: 875, column: 11, scope: !669)
!729 = !DILocation(line: 876, column: 24, scope: !669)
!730 = !DILocation(line: 875, column: 3, scope: !669)
!731 = !DILocation(line: 877, column: 11, scope: !669)
!732 = !DILocation(line: 878, column: 11, scope: !669)
!733 = !DILocation(line: 878, column: 17, scope: !669)
!734 = !DILocation(line: 878, column: 25, scope: !669)
!735 = !DILocation(line: 878, column: 22, scope: !669)
!736 = !DILocation(line: 877, column: 3, scope: !669)
!737 = !DILocation(line: 879, column: 1, scope: !669)
!738 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 189, type: !739, scopeLine: 190, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !37)
!739 = !DISubroutineType(types: !740)
!740 = !{!25, !25, !190}
!741 = !DILocalVariable(name: "argc", arg: 1, scope: !738, file: !3, line: 189, type: !25)
!742 = !DILocation(line: 189, column: 11, scope: !738)
!743 = !DILocalVariable(name: "argv", arg: 2, scope: !738, file: !3, line: 189, type: !190)
!744 = !DILocation(line: 189, column: 24, scope: !738)
!745 = !DILocalVariable(name: "c", scope: !738, file: !3, line: 191, type: !25)
!746 = !DILocation(line: 191, column: 7, scope: !738)
!747 = !DILocation(line: 194, column: 21, scope: !738)
!748 = !DILocation(line: 194, column: 3, scope: !738)
!749 = !DILocation(line: 195, column: 3, scope: !738)
!750 = !DILocation(line: 196, column: 3, scope: !738)
!751 = !DILocation(line: 197, column: 3, scope: !738)
!752 = !DILocation(line: 199, column: 3, scope: !738)
!753 = !DILocation(line: 200, column: 23, scope: !738)
!754 = !DILocation(line: 202, column: 3, scope: !738)
!755 = !DILocation(line: 202, column: 28, scope: !738)
!756 = !DILocation(line: 202, column: 34, scope: !738)
!757 = !DILocation(line: 202, column: 15, scope: !738)
!758 = !DILocation(line: 202, column: 13, scope: !738)
!759 = !DILocation(line: 202, column: 68, scope: !738)
!760 = !DILocation(line: 204, column: 15, scope: !761)
!761 = distinct !DILexicalBlock(scope: !738, file: !3, line: 203, column: 5)
!762 = !DILocation(line: 204, column: 7, scope: !761)
!763 = !DILocation(line: 207, column: 31, scope: !764)
!764 = distinct !DILexicalBlock(scope: !761, file: !3, line: 205, column: 9)
!765 = !DILocation(line: 208, column: 11, scope: !764)
!766 = !DILocation(line: 211, column: 28, scope: !764)
!767 = !DILocation(line: 211, column: 11, scope: !764)
!768 = !DILocation(line: 212, column: 11, scope: !764)
!769 = !DILocation(line: 216, column: 15, scope: !770)
!770 = distinct !DILexicalBlock(scope: !764, file: !3, line: 216, column: 15)
!771 = !DILocation(line: 216, column: 15, scope: !764)
!772 = !DILocation(line: 217, column: 30, scope: !770)
!773 = !DILocation(line: 217, column: 37, scope: !770)
!774 = !DILocation(line: 217, column: 13, scope: !770)
!775 = !DILocalVariable(name: "tab_stop", scope: !776, file: !3, line: 220, type: !777)
!776 = distinct !DILexicalBlock(scope: !770, file: !3, line: 219, column: 13)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 16, elements: !186)
!778 = !DILocation(line: 220, column: 20, scope: !776)
!779 = !DILocation(line: 221, column: 29, scope: !776)
!780 = !DILocation(line: 221, column: 15, scope: !776)
!781 = !DILocation(line: 221, column: 27, scope: !776)
!782 = !DILocation(line: 222, column: 15, scope: !776)
!783 = !DILocation(line: 222, column: 27, scope: !776)
!784 = !DILocation(line: 223, column: 32, scope: !776)
!785 = !DILocation(line: 223, column: 15, scope: !776)
!786 = !DILocation(line: 225, column: 11, scope: !764)
!787 = !DILocation(line: 227, column: 9, scope: !764)
!788 = !DILocation(line: 229, column: 9, scope: !764)
!789 = !DILocation(line: 232, column: 11, scope: !764)
!790 = distinct !{!790, !754, !791, !553}
!791 = !DILocation(line: 234, column: 5, scope: !738)
!792 = !DILocation(line: 236, column: 3, scope: !738)
!793 = !DILocation(line: 238, column: 18, scope: !738)
!794 = !DILocation(line: 238, column: 27, scope: !738)
!795 = !DILocation(line: 238, column: 25, scope: !738)
!796 = !DILocation(line: 238, column: 35, scope: !738)
!797 = !DILocation(line: 238, column: 40, scope: !738)
!798 = !DILocation(line: 238, column: 3, scope: !738)
!799 = !DILocation(line: 240, column: 3, scope: !738)
!800 = !DILocation(line: 242, column: 3, scope: !738)
!801 = !DILocation(line: 244, column: 10, scope: !738)
!802 = !DILocation(line: 244, column: 3, scope: !738)
!803 = !DILocalVariable(name: "fp", scope: !54, file: !3, line: 105, type: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !104, line: 7, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !106, line: 49, size: 1728, elements: !807)
!807 = !{!808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !806, file: !106, line: 51, baseType: !25, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !806, file: !106, line: 54, baseType: !22, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !806, file: !106, line: 55, baseType: !22, size: 64, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !806, file: !106, line: 56, baseType: !22, size: 64, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !806, file: !106, line: 57, baseType: !22, size: 64, offset: 256)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !806, file: !106, line: 58, baseType: !22, size: 64, offset: 320)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !806, file: !106, line: 59, baseType: !22, size: 64, offset: 384)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !806, file: !106, line: 60, baseType: !22, size: 64, offset: 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !806, file: !106, line: 61, baseType: !22, size: 64, offset: 512)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !806, file: !106, line: 64, baseType: !22, size: 64, offset: 576)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !806, file: !106, line: 65, baseType: !22, size: 64, offset: 640)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !806, file: !106, line: 66, baseType: !22, size: 64, offset: 704)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !806, file: !106, line: 68, baseType: !121, size: 64, offset: 768)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !806, file: !106, line: 70, baseType: !822, size: 64, offset: 832)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !806, file: !106, line: 72, baseType: !25, size: 32, offset: 896)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !806, file: !106, line: 73, baseType: !25, size: 32, offset: 928)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !806, file: !106, line: 74, baseType: !128, size: 64, offset: 960)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !806, file: !106, line: 77, baseType: !26, size: 16, offset: 1024)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !806, file: !106, line: 78, baseType: !132, size: 8, offset: 1040)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !806, file: !106, line: 79, baseType: !134, size: 8, offset: 1048)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !806, file: !106, line: 81, baseType: !138, size: 64, offset: 1088)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !806, file: !106, line: 89, baseType: !141, size: 64, offset: 1152)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !806, file: !106, line: 91, baseType: !143, size: 64, offset: 1216)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !806, file: !106, line: 92, baseType: !146, size: 64, offset: 1280)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !806, file: !106, line: 93, baseType: !822, size: 64, offset: 1344)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !806, file: !106, line: 94, baseType: !24, size: 64, offset: 1408)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !806, file: !106, line: 95, baseType: !151, size: 64, offset: 1472)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !806, file: !106, line: 96, baseType: !25, size: 32, offset: 1536)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !806, file: !106, line: 98, baseType: !155, size: 160, offset: 1568)
!838 = !DILocation(line: 105, column: 9, scope: !54)
!839 = !DILocation(line: 105, column: 14, scope: !54)
!840 = !DILocation(line: 107, column: 8, scope: !841)
!841 = distinct !DILexicalBlock(scope: !54, file: !3, line: 107, column: 7)
!842 = !DILocation(line: 107, column: 7, scope: !54)
!843 = !DILocation(line: 108, column: 5, scope: !841)
!844 = !DILocalVariable(name: "mbbuf", scope: !54, file: !3, line: 111, type: !845)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbbuf_t", file: !846, line: 50, baseType: !847)
!846 = !DIFile(filename: "./lib/mbbuf.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0ec2f2727b8356ce94eb797f3e7bb5fd")
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !846, line: 43, size: 320, elements: !848)
!848 = !{!849, !850, !851, !852, !853}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !847, file: !846, line: 45, baseType: !22, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !847, file: !846, line: 46, baseType: !804, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !847, file: !846, line: 47, baseType: !160, size: 64, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !847, file: !846, line: 48, baseType: !160, size: 64, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !847, file: !846, line: 49, baseType: !160, size: 64, offset: 256)
!854 = !DILocation(line: 111, column: 11, scope: !54)
!855 = !DILocation(line: 112, column: 48, scope: !54)
!856 = !DILocation(line: 112, column: 3, scope: !54)
!857 = !DILocation(line: 114, column: 3, scope: !54)
!858 = !DILocalVariable(name: "g", scope: !859, file: !3, line: 117, type: !860)
!859 = distinct !DILexicalBlock(scope: !54, file: !3, line: 115, column: 5)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "mcel_t", file: !371, line: 143, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 138, size: 64, elements: !862)
!862 = !{!863, !868, !869}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !861, file: !371, line: 140, baseType: !864, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !865, line: 37, baseType: !866)
!865 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !129, line: 57, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !129, line: 42, baseType: !7)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !861, file: !371, line: 141, baseType: !332, size: 8, offset: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !861, file: !371, line: 142, baseType: !332, size: 8, offset: 40)
!870 = !DILocation(line: 117, column: 14, scope: !859)
!871 = !DILocalVariable(name: "convert", scope: !859, file: !3, line: 120, type: !27)
!872 = !DILocation(line: 120, column: 12, scope: !859)
!873 = !DILocalVariable(name: "column", scope: !859, file: !3, line: 127, type: !168)
!874 = !DILocation(line: 127, column: 13, scope: !859)
!875 = !DILocalVariable(name: "tab_index", scope: !859, file: !3, line: 130, type: !160)
!876 = !DILocation(line: 130, column: 13, scope: !859)
!877 = !DILocation(line: 135, column: 7, scope: !859)
!878 = !DILocation(line: 137, column: 11, scope: !879)
!879 = distinct !DILexicalBlock(scope: !859, file: !3, line: 136, column: 9)
!880 = !DILocation(line: 137, column: 23, scope: !879)
!881 = !DILocation(line: 137, column: 21, scope: !879)
!882 = !DILocation(line: 137, column: 48, scope: !879)
!883 = !DILocation(line: 137, column: 51, scope: !879)
!884 = !DILocation(line: 138, column: 18, scope: !879)
!885 = !DILocation(line: 138, column: 38, scope: !879)
!886 = !DILocation(line: 138, column: 27, scope: !879)
!887 = !DILocation(line: 138, column: 25, scope: !879)
!888 = !DILocation(line: 0, scope: !879)
!889 = !DILocation(line: 139, column: 58, scope: !879)
!890 = !DILocation(line: 139, column: 13, scope: !879)
!891 = distinct !{!891, !878, !892, !553}
!892 = !DILocation(line: 139, column: 60, scope: !879)
!893 = !DILocation(line: 141, column: 15, scope: !894)
!894 = distinct !DILexicalBlock(scope: !879, file: !3, line: 141, column: 15)
!895 = !DILocation(line: 141, column: 15, scope: !879)
!896 = !DILocation(line: 143, column: 26, scope: !897)
!897 = distinct !DILexicalBlock(scope: !894, file: !3, line: 142, column: 13)
!898 = !DILocation(line: 143, column: 46, scope: !897)
!899 = !DILocation(line: 143, column: 61, scope: !897)
!900 = !DILocation(line: 143, column: 49, scope: !897)
!901 = !DILocation(line: 143, column: 23, scope: !897)
!902 = !DILocation(line: 145, column: 21, scope: !903)
!903 = distinct !DILexicalBlock(scope: !897, file: !3, line: 145, column: 19)
!904 = !DILocation(line: 145, column: 24, scope: !903)
!905 = !DILocation(line: 145, column: 19, scope: !897)
!906 = !DILocalVariable(name: "last_tab", scope: !907, file: !3, line: 148, type: !27)
!907 = distinct !DILexicalBlock(scope: !903, file: !3, line: 146, column: 17)
!908 = !DILocation(line: 148, column: 24, scope: !907)
!909 = !DILocalVariable(name: "next_tab_column", scope: !907, file: !3, line: 149, type: !168)
!910 = !DILocation(line: 149, column: 25, scope: !907)
!911 = !DILocation(line: 150, column: 44, scope: !907)
!912 = !DILocation(line: 150, column: 23, scope: !907)
!913 = !DILocation(line: 152, column: 19, scope: !907)
!914 = !DILocation(line: 152, column: 26, scope: !907)
!915 = !DILocation(line: 152, column: 37, scope: !907)
!916 = !DILocation(line: 152, column: 35, scope: !907)
!917 = !DILocation(line: 153, column: 25, scope: !918)
!918 = distinct !DILexicalBlock(scope: !907, file: !3, line: 153, column: 25)
!919 = !DILocation(line: 153, column: 39, scope: !918)
!920 = !DILocation(line: 153, column: 25, scope: !907)
!921 = !DILocation(line: 154, column: 23, scope: !918)
!922 = distinct !{!922, !913, !923, !553}
!923 = !DILocation(line: 154, column: 36, scope: !907)
!924 = !DILocation(line: 156, column: 23, scope: !925)
!925 = distinct !DILexicalBlock(scope: !907, file: !3, line: 156, column: 23)
!926 = !DILocation(line: 156, column: 37, scope: !925)
!927 = !DILocation(line: 156, column: 23, scope: !907)
!928 = !DILocation(line: 157, column: 21, scope: !925)
!929 = !DILocation(line: 159, column: 19, scope: !907)
!930 = !DILocation(line: 161, column: 26, scope: !931)
!931 = distinct !DILexicalBlock(scope: !903, file: !3, line: 161, column: 24)
!932 = !DILocation(line: 161, column: 29, scope: !931)
!933 = !DILocation(line: 161, column: 24, scope: !903)
!934 = !DILocation(line: 165, column: 31, scope: !935)
!935 = distinct !DILexicalBlock(scope: !931, file: !3, line: 162, column: 17)
!936 = !DILocation(line: 165, column: 30, scope: !935)
!937 = !DILocation(line: 165, column: 29, scope: !935)
!938 = !DILocation(line: 165, column: 26, scope: !935)
!939 = !DILocation(line: 166, column: 34, scope: !935)
!940 = !DILocation(line: 166, column: 33, scope: !935)
!941 = !DILocation(line: 166, column: 32, scope: !935)
!942 = !DILocation(line: 166, column: 29, scope: !935)
!943 = !DILocation(line: 167, column: 17, scope: !935)
!944 = !DILocalVariable(name: "width", scope: !945, file: !3, line: 170, type: !25)
!945 = distinct !DILexicalBlock(scope: !931, file: !3, line: 169, column: 17)
!946 = !DILocation(line: 170, column: 23, scope: !945)
!947 = !DILocation(line: 170, column: 43, scope: !945)
!948 = !DILocation(line: 170, column: 31, scope: !945)
!949 = !DILocation(line: 171, column: 23, scope: !950)
!950 = distinct !DILexicalBlock(scope: !945, file: !3, line: 171, column: 23)
!951 = !DILocation(line: 171, column: 23, scope: !945)
!952 = !DILocation(line: 172, column: 21, scope: !950)
!953 = !DILocation(line: 175, column: 13, scope: !897)
!954 = !DILocation(line: 177, column: 17, scope: !955)
!955 = distinct !DILexicalBlock(scope: !879, file: !3, line: 177, column: 15)
!956 = !DILocation(line: 177, column: 20, scope: !955)
!957 = !DILocation(line: 177, column: 15, scope: !879)
!958 = !DILocation(line: 178, column: 13, scope: !955)
!959 = !DILocation(line: 180, column: 11, scope: !879)
!960 = !DILocation(line: 181, column: 15, scope: !961)
!961 = distinct !DILexicalBlock(scope: !879, file: !3, line: 181, column: 15)
!962 = !DILocation(line: 181, column: 15, scope: !879)
!963 = !DILocation(line: 182, column: 13, scope: !961)
!964 = !DILocation(line: 183, column: 9, scope: !879)
!965 = !DILocation(line: 184, column: 16, scope: !859)
!966 = !DILocation(line: 184, column: 19, scope: !859)
!967 = distinct !{!967, !877, !968, !553}
!968 = !DILocation(line: 184, column: 26, scope: !859)
!969 = distinct !{!969, !857, !970}
!970 = !DILocation(line: 185, column: 5, scope: !54)
!971 = !DILocation(line: 186, column: 1, scope: !54)
!972 = distinct !DISubprogram(name: "c32issep", scope: !32, file: !32, line: 178, type: !973, scopeLine: 179, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !37)
!973 = !DISubroutineType(types: !974)
!974 = !{!27, !864}
!975 = !DILocalVariable(name: "wc", arg: 1, scope: !972, file: !32, line: 178, type: !864)
!976 = !DILocation(line: 178, column: 20, scope: !972)
!977 = !DILocation(line: 181, column: 25, scope: !972)
!978 = !DILocation(line: 181, column: 13, scope: !972)
!979 = !DILocation(line: 181, column: 11, scope: !972)
!980 = !DILocation(line: 181, column: 10, scope: !972)
!981 = !DILocation(line: 181, column: 3, scope: !972)
!982 = distinct !DISubprogram(name: "write_error", scope: !32, file: !32, line: 946, type: !55, scopeLine: 947, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !37)
!983 = !DILocalVariable(name: "saved_errno", scope: !982, file: !32, line: 948, type: !25)
!984 = !DILocation(line: 948, column: 7, scope: !982)
!985 = !DILocation(line: 948, column: 21, scope: !982)
!986 = !DILocation(line: 949, column: 3, scope: !982)
!987 = !DILocation(line: 950, column: 11, scope: !982)
!988 = !DILocation(line: 950, column: 3, scope: !982)
!989 = !DILocation(line: 951, column: 3, scope: !982)
!990 = !DILocation(line: 952, column: 3, scope: !982)
!991 = distinct !DISubprogram(name: "add_tab_stop", scope: !66, file: !66, line: 84, type: !992, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !65, retainedNodes: !37)
!992 = !DISubroutineType(types: !993)
!993 = !{null, !168}
!994 = !DILocalVariable(name: "tabval", arg: 1, scope: !991, file: !66, line: 84, type: !168)
!995 = !DILocation(line: 84, column: 21, scope: !991)
!996 = !DILocalVariable(name: "prev_column", scope: !991, file: !66, line: 86, type: !168)
!997 = !DILocation(line: 86, column: 9, scope: !991)
!998 = !DILocation(line: 86, column: 23, scope: !991)
!999 = !DILocation(line: 86, column: 40, scope: !991)
!1000 = !DILocation(line: 86, column: 49, scope: !991)
!1001 = !DILocation(line: 86, column: 64, scope: !991)
!1002 = !DILocalVariable(name: "column_width", scope: !991, file: !66, line: 87, type: !168)
!1003 = !DILocation(line: 87, column: 9, scope: !991)
!1004 = !DILocation(line: 87, column: 24, scope: !991)
!1005 = !DILocation(line: 87, column: 39, scope: !991)
!1006 = !DILocation(line: 87, column: 36, scope: !991)
!1007 = !DILocation(line: 87, column: 48, scope: !991)
!1008 = !DILocation(line: 87, column: 57, scope: !991)
!1009 = !DILocation(line: 87, column: 55, scope: !991)
!1010 = !DILocation(line: 89, column: 7, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !991, file: !66, line: 89, column: 7)
!1012 = !DILocation(line: 89, column: 25, scope: !1011)
!1013 = !DILocation(line: 89, column: 22, scope: !1011)
!1014 = !DILocation(line: 89, column: 7, scope: !991)
!1015 = !DILocation(line: 90, column: 25, scope: !1011)
!1016 = !DILocation(line: 90, column: 16, scope: !1011)
!1017 = !DILocation(line: 90, column: 14, scope: !1011)
!1018 = !DILocation(line: 90, column: 5, scope: !1011)
!1019 = !DILocation(line: 91, column: 32, scope: !991)
!1020 = !DILocation(line: 91, column: 3, scope: !991)
!1021 = !DILocation(line: 91, column: 26, scope: !991)
!1022 = !DILocation(line: 91, column: 30, scope: !991)
!1023 = !DILocation(line: 93, column: 25, scope: !991)
!1024 = !DILocation(line: 93, column: 3, scope: !991)
!1025 = !DILocation(line: 94, column: 1, scope: !991)
!1026 = distinct !DISubprogram(name: "set_max_column_width", scope: !66, file: !66, line: 73, type: !992, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !37)
!1027 = !DILocalVariable(name: "width", arg: 1, scope: !1026, file: !66, line: 73, type: !168)
!1028 = !DILocation(line: 73, column: 29, scope: !1026)
!1029 = !DILocation(line: 75, column: 7, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1026, file: !66, line: 75, column: 7)
!1031 = !DILocation(line: 75, column: 26, scope: !1030)
!1032 = !DILocation(line: 75, column: 24, scope: !1030)
!1033 = !DILocation(line: 75, column: 7, scope: !1026)
!1034 = !DILocation(line: 77, column: 11, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !66, line: 77, column: 11)
!1036 = distinct !DILexicalBlock(scope: !1030, file: !66, line: 76, column: 5)
!1037 = !DILocation(line: 77, column: 11, scope: !1036)
!1038 = !DILocation(line: 78, column: 9, scope: !1035)
!1039 = !DILocation(line: 79, column: 5, scope: !1036)
!1040 = !DILocation(line: 80, column: 1, scope: !1026)
!1041 = distinct !DISubprogram(name: "parse_tab_stops", scope: !66, file: !66, line: 137, type: !670, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !65, retainedNodes: !37)
!1042 = !DILocalVariable(name: "stops", arg: 1, scope: !1041, file: !66, line: 137, type: !35)
!1043 = !DILocation(line: 137, column: 30, scope: !1041)
!1044 = !DILocalVariable(name: "have_tabval", scope: !1041, file: !66, line: 139, type: !27)
!1045 = !DILocation(line: 139, column: 8, scope: !1041)
!1046 = !DILocalVariable(name: "tabval", scope: !1041, file: !66, line: 140, type: !168)
!1047 = !DILocation(line: 140, column: 9, scope: !1041)
!1048 = !DILocalVariable(name: "extend_tabval", scope: !1041, file: !66, line: 141, type: !27)
!1049 = !DILocation(line: 141, column: 8, scope: !1041)
!1050 = !DILocalVariable(name: "increment_tabval", scope: !1041, file: !66, line: 142, type: !27)
!1051 = !DILocation(line: 142, column: 8, scope: !1041)
!1052 = !DILocalVariable(name: "num_start", scope: !1041, file: !66, line: 143, type: !35)
!1053 = !DILocation(line: 143, column: 15, scope: !1041)
!1054 = !DILocalVariable(name: "ok", scope: !1041, file: !66, line: 144, type: !27)
!1055 = !DILocation(line: 144, column: 8, scope: !1041)
!1056 = !DILocation(line: 146, column: 3, scope: !1041)
!1057 = !DILocation(line: 146, column: 11, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !66, line: 146, column: 3)
!1059 = distinct !DILexicalBlock(scope: !1041, file: !66, line: 146, column: 3)
!1060 = !DILocation(line: 146, column: 10, scope: !1058)
!1061 = !DILocation(line: 146, column: 3, scope: !1059)
!1062 = !DILocation(line: 148, column: 12, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !66, line: 148, column: 11)
!1064 = distinct !DILexicalBlock(scope: !1058, file: !66, line: 147, column: 5)
!1065 = !DILocation(line: 148, column: 11, scope: !1063)
!1066 = !DILocation(line: 148, column: 18, scope: !1063)
!1067 = !DILocation(line: 148, column: 25, scope: !1063)
!1068 = !DILocation(line: 148, column: 28, scope: !1063)
!1069 = !DILocation(line: 148, column: 11, scope: !1064)
!1070 = !DILocation(line: 150, column: 15, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !66, line: 150, column: 15)
!1072 = distinct !DILexicalBlock(scope: !1063, file: !66, line: 149, column: 9)
!1073 = !DILocation(line: 150, column: 15, scope: !1072)
!1074 = !DILocation(line: 152, column: 19, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1076, file: !66, line: 152, column: 19)
!1076 = distinct !DILexicalBlock(scope: !1071, file: !66, line: 151, column: 13)
!1077 = !DILocation(line: 152, column: 19, scope: !1076)
!1078 = !DILocation(line: 154, column: 42, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1080, file: !66, line: 154, column: 23)
!1080 = distinct !DILexicalBlock(scope: !1075, file: !66, line: 153, column: 17)
!1081 = !DILocation(line: 154, column: 25, scope: !1079)
!1082 = !DILocation(line: 154, column: 23, scope: !1080)
!1083 = !DILocation(line: 156, column: 26, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1079, file: !66, line: 155, column: 21)
!1085 = !DILocation(line: 157, column: 23, scope: !1084)
!1086 = !DILocation(line: 159, column: 17, scope: !1080)
!1087 = !DILocation(line: 160, column: 24, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1075, file: !66, line: 160, column: 24)
!1089 = !DILocation(line: 160, column: 24, scope: !1075)
!1090 = !DILocation(line: 162, column: 45, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1092, file: !66, line: 162, column: 23)
!1092 = distinct !DILexicalBlock(scope: !1088, file: !66, line: 161, column: 17)
!1093 = !DILocation(line: 162, column: 25, scope: !1091)
!1094 = !DILocation(line: 162, column: 23, scope: !1092)
!1095 = !DILocation(line: 164, column: 26, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1091, file: !66, line: 163, column: 21)
!1097 = !DILocation(line: 165, column: 23, scope: !1096)
!1098 = !DILocation(line: 167, column: 17, scope: !1092)
!1099 = !DILocation(line: 169, column: 31, scope: !1088)
!1100 = !DILocation(line: 169, column: 17, scope: !1088)
!1101 = !DILocation(line: 170, column: 13, scope: !1076)
!1102 = !DILocation(line: 171, column: 23, scope: !1072)
!1103 = !DILocation(line: 172, column: 9, scope: !1072)
!1104 = !DILocation(line: 173, column: 17, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1063, file: !66, line: 173, column: 16)
!1106 = !DILocation(line: 173, column: 16, scope: !1105)
!1107 = !DILocation(line: 173, column: 23, scope: !1105)
!1108 = !DILocation(line: 173, column: 16, scope: !1063)
!1109 = !DILocation(line: 175, column: 15, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1111, file: !66, line: 175, column: 15)
!1111 = distinct !DILexicalBlock(scope: !1105, file: !66, line: 174, column: 9)
!1112 = !DILocation(line: 175, column: 15, scope: !1111)
!1113 = !DILocation(line: 177, column: 15, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1110, file: !66, line: 176, column: 13)
!1115 = !DILocation(line: 179, column: 18, scope: !1114)
!1116 = !DILocation(line: 180, column: 13, scope: !1114)
!1117 = !DILocation(line: 181, column: 25, scope: !1111)
!1118 = !DILocation(line: 182, column: 28, scope: !1111)
!1119 = !DILocation(line: 183, column: 9, scope: !1111)
!1120 = !DILocation(line: 184, column: 17, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1105, file: !66, line: 184, column: 16)
!1122 = !DILocation(line: 184, column: 16, scope: !1121)
!1123 = !DILocation(line: 184, column: 23, scope: !1121)
!1124 = !DILocation(line: 184, column: 16, scope: !1105)
!1125 = !DILocation(line: 186, column: 15, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !66, line: 186, column: 15)
!1127 = distinct !DILexicalBlock(scope: !1121, file: !66, line: 185, column: 9)
!1128 = !DILocation(line: 186, column: 15, scope: !1127)
!1129 = !DILocation(line: 188, column: 15, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1126, file: !66, line: 187, column: 13)
!1131 = !DILocation(line: 190, column: 18, scope: !1130)
!1132 = !DILocation(line: 191, column: 13, scope: !1130)
!1133 = !DILocation(line: 192, column: 28, scope: !1127)
!1134 = !DILocation(line: 193, column: 25, scope: !1127)
!1135 = !DILocation(line: 194, column: 9, scope: !1127)
!1136 = !DILocation(line: 195, column: 28, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1121, file: !66, line: 195, column: 16)
!1138 = !DILocation(line: 195, column: 27, scope: !1137)
!1139 = !DILocation(line: 195, column: 16, scope: !1137)
!1140 = !DILocation(line: 195, column: 16, scope: !1121)
!1141 = !DILocation(line: 197, column: 16, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1143, file: !66, line: 197, column: 15)
!1143 = distinct !DILexicalBlock(scope: !1137, file: !66, line: 196, column: 9)
!1144 = !DILocation(line: 197, column: 15, scope: !1143)
!1145 = !DILocation(line: 199, column: 22, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1142, file: !66, line: 198, column: 13)
!1147 = !DILocation(line: 200, column: 27, scope: !1146)
!1148 = !DILocation(line: 201, column: 27, scope: !1146)
!1149 = !DILocation(line: 201, column: 25, scope: !1146)
!1150 = !DILocation(line: 202, column: 13, scope: !1146)
!1151 = !DILocation(line: 205, column: 16, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1143, file: !66, line: 205, column: 15)
!1153 = !DILocation(line: 205, column: 15, scope: !1143)
!1154 = !DILocalVariable(name: "len", scope: !1155, file: !66, line: 207, type: !160)
!1155 = distinct !DILexicalBlock(scope: !1152, file: !66, line: 206, column: 13)
!1156 = !DILocation(line: 207, column: 21, scope: !1155)
!1157 = !DILocation(line: 207, column: 35, scope: !1155)
!1158 = !DILocation(line: 207, column: 27, scope: !1155)
!1159 = !DILocalVariable(name: "bad_num", scope: !1155, file: !66, line: 208, type: !22)
!1160 = !DILocation(line: 208, column: 21, scope: !1155)
!1161 = !DILocation(line: 208, column: 42, scope: !1155)
!1162 = !DILocation(line: 208, column: 53, scope: !1155)
!1163 = !DILocation(line: 208, column: 31, scope: !1155)
!1164 = !DILocation(line: 209, column: 15, scope: !1155)
!1165 = !DILocation(line: 210, column: 21, scope: !1155)
!1166 = !DILocation(line: 210, column: 15, scope: !1155)
!1167 = !DILocation(line: 211, column: 18, scope: !1155)
!1168 = !DILocation(line: 212, column: 23, scope: !1155)
!1169 = !DILocation(line: 212, column: 35, scope: !1155)
!1170 = !DILocation(line: 212, column: 33, scope: !1155)
!1171 = !DILocation(line: 212, column: 39, scope: !1155)
!1172 = !DILocation(line: 212, column: 21, scope: !1155)
!1173 = !DILocation(line: 213, column: 13, scope: !1155)
!1174 = !DILocation(line: 214, column: 9, scope: !1143)
!1175 = !DILocation(line: 217, column: 11, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1137, file: !66, line: 216, column: 9)
!1177 = !DILocation(line: 219, column: 14, scope: !1176)
!1178 = !DILocation(line: 220, column: 11, scope: !1176)
!1179 = !DILocation(line: 222, column: 5, scope: !1064)
!1180 = !DILocation(line: 146, column: 23, scope: !1058)
!1181 = !DILocation(line: 146, column: 3, scope: !1058)
!1182 = distinct !{!1182, !1061, !1183, !553}
!1183 = !DILocation(line: 222, column: 5, scope: !1059)
!1184 = !DILocation(line: 224, column: 7, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1041, file: !66, line: 224, column: 7)
!1186 = !DILocation(line: 224, column: 10, scope: !1185)
!1187 = !DILocation(line: 224, column: 13, scope: !1185)
!1188 = !DILocation(line: 224, column: 7, scope: !1041)
!1189 = !DILocation(line: 226, column: 11, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1191, file: !66, line: 226, column: 11)
!1191 = distinct !DILexicalBlock(scope: !1185, file: !66, line: 225, column: 5)
!1192 = !DILocation(line: 226, column: 11, scope: !1191)
!1193 = !DILocation(line: 227, column: 32, scope: !1190)
!1194 = !DILocation(line: 227, column: 15, scope: !1190)
!1195 = !DILocation(line: 227, column: 12, scope: !1190)
!1196 = !DILocation(line: 227, column: 9, scope: !1190)
!1197 = !DILocation(line: 228, column: 16, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1190, file: !66, line: 228, column: 16)
!1199 = !DILocation(line: 228, column: 16, scope: !1190)
!1200 = !DILocation(line: 229, column: 35, scope: !1198)
!1201 = !DILocation(line: 229, column: 15, scope: !1198)
!1202 = !DILocation(line: 229, column: 12, scope: !1198)
!1203 = !DILocation(line: 229, column: 9, scope: !1198)
!1204 = !DILocation(line: 231, column: 23, scope: !1198)
!1205 = !DILocation(line: 231, column: 9, scope: !1198)
!1206 = !DILocation(line: 232, column: 5, scope: !1191)
!1207 = !DILocation(line: 234, column: 9, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1041, file: !66, line: 234, column: 7)
!1209 = !DILocation(line: 234, column: 7, scope: !1041)
!1210 = !DILocation(line: 235, column: 5, scope: !1208)
!1211 = !DILocation(line: 236, column: 1, scope: !1041)
!1212 = distinct !DISubprogram(name: "to_uchar", scope: !32, file: !32, line: 153, type: !1213, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !37)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!332, !23}
!1215 = !DILocalVariable(name: "ch", arg: 1, scope: !1212, file: !32, line: 153, type: !23)
!1216 = !DILocation(line: 153, column: 44, scope: !1212)
!1217 = !DILocation(line: 153, column: 57, scope: !1212)
!1218 = !DILocation(line: 153, column: 50, scope: !1212)
!1219 = distinct !DISubprogram(name: "set_extend_size", scope: !66, file: !66, line: 97, type: !1220, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !37)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!27, !168}
!1222 = !DILocalVariable(name: "tabval", arg: 1, scope: !1219, file: !66, line: 97, type: !168)
!1223 = !DILocation(line: 97, column: 24, scope: !1219)
!1224 = !DILocalVariable(name: "ok", scope: !1219, file: !66, line: 99, type: !27)
!1225 = !DILocation(line: 99, column: 8, scope: !1219)
!1226 = !DILocation(line: 101, column: 7, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1219, file: !66, line: 101, column: 7)
!1228 = !DILocation(line: 101, column: 7, scope: !1219)
!1229 = !DILocation(line: 103, column: 7, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1227, file: !66, line: 102, column: 5)
!1231 = !DILocation(line: 106, column: 10, scope: !1230)
!1232 = !DILocation(line: 107, column: 5, scope: !1230)
!1233 = !DILocation(line: 108, column: 17, scope: !1219)
!1234 = !DILocation(line: 108, column: 15, scope: !1219)
!1235 = !DILocation(line: 110, column: 25, scope: !1219)
!1236 = !DILocation(line: 110, column: 3, scope: !1219)
!1237 = !DILocation(line: 112, column: 10, scope: !1219)
!1238 = !DILocation(line: 112, column: 3, scope: !1219)
!1239 = distinct !DISubprogram(name: "set_increment_size", scope: !66, file: !66, line: 116, type: !1220, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !65, retainedNodes: !37)
!1240 = !DILocalVariable(name: "tabval", arg: 1, scope: !1239, file: !66, line: 116, type: !168)
!1241 = !DILocation(line: 116, column: 27, scope: !1239)
!1242 = !DILocalVariable(name: "ok", scope: !1239, file: !66, line: 118, type: !27)
!1243 = !DILocation(line: 118, column: 8, scope: !1239)
