; ModuleID = 'src/unexpand.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.mbbuf_t = type { i8*, %struct._IO_FILE*, i64, i64, i64 }
%struct.mcel_t = type { i32, i8, i8 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [66 x i8] c"Convert blanks in each FILE to tabs, writing to standard output.\0A\00", align 1
@.str.3 = private unnamed_addr constant [9 x i8] c"unexpand\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 62, type: !48, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !30, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/unexpand.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2f40f86ff2e1751a61c8225ac9d0fd19")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256)
!10 = !DIEnumerator(name: "_ISlower", value: 512)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!14 = !DIEnumerator(name: "_ISspace", value: 8192)
!15 = !DIEnumerator(name: "_ISprint", value: 16384)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768)
!17 = !DIEnumerator(name: "_ISblank", value: 1)
!18 = !DIEnumerator(name: "_IScntrl", value: 2)
!19 = !DIEnumerator(name: "_ISpunct", value: 4)
!20 = !DIEnumerator(name: "_ISalnum", value: 8)
!21 = !{!22, !24, !25, !26, !27, !28, !29}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!26 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!27 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!30 = !{!31, !0, !40}
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !33, file: !34, line: 575, type: !28, isLocal: true, isDefinition: true)
!33 = distinct !DISubprogram(name: "oputs_", scope: !34, file: !34, line: 573, type: !35, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !39)
!34 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!35 = !DISubroutineType(types: !36)
!36 = !{null, !37, !37}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!39 = !{}
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "line_in", scope: !42, file: !3, line: 127, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "unexpand", scope: !3, file: !3, line: 114, type: !43, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !39)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2097152, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 262144)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 1536, elements: !58)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !51, line: 50, size: 256, elements: !52)
!51 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!52 = !{!53, !54, !55, !57}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !50, file: !51, line: 52, baseType: !37, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !50, file: !51, line: 55, baseType: !28, size: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !50, file: !51, line: 56, baseType: !56, size: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !50, file: !51, line: 57, baseType: !28, size: 32, offset: 192)
!58 = !{!59}
!59 = !DISubrange(count: 6)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "convert_entire_line", scope: !62, file: !63, line: 30, type: !25, isLocal: false, isDefinition: true)
!62 = distinct !DICompileUnit(language: DW_LANG_C99, file: !63, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, retainedTypes: !88, globals: !89, splitDebugInlining: false, nameTableKind: None)
!63 = !DIFile(filename: "src/expand-common.c", directory: "/src", checksumkind: CSK_MD5, checksum: "942c25878b2cf9f4cd3ad8d127f8f292")
!64 = !{!5, !65, !79}
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !66, line: 42, baseType: !7, size: 32, elements: !67)
!66 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78}
!68 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!69 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!70 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!71 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!72 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!73 = !DIEnumerator(name: "c_quoting_style", value: 5)
!74 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!75 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!76 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!77 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!78 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !80, line: 44, baseType: !7, size: 32, elements: !81)
!80 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!81 = !{!82, !83, !84, !85, !86, !87}
!82 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!83 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!84 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!85 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!86 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!87 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!88 = !{!28, !29, !25, !26, !27, !24}
!89 = !{!60, !90, !92, !153, !158, !160, !168, !170, !172, !174, !176, !178, !183, !186}
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "exit_status", scope: !62, file: !63, line: 69, type: !28, isLocal: false, isDefinition: true)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "prev_file", scope: !94, file: !63, line: 351, type: !22, isLocal: true, isDefinition: true)
!94 = distinct !DISubprogram(name: "next_file", scope: !63, file: !63, line: 349, type: !95, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !62, retainedNodes: !39)
!95 = !DISubroutineType(types: !96)
!96 = !{!97, !97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !99, line: 7, baseType: !100)
!99 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !101, line: 49, size: 1728, elements: !102)
!101 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !118, !120, !121, !122, !125, !126, !128, !132, !135, !137, !140, !143, !144, !145, !148, !149}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !100, file: !101, line: 51, baseType: !28, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !100, file: !101, line: 54, baseType: !22, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !100, file: !101, line: 55, baseType: !22, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !100, file: !101, line: 56, baseType: !22, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !100, file: !101, line: 57, baseType: !22, size: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !100, file: !101, line: 58, baseType: !22, size: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !100, file: !101, line: 59, baseType: !22, size: 64, offset: 384)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !100, file: !101, line: 60, baseType: !22, size: 64, offset: 448)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !100, file: !101, line: 61, baseType: !22, size: 64, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !100, file: !101, line: 64, baseType: !22, size: 64, offset: 576)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !100, file: !101, line: 65, baseType: !22, size: 64, offset: 640)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !100, file: !101, line: 66, baseType: !22, size: 64, offset: 704)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !100, file: !101, line: 68, baseType: !116, size: 64, offset: 768)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !101, line: 36, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !100, file: !101, line: 70, baseType: !119, size: 64, offset: 832)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !100, file: !101, line: 72, baseType: !28, size: 32, offset: 896)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !100, file: !101, line: 73, baseType: !28, size: 32, offset: 928)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !100, file: !101, line: 74, baseType: !123, size: 64, offset: 960)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !124, line: 152, baseType: !26)
!124 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !100, file: !101, line: 77, baseType: !29, size: 16, offset: 1024)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !100, file: !101, line: 78, baseType: !127, size: 8, offset: 1040)
!127 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !100, file: !101, line: 79, baseType: !129, size: 8, offset: 1048)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 1)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !100, file: !101, line: 81, baseType: !133, size: 64, offset: 1088)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !101, line: 43, baseType: null)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !100, file: !101, line: 89, baseType: !136, size: 64, offset: 1152)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !124, line: 153, baseType: !26)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !100, file: !101, line: 91, baseType: !138, size: 64, offset: 1216)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !101, line: 37, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !100, file: !101, line: 92, baseType: !141, size: 64, offset: 1280)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !101, line: 38, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !100, file: !101, line: 93, baseType: !119, size: 64, offset: 1344)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !100, file: !101, line: 94, baseType: !24, size: 64, offset: 1408)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !100, file: !101, line: 95, baseType: !146, size: 64, offset: 1472)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !147, line: 46, baseType: !27)
!147 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !100, file: !101, line: 96, baseType: !28, size: 32, offset: 1536)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !100, file: !101, line: 98, baseType: !150, size: 160, offset: 1568)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 160, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 20)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "max_column_width", scope: !62, file: !63, line: 42, type: !155, isLocal: false, isDefinition: true)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !156, line: 130, baseType: !157)
!156 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !147, line: 35, baseType: !26)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "first_free_tab", scope: !62, file: !63, line: 54, type: !155, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "tab_list", scope: !62, file: !63, line: 47, type: !162, isLocal: true, isDefinition: true)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "colno", file: !164, line: 20, baseType: !165)
!164 = !DIFile(filename: "src/expand-common.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a812a23c6054c0178c7555c3090cc098")
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !166, line: 101, baseType: !167)
!166 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !124, line: 72, baseType: !26)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "n_tabs_allocated", scope: !62, file: !63, line: 50, type: !155, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "extend_size", scope: !62, file: !63, line: 36, type: !163, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "increment_size", scope: !62, file: !63, line: 39, type: !163, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "tab_size", scope: !62, file: !63, line: 33, type: !163, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !62, file: !63, line: 66, type: !25, isLocal: true, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "stdin_argv", scope: !62, file: !63, line: 60, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 2)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "file_list", scope: !62, file: !63, line: 57, type: !185, isLocal: true, isDefinition: true)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !188, file: !34, line: 575, type: !28, isLocal: true, isDefinition: true)
!188 = distinct !DISubprogram(name: "oputs_", scope: !34, file: !34, line: 573, type: !35, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !62, retainedNodes: !39)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "Version", scope: !191, file: !192, line: 3, type: !37, isLocal: false, isDefinition: true)
!191 = distinct !DICompileUnit(language: DW_LANG_C99, file: !192, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !193, splitDebugInlining: false, nameTableKind: None)
!192 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!193 = !{!189}
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "file_name", scope: !196, file: !197, line: 45, type: !37, isLocal: true, isDefinition: true)
!196 = distinct !DICompileUnit(language: DW_LANG_C99, file: !197, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !198, splitDebugInlining: false, nameTableKind: None)
!197 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!198 = !{!194, !199}
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !196, file: !197, line: 55, type: !25, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !203, file: !204, line: 66, type: !232, isLocal: false, isDefinition: true)
!203 = distinct !DICompileUnit(language: DW_LANG_C99, file: !204, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !205, globals: !206, splitDebugInlining: false, nameTableKind: None)
!204 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!205 = !{!24}
!206 = !{!207, !226, !201, !228, !230}
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "old_file_name", scope: !209, file: !204, line: 304, type: !37, isLocal: true, isDefinition: true)
!209 = distinct !DISubprogram(name: "verror_at_line", scope: !204, file: !204, line: 298, type: !210, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !203, retainedNodes: !39)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !28, !28, !37, !7, !37, !212}
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !213, line: 52, baseType: !214)
!213 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !215, line: 32, baseType: !216)
!215 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !217, baseType: !218)
!217 = !DIFile(filename: "lib/error.c", directory: "/src")
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !219, size: 256, elements: !220)
!219 = !DINamespace(name: "std", scope: null)
!220 = !{!221, !222, !223, !224, !225}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !218, file: !217, baseType: !24, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !218, file: !217, baseType: !24, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !218, file: !217, baseType: !24, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !218, file: !217, baseType: !28, size: 32, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !218, file: !217, baseType: !28, size: 32, offset: 224)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "old_line_number", scope: !209, file: !204, line: 305, type: !7, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "error_message_count", scope: !203, file: !204, line: 69, type: !7, isLocal: false, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !203, file: !204, line: 295, type: !28, isLocal: false, isDefinition: true)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "program_name", scope: !235, file: !236, line: 31, type: !37, isLocal: false, isDefinition: true)
!235 = distinct !DICompileUnit(language: DW_LANG_C99, file: !236, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !237, globals: !238, splitDebugInlining: false, nameTableKind: None)
!236 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!237 = !{!22}
!238 = !{!233}
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "utf07FF", scope: !241, file: !242, line: 46, type: !247, isLocal: true, isDefinition: true)
!241 = distinct !DISubprogram(name: "proper_name_lite", scope: !242, file: !242, line: 38, type: !243, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !245, retainedNodes: !39)
!242 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!243 = !DISubroutineType(types: !244)
!244 = !{!37, !37, !37}
!245 = distinct !DICompileUnit(language: DW_LANG_C99, file: !242, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !246, splitDebugInlining: false, nameTableKind: None)
!246 = !{!239}
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 16, elements: !181)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !250, file: !251, line: 76, type: !304, isLocal: false, isDefinition: true)
!250 = distinct !DICompileUnit(language: DW_LANG_C99, file: !251, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !252, retainedTypes: !258, globals: !259, splitDebugInlining: false, nameTableKind: None)
!251 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!252 = !{!65, !253, !5}
!253 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !66, line: 254, baseType: !7, size: 32, elements: !254)
!254 = !{!255, !256, !257}
!255 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!256 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!257 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!258 = !{!28, !29, !146}
!259 = !{!248, !260, !266, !278, !280, !285, !293, !300, !302}
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !250, file: !251, line: 92, type: !262, isLocal: false, isDefinition: true)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 320, elements: !264)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!264 = !{!265}
!265 = !DISubrange(count: 10)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !250, file: !251, line: 1040, type: !268, isLocal: false, isDefinition: true)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !251, line: 56, size: 448, elements: !269)
!269 = !{!270, !271, !272, !276, !277}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !268, file: !251, line: 59, baseType: !65, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !268, file: !251, line: 62, baseType: !28, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !268, file: !251, line: 66, baseType: !273, size: 256, offset: 64)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 8)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !268, file: !251, line: 69, baseType: !37, size: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !268, file: !251, line: 72, baseType: !37, size: 64, offset: 384)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !250, file: !251, line: 107, type: !268, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "slot0", scope: !250, file: !251, line: 831, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2048, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 256)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "quote", scope: !287, file: !251, line: 228, type: !290, isLocal: true, isDefinition: true)
!287 = distinct !DISubprogram(name: "gettext_quote", scope: !251, file: !251, line: 197, type: !288, scopeLine: 198, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !250, retainedNodes: !39)
!288 = !DISubroutineType(types: !289)
!289 = !{!37, !37, !65}
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 64, elements: !291)
!291 = !{!182, !292}
!292 = !DISubrange(count: 4)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "slotvec", scope: !250, file: !251, line: 834, type: !295, isLocal: true, isDefinition: true)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !251, line: 823, size: 128, elements: !297)
!297 = !{!298, !299}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !296, file: !251, line: 825, baseType: !146, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !296, file: !251, line: 826, baseType: !22, size: 64, offset: 64)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "nslots", scope: !250, file: !251, line: 832, type: !28, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "slotvec0", scope: !250, file: !251, line: 833, type: !296, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 704, elements: !306)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!306 = !{!307}
!307 = !DISubrange(count: 11)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !310, file: !311, line: 26, type: !313, isLocal: false, isDefinition: true)
!310 = distinct !DICompileUnit(language: DW_LANG_C99, file: !311, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !312, splitDebugInlining: false, nameTableKind: None)
!311 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!312 = !{!308}
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 376, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 47)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "exit_failure", scope: !318, file: !319, line: 24, type: !321, isLocal: false, isDefinition: true)
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !320, splitDebugInlining: false, nameTableKind: None)
!319 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!320 = !{!316}
!321 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !28)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "internal_state", scope: !324, file: !325, line: 97, type: !329, isLocal: true, isDefinition: true)
!324 = distinct !DICompileUnit(language: DW_LANG_C99, file: !325, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !326, globals: !328, splitDebugInlining: false, nameTableKind: None)
!325 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!326 = !{!24, !146, !327}
!327 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!328 = !{!322}
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !330, line: 6, baseType: !331)
!330 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !332, line: 21, baseType: !333)
!332 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !332, line: 13, size: 64, elements: !334)
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !333, file: !332, line: 15, baseType: !28, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !333, file: !332, line: 20, baseType: !337, size: 32, offset: 32)
!337 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !333, file: !332, line: 16, size: 32, elements: !338)
!338 = !{!339, !340}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !337, file: !332, line: 18, baseType: !7, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !337, file: !332, line: 19, baseType: !341, size: 32)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 32, elements: !342)
!342 = !{!292}
!343 = distinct !DICompileUnit(language: DW_LANG_C99, file: !344, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!344 = !DIFile(filename: "lib/c-ctype.c", directory: "/src", checksumkind: CSK_MD5, checksum: "245df19f202f37bba31cfa46647ceb93")
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!346 = !DIFile(filename: "lib/c32isblank.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fdc50bdf98dbcb7b574dd3202ecd546c")
!347 = distinct !DICompileUnit(language: DW_LANG_C99, file: !348, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!348 = !DIFile(filename: "lib/c32width.c", directory: "/src", checksumkind: CSK_MD5, checksum: "85b2c5ee6f572eb09c0f075561e000ef")
!349 = distinct !DICompileUnit(language: DW_LANG_C99, file: !350, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !351, splitDebugInlining: false, nameTableKind: None)
!350 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!351 = !{!79}
!352 = distinct !DICompileUnit(language: DW_LANG_C99, file: !353, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!353 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!354 = distinct !DICompileUnit(language: DW_LANG_C99, file: !355, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !205, splitDebugInlining: false, nameTableKind: None)
!355 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!357 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!358 = distinct !DICompileUnit(language: DW_LANG_C99, file: !359, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !205, splitDebugInlining: false, nameTableKind: None)
!359 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!360 = distinct !DICompileUnit(language: DW_LANG_C99, file: !361, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!361 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!362 = distinct !DICompileUnit(language: DW_LANG_C99, file: !363, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !364, retainedTypes: !369, splitDebugInlining: false, nameTableKind: None)
!363 = !DIFile(filename: "lib/mbbuf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b7bac851fa0e451a46f67e401f301ae1")
!364 = !{!365}
!365 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !366, line: 127, baseType: !7, size: 32, elements: !367)
!366 = !DIFile(filename: "./lib/mcel.h", directory: "/src", checksumkind: CSK_MD5, checksum: "1a3948cda8366fd81b1605726e5920d0")
!367 = !{!368}
!368 = !DIEnumerator(name: "MCEL_LEN_MAX", value: 4)
!369 = !{!327}
!370 = distinct !DICompileUnit(language: DW_LANG_C99, file: !371, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !372, retainedTypes: !382, splitDebugInlining: false, nameTableKind: None)
!371 = !DIFile(filename: "lib/mcel.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4bc577b690b70e5442e17a02996a7034")
!372 = !{!365, !373, !376, !379}
!373 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !366, line: 130, baseType: !7, size: 32, elements: !374)
!374 = !{!375}
!375 = !DIEnumerator(name: "MCEL_CHAR_MAX", value: 1114111)
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !366, line: 131, baseType: !7, size: 32, elements: !377)
!377 = !{!378}
!378 = !DIEnumerator(name: "MCEL_ERR_MIN", value: 128)
!379 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !366, line: 150, baseType: !7, size: 32, elements: !380)
!380 = !{!381}
!381 = !DIEnumerator(name: "MCEL_ERR_SHIFT", value: 14)
!382 = !{!146}
!383 = distinct !DICompileUnit(language: DW_LANG_C99, file: !384, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!384 = !DIFile(filename: "lib/streq.c", directory: "/src", checksumkind: CSK_MD5, checksum: "912b0bbb2168195104931254916871aa")
!385 = distinct !DICompileUnit(language: DW_LANG_C99, file: !386, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !387, retainedTypes: !205, splitDebugInlining: false, nameTableKind: None)
!386 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!387 = !{!388}
!388 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !386, line: 40, baseType: !7, size: 32, elements: !389)
!389 = !{!390}
!390 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!391 = distinct !DICompileUnit(language: DW_LANG_C99, file: !392, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !393, retainedTypes: !406, splitDebugInlining: false, nameTableKind: None)
!392 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!393 = !{!394, !401}
!394 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !395, file: !392, line: 188, baseType: !7, size: 32, elements: !399)
!395 = distinct !DISubprogram(name: "x2nrealloc", scope: !392, file: !392, line: 176, type: !396, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !391, retainedNodes: !39)
!396 = !DISubroutineType(types: !397)
!397 = !{!24, !24, !398, !146}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!399 = !{!400}
!400 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!401 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !402, file: !392, line: 228, baseType: !7, size: 32, elements: !399)
!402 = distinct !DISubprogram(name: "xpalloc", scope: !392, file: !392, line: 223, type: !403, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !391, retainedNodes: !39)
!403 = !DISubroutineType(types: !404)
!404 = !{!24, !24, !405, !155, !157, !155}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!406 = !{!22, !24, !25, !26, !27}
!407 = distinct !DICompileUnit(language: DW_LANG_C99, file: !408, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!408 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !410, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !205, splitDebugInlining: false, nameTableKind: None)
!410 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !412, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!412 = !DIFile(filename: "lib/c32isprint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aac58442c7952a27a6ecb1773b2ef569")
!413 = distinct !DICompileUnit(language: DW_LANG_C99, file: !414, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!414 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!415 = distinct !DICompileUnit(language: DW_LANG_C99, file: !416, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !205, splitDebugInlining: false, nameTableKind: None)
!416 = !DIFile(filename: "lib/ialloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e1d85861a0099c22cc583b5eb5f30423")
!417 = distinct !DICompileUnit(language: DW_LANG_C99, file: !418, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!418 = !DIFile(filename: "lib/mbszero.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1b51b91fccd359a867925f7b0fc988a4")
!419 = distinct !DICompileUnit(language: DW_LANG_C99, file: !420, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!420 = !DIFile(filename: "lib/memeq.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9bf299a5d27acbe732c4d2f0d9a2144a")
!421 = distinct !DICompileUnit(language: DW_LANG_C99, file: !422, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!422 = !DIFile(filename: "lib/realloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a76cd3b708f695a3bf546d626aa758d")
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !424, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !425, splitDebugInlining: false, nameTableKind: None)
!424 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!425 = !{!25, !27, !24}
!426 = distinct !DICompileUnit(language: DW_LANG_C99, file: !427, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!427 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!428 = distinct !DICompileUnit(language: DW_LANG_C99, file: !429, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!429 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!430 = distinct !DICompileUnit(language: DW_LANG_C99, file: !431, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !205, splitDebugInlining: false, nameTableKind: None)
!431 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!432 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!433 = !{i32 7, !"Dwarf Version", i32 5}
!434 = !{i32 2, !"Debug Info Version", i32 3}
!435 = !{i32 1, !"wchar_size", i32 4}
!436 = !{i32 1, !"branch-target-enforcement", i32 0}
!437 = !{i32 1, !"sign-return-address", i32 0}
!438 = !{i32 1, !"sign-return-address-all", i32 0}
!439 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!440 = !{i32 7, !"PIC Level", i32 2}
!441 = !{i32 7, !"PIE Level", i32 2}
!442 = !{i32 7, !"uwtable", i32 1}
!443 = !{i32 7, !"frame-pointer", i32 1}
!444 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 73, type: !445, scopeLine: 74, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !39)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !28}
!447 = !DILocalVariable(name: "status", arg: 1, scope: !444, file: !3, line: 73, type: !28)
!448 = !DILocation(line: 73, column: 12, scope: !444)
!449 = !DILocation(line: 75, column: 7, scope: !450)
!450 = distinct !DILexicalBlock(scope: !444, file: !3, line: 75, column: 7)
!451 = !DILocation(line: 75, column: 14, scope: !450)
!452 = !DILocation(line: 75, column: 7, scope: !444)
!453 = !DILocation(line: 76, column: 5, scope: !450)
!454 = !DILocation(line: 76, column: 5, scope: !455)
!455 = distinct !DILexicalBlock(scope: !450, file: !3, line: 76, column: 5)
!456 = !DILocation(line: 79, column: 15, scope: !457)
!457 = distinct !DILexicalBlock(scope: !450, file: !3, line: 78, column: 5)
!458 = !DILocation(line: 82, column: 15, scope: !457)
!459 = !DILocation(line: 79, column: 7, scope: !457)
!460 = !DILocation(line: 83, column: 7, scope: !457)
!461 = !DILocation(line: 87, column: 7, scope: !457)
!462 = !DILocation(line: 88, column: 7, scope: !457)
!463 = !DILocation(line: 90, column: 7, scope: !457)
!464 = !DILocation(line: 94, column: 7, scope: !457)
!465 = !DILocation(line: 98, column: 7, scope: !457)
!466 = !DILocation(line: 102, column: 7, scope: !457)
!467 = !DILocation(line: 103, column: 7, scope: !457)
!468 = !DILocation(line: 104, column: 7, scope: !457)
!469 = !DILocation(line: 105, column: 7, scope: !457)
!470 = !DILocation(line: 107, column: 9, scope: !444)
!471 = !DILocation(line: 107, column: 3, scope: !444)
!472 = distinct !DISubprogram(name: "emit_stdin_note", scope: !34, file: !34, line: 727, type: !43, scopeLine: 728, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !39)
!473 = !DILocation(line: 729, column: 3, scope: !472)
!474 = !DILocation(line: 732, column: 1, scope: !472)
!475 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !34, file: !34, line: 734, type: !43, scopeLine: 735, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !39)
!476 = !DILocation(line: 736, column: 3, scope: !475)
!477 = !DILocation(line: 739, column: 1, scope: !475)
!478 = !DILocalVariable(name: "program", arg: 1, scope: !33, file: !34, line: 573, type: !37)
!479 = !DILocation(line: 573, column: 34, scope: !33)
!480 = !DILocalVariable(name: "option", arg: 2, scope: !33, file: !34, line: 573, type: !37)
!481 = !DILocation(line: 573, column: 55, scope: !33)
!482 = !DILocation(line: 581, column: 7, scope: !483)
!483 = distinct !DILexicalBlock(scope: !33, file: !34, line: 581, column: 7)
!484 = !DILocation(line: 581, column: 19, scope: !483)
!485 = !DILocation(line: 581, column: 7, scope: !33)
!486 = !DILocalVariable(name: "term", scope: !487, file: !34, line: 585, type: !37)
!487 = distinct !DILexicalBlock(scope: !483, file: !34, line: 582, column: 5)
!488 = !DILocation(line: 585, column: 19, scope: !487)
!489 = !DILocation(line: 585, column: 26, scope: !487)
!490 = !DILocation(line: 586, column: 23, scope: !487)
!491 = !DILocation(line: 586, column: 28, scope: !487)
!492 = !DILocation(line: 586, column: 33, scope: !487)
!493 = !DILocation(line: 586, column: 32, scope: !487)
!494 = !DILocation(line: 586, column: 38, scope: !487)
!495 = !DILocation(line: 586, column: 48, scope: !487)
!496 = !DILocation(line: 586, column: 41, scope: !487)
!497 = !DILocation(line: 586, column: 19, scope: !487)
!498 = !DILocation(line: 587, column: 5, scope: !487)
!499 = !DILocation(line: 588, column: 7, scope: !500)
!500 = distinct !DILexicalBlock(scope: !33, file: !34, line: 588, column: 7)
!501 = !DILocation(line: 588, column: 7, scope: !33)
!502 = !DILocation(line: 590, column: 7, scope: !503)
!503 = distinct !DILexicalBlock(scope: !500, file: !34, line: 589, column: 5)
!504 = !DILocation(line: 591, column: 7, scope: !503)
!505 = !DILocalVariable(name: "double_space", scope: !33, file: !34, line: 594, type: !25)
!506 = !DILocation(line: 594, column: 8, scope: !33)
!507 = !DILocalVariable(name: "first_word", scope: !33, file: !34, line: 595, type: !37)
!508 = !DILocation(line: 595, column: 15, scope: !33)
!509 = !DILocation(line: 595, column: 28, scope: !33)
!510 = !DILocation(line: 595, column: 45, scope: !33)
!511 = !DILocation(line: 595, column: 37, scope: !33)
!512 = !DILocation(line: 595, column: 35, scope: !33)
!513 = !DILocalVariable(name: "option_text", scope: !33, file: !34, line: 596, type: !37)
!514 = !DILocation(line: 596, column: 15, scope: !33)
!515 = !DILocation(line: 596, column: 37, scope: !33)
!516 = !DILocation(line: 596, column: 29, scope: !33)
!517 = !DILocation(line: 597, column: 8, scope: !518)
!518 = distinct !DILexicalBlock(scope: !33, file: !34, line: 597, column: 7)
!519 = !DILocation(line: 597, column: 7, scope: !33)
!520 = !DILocation(line: 599, column: 21, scope: !521)
!521 = distinct !DILexicalBlock(scope: !518, file: !34, line: 598, column: 5)
!522 = !DILocation(line: 599, column: 19, scope: !521)
!523 = !DILocation(line: 602, column: 20, scope: !521)
!524 = !DILocation(line: 603, column: 5, scope: !521)
!525 = !DILocation(line: 604, column: 12, scope: !526)
!526 = distinct !DILexicalBlock(scope: !518, file: !34, line: 604, column: 12)
!527 = !DILocation(line: 604, column: 27, scope: !526)
!528 = !DILocation(line: 604, column: 24, scope: !526)
!529 = !DILocation(line: 604, column: 12, scope: !518)
!530 = !DILocalVariable(name: "s", scope: !531, file: !34, line: 608, type: !37)
!531 = distinct !DILexicalBlock(scope: !526, file: !34, line: 605, column: 5)
!532 = !DILocation(line: 608, column: 19, scope: !531)
!533 = !DILocation(line: 608, column: 23, scope: !531)
!534 = !DILocalVariable(name: "spaces", scope: !531, file: !34, line: 609, type: !146)
!535 = !DILocation(line: 609, column: 14, scope: !531)
!536 = !DILocation(line: 610, column: 7, scope: !531)
!537 = !DILocation(line: 610, column: 14, scope: !531)
!538 = !DILocation(line: 610, column: 18, scope: !531)
!539 = !DILocation(line: 610, column: 16, scope: !531)
!540 = !DILocation(line: 610, column: 30, scope: !531)
!541 = !DILocation(line: 610, column: 33, scope: !531)
!542 = !DILocation(line: 610, column: 40, scope: !531)
!543 = !DILocation(line: 0, scope: !531)
!544 = !DILocation(line: 611, column: 21, scope: !531)
!545 = !DILocation(line: 611, column: 20, scope: !531)
!546 = !DILocation(line: 611, column: 19, scope: !531)
!547 = !DILocation(line: 611, column: 16, scope: !531)
!548 = distinct !{!548, !536, !544, !549}
!549 = !{!"llvm.loop.mustprogress"}
!550 = !DILocation(line: 612, column: 11, scope: !551)
!551 = distinct !DILexicalBlock(scope: !531, file: !34, line: 612, column: 11)
!552 = !DILocation(line: 612, column: 18, scope: !551)
!553 = !DILocation(line: 612, column: 11, scope: !531)
!554 = !DILocation(line: 615, column: 25, scope: !555)
!555 = distinct !DILexicalBlock(scope: !551, file: !34, line: 613, column: 9)
!556 = !DILocation(line: 615, column: 23, scope: !555)
!557 = !DILocation(line: 616, column: 24, scope: !555)
!558 = !DILocation(line: 617, column: 9, scope: !555)
!559 = !DILocation(line: 618, column: 5, scope: !531)
!560 = !DILocalVariable(name: "anchor_len", scope: !33, file: !34, line: 620, type: !146)
!561 = !DILocation(line: 620, column: 10, scope: !33)
!562 = !DILocation(line: 620, column: 32, scope: !33)
!563 = !DILocation(line: 620, column: 23, scope: !33)
!564 = !DILocalVariable(name: "desc_text", scope: !33, file: !34, line: 625, type: !37)
!565 = !DILocation(line: 625, column: 15, scope: !33)
!566 = !DILocation(line: 625, column: 27, scope: !33)
!567 = !DILocation(line: 625, column: 41, scope: !33)
!568 = !DILocation(line: 625, column: 39, scope: !33)
!569 = !DILocation(line: 626, column: 3, scope: !33)
!570 = !DILocation(line: 626, column: 11, scope: !33)
!571 = !DILocation(line: 626, column: 10, scope: !33)
!572 = !DILocation(line: 626, column: 21, scope: !33)
!573 = !DILocation(line: 626, column: 25, scope: !33)
!574 = !DILocation(line: 626, column: 24, scope: !33)
!575 = !DILocation(line: 626, column: 35, scope: !33)
!576 = !DILocation(line: 0, scope: !33)
!577 = !DILocation(line: 628, column: 12, scope: !578)
!578 = distinct !DILexicalBlock(scope: !579, file: !34, line: 628, column: 11)
!579 = distinct !DILexicalBlock(scope: !33, file: !34, line: 627, column: 5)
!580 = !DILocation(line: 628, column: 11, scope: !578)
!581 = !DILocation(line: 628, column: 22, scope: !578)
!582 = !DILocation(line: 628, column: 29, scope: !578)
!583 = !DILocation(line: 628, column: 34, scope: !578)
!584 = !DILocation(line: 628, column: 44, scope: !578)
!585 = !DILocation(line: 628, column: 32, scope: !578)
!586 = !DILocation(line: 628, column: 49, scope: !578)
!587 = !DILocation(line: 628, column: 11, scope: !579)
!588 = !DILocation(line: 629, column: 22, scope: !578)
!589 = !DILocation(line: 629, column: 9, scope: !578)
!590 = !DILocation(line: 630, column: 11, scope: !591)
!591 = distinct !DILexicalBlock(scope: !579, file: !34, line: 630, column: 11)
!592 = !DILocation(line: 630, column: 11, scope: !579)
!593 = !DILocation(line: 632, column: 16, scope: !594)
!594 = distinct !DILexicalBlock(scope: !595, file: !34, line: 632, column: 15)
!595 = distinct !DILexicalBlock(scope: !591, file: !34, line: 631, column: 9)
!596 = !DILocation(line: 632, column: 15, scope: !594)
!597 = !DILocation(line: 632, column: 26, scope: !594)
!598 = !DILocation(line: 632, column: 34, scope: !594)
!599 = !DILocation(line: 632, column: 37, scope: !594)
!600 = !DILocation(line: 632, column: 15, scope: !595)
!601 = !DILocation(line: 633, column: 13, scope: !594)
!602 = !DILocation(line: 636, column: 16, scope: !603)
!603 = distinct !DILexicalBlock(scope: !595, file: !34, line: 636, column: 15)
!604 = !DILocation(line: 636, column: 29, scope: !603)
!605 = !DILocation(line: 636, column: 34, scope: !603)
!606 = !DILocation(line: 636, column: 44, scope: !603)
!607 = !DILocation(line: 636, column: 32, scope: !603)
!608 = !DILocation(line: 636, column: 49, scope: !603)
!609 = !DILocation(line: 636, column: 15, scope: !595)
!610 = !DILocation(line: 637, column: 13, scope: !603)
!611 = !DILocation(line: 638, column: 9, scope: !595)
!612 = !DILocation(line: 640, column: 16, scope: !579)
!613 = distinct !{!613, !569, !614, !549}
!614 = !DILocation(line: 641, column: 5, scope: !33)
!615 = !DILocation(line: 644, column: 3, scope: !33)
!616 = !DILocalVariable(name: "url_program", scope: !33, file: !34, line: 648, type: !37)
!617 = !DILocation(line: 648, column: 15, scope: !33)
!618 = !DILocation(line: 648, column: 38, scope: !33)
!619 = !DILocation(line: 648, column: 31, scope: !33)
!620 = !DILocation(line: 649, column: 38, scope: !33)
!621 = !DILocation(line: 649, column: 31, scope: !33)
!622 = !DILocation(line: 650, column: 38, scope: !33)
!623 = !DILocation(line: 650, column: 31, scope: !33)
!624 = !DILocation(line: 651, column: 38, scope: !33)
!625 = !DILocation(line: 651, column: 31, scope: !33)
!626 = !DILocation(line: 652, column: 38, scope: !33)
!627 = !DILocation(line: 652, column: 31, scope: !33)
!628 = !DILocation(line: 653, column: 38, scope: !33)
!629 = !DILocation(line: 653, column: 31, scope: !33)
!630 = !DILocation(line: 654, column: 38, scope: !33)
!631 = !DILocation(line: 654, column: 31, scope: !33)
!632 = !DILocation(line: 655, column: 38, scope: !33)
!633 = !DILocation(line: 655, column: 31, scope: !33)
!634 = !DILocation(line: 656, column: 38, scope: !33)
!635 = !DILocation(line: 656, column: 31, scope: !33)
!636 = !DILocation(line: 657, column: 38, scope: !33)
!637 = !DILocation(line: 657, column: 31, scope: !33)
!638 = !DILocation(line: 658, column: 31, scope: !33)
!639 = !DILocation(line: 663, column: 7, scope: !640)
!640 = distinct !DILexicalBlock(scope: !33, file: !34, line: 663, column: 7)
!641 = !DILocation(line: 664, column: 7, scope: !640)
!642 = !DILocation(line: 664, column: 10, scope: !640)
!643 = !DILocation(line: 663, column: 7, scope: !33)
!644 = !DILocation(line: 670, column: 15, scope: !645)
!645 = distinct !DILexicalBlock(scope: !640, file: !34, line: 665, column: 5)
!646 = !DILocation(line: 670, column: 28, scope: !645)
!647 = !DILocation(line: 670, column: 47, scope: !645)
!648 = !DILocation(line: 670, column: 41, scope: !645)
!649 = !DILocation(line: 670, column: 59, scope: !645)
!650 = !DILocation(line: 669, column: 7, scope: !645)
!651 = !DILocation(line: 671, column: 5, scope: !645)
!652 = !DILocation(line: 676, column: 48, scope: !653)
!653 = distinct !DILexicalBlock(scope: !640, file: !34, line: 673, column: 5)
!654 = !DILocation(line: 677, column: 21, scope: !653)
!655 = !DILocation(line: 677, column: 15, scope: !653)
!656 = !DILocation(line: 677, column: 33, scope: !653)
!657 = !DILocation(line: 676, column: 7, scope: !653)
!658 = !DILocation(line: 679, column: 3, scope: !33)
!659 = !DILocation(line: 683, column: 3, scope: !33)
!660 = !DILocation(line: 686, column: 3, scope: !33)
!661 = !DILocation(line: 688, column: 3, scope: !33)
!662 = !DILocation(line: 691, column: 3, scope: !33)
!663 = !DILocation(line: 695, column: 3, scope: !33)
!664 = !DILocation(line: 696, column: 1, scope: !33)
!665 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !34, file: !34, line: 836, type: !666, scopeLine: 837, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !39)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !37}
!668 = !DILocalVariable(name: "program", arg: 1, scope: !665, file: !34, line: 836, type: !37)
!669 = !DILocation(line: 836, column: 34, scope: !665)
!670 = !DILocalVariable(name: "infomap", scope: !665, file: !34, line: 838, type: !671)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 896, elements: !677)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !665, file: !34, line: 838, size: 128, elements: !674)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !673, file: !34, line: 838, baseType: !37, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !673, file: !34, line: 838, baseType: !37, size: 64, offset: 64)
!677 = !{!678}
!678 = !DISubrange(count: 7)
!679 = !DILocation(line: 838, column: 67, scope: !665)
!680 = !DILocalVariable(name: "node", scope: !665, file: !34, line: 848, type: !37)
!681 = !DILocation(line: 848, column: 15, scope: !665)
!682 = !DILocation(line: 848, column: 22, scope: !665)
!683 = !DILocalVariable(name: "map_prog", scope: !665, file: !34, line: 849, type: !684)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!685 = !DILocation(line: 849, column: 25, scope: !665)
!686 = !DILocation(line: 849, column: 36, scope: !665)
!687 = !DILocation(line: 851, column: 3, scope: !665)
!688 = !DILocation(line: 851, column: 10, scope: !665)
!689 = !DILocation(line: 851, column: 20, scope: !665)
!690 = !DILocation(line: 851, column: 28, scope: !665)
!691 = !DILocation(line: 851, column: 40, scope: !665)
!692 = !DILocation(line: 851, column: 49, scope: !665)
!693 = !DILocation(line: 851, column: 59, scope: !665)
!694 = !DILocation(line: 851, column: 33, scope: !665)
!695 = !DILocation(line: 851, column: 31, scope: !665)
!696 = !DILocation(line: 0, scope: !665)
!697 = !DILocation(line: 852, column: 13, scope: !665)
!698 = distinct !{!698, !687, !697, !549}
!699 = !DILocation(line: 854, column: 7, scope: !700)
!700 = distinct !DILexicalBlock(scope: !665, file: !34, line: 854, column: 7)
!701 = !DILocation(line: 854, column: 17, scope: !700)
!702 = !DILocation(line: 854, column: 7, scope: !665)
!703 = !DILocation(line: 855, column: 12, scope: !700)
!704 = !DILocation(line: 855, column: 22, scope: !700)
!705 = !DILocation(line: 855, column: 10, scope: !700)
!706 = !DILocation(line: 855, column: 5, scope: !700)
!707 = !DILocation(line: 857, column: 3, scope: !665)
!708 = !DILocalVariable(name: "lc_messages", scope: !665, file: !34, line: 861, type: !37)
!709 = !DILocation(line: 861, column: 15, scope: !665)
!710 = !DILocation(line: 861, column: 29, scope: !665)
!711 = !DILocation(line: 862, column: 7, scope: !712)
!712 = distinct !DILexicalBlock(scope: !665, file: !34, line: 862, column: 7)
!713 = !DILocation(line: 862, column: 19, scope: !712)
!714 = !DILocation(line: 862, column: 22, scope: !712)
!715 = !DILocation(line: 862, column: 7, scope: !665)
!716 = !DILocation(line: 868, column: 7, scope: !717)
!717 = distinct !DILexicalBlock(scope: !712, file: !34, line: 863, column: 5)
!718 = !DILocation(line: 870, column: 5, scope: !717)
!719 = !DILocalVariable(name: "url_program", scope: !665, file: !34, line: 874, type: !37)
!720 = !DILocation(line: 874, column: 15, scope: !665)
!721 = !DILocation(line: 874, column: 36, scope: !665)
!722 = !DILocation(line: 874, column: 29, scope: !665)
!723 = !DILocation(line: 874, column: 61, scope: !665)
!724 = !DILocation(line: 875, column: 11, scope: !665)
!725 = !DILocation(line: 876, column: 24, scope: !665)
!726 = !DILocation(line: 875, column: 3, scope: !665)
!727 = !DILocation(line: 877, column: 11, scope: !665)
!728 = !DILocation(line: 878, column: 11, scope: !665)
!729 = !DILocation(line: 878, column: 17, scope: !665)
!730 = !DILocation(line: 878, column: 25, scope: !665)
!731 = !DILocation(line: 878, column: 22, scope: !665)
!732 = !DILocation(line: 877, column: 3, scope: !665)
!733 = !DILocation(line: 879, column: 1, scope: !665)
!734 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 273, type: !735, scopeLine: 274, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !39)
!735 = !DISubroutineType(types: !736)
!736 = !{!28, !28, !185}
!737 = !DILocalVariable(name: "argc", arg: 1, scope: !734, file: !3, line: 273, type: !28)
!738 = !DILocation(line: 273, column: 11, scope: !734)
!739 = !DILocalVariable(name: "argv", arg: 2, scope: !734, file: !3, line: 273, type: !185)
!740 = !DILocation(line: 273, column: 24, scope: !734)
!741 = !DILocalVariable(name: "have_tabval", scope: !734, file: !3, line: 275, type: !25)
!742 = !DILocation(line: 275, column: 8, scope: !734)
!743 = !DILocalVariable(name: "tabval", scope: !734, file: !3, line: 276, type: !163)
!744 = !DILocation(line: 276, column: 9, scope: !734)
!745 = !DILocalVariable(name: "c", scope: !734, file: !3, line: 277, type: !28)
!746 = !DILocation(line: 277, column: 7, scope: !734)
!747 = !DILocalVariable(name: "convert_first_only", scope: !734, file: !3, line: 281, type: !25)
!748 = !DILocation(line: 281, column: 8, scope: !734)
!749 = !DILocation(line: 284, column: 21, scope: !734)
!750 = !DILocation(line: 284, column: 3, scope: !734)
!751 = !DILocation(line: 285, column: 3, scope: !734)
!752 = !DILocation(line: 286, column: 3, scope: !734)
!753 = !DILocation(line: 287, column: 3, scope: !734)
!754 = !DILocation(line: 289, column: 3, scope: !734)
!755 = !DILocation(line: 291, column: 3, scope: !734)
!756 = !DILocation(line: 291, column: 28, scope: !734)
!757 = !DILocation(line: 291, column: 34, scope: !734)
!758 = !DILocation(line: 291, column: 15, scope: !734)
!759 = !DILocation(line: 291, column: 13, scope: !734)
!760 = !DILocation(line: 292, column: 10, scope: !734)
!761 = !DILocation(line: 294, column: 15, scope: !762)
!762 = distinct !DILexicalBlock(scope: !734, file: !3, line: 293, column: 5)
!763 = !DILocation(line: 294, column: 7, scope: !762)
!764 = !DILocation(line: 297, column: 11, scope: !765)
!765 = distinct !DILexicalBlock(scope: !762, file: !3, line: 295, column: 9)
!766 = !DILocation(line: 299, column: 31, scope: !765)
!767 = !DILocation(line: 300, column: 11, scope: !765)
!768 = !DILocation(line: 302, column: 31, scope: !765)
!769 = !DILocation(line: 303, column: 28, scope: !765)
!770 = !DILocation(line: 303, column: 11, scope: !765)
!771 = !DILocation(line: 304, column: 11, scope: !765)
!772 = !DILocation(line: 306, column: 30, scope: !765)
!773 = !DILocation(line: 307, column: 11, scope: !765)
!774 = !DILocation(line: 309, column: 15, scope: !775)
!775 = distinct !DILexicalBlock(scope: !765, file: !3, line: 309, column: 15)
!776 = !DILocation(line: 309, column: 15, scope: !765)
!777 = !DILocation(line: 310, column: 27, scope: !775)
!778 = !DILocation(line: 310, column: 13, scope: !775)
!779 = !DILocation(line: 311, column: 23, scope: !765)
!780 = !DILocation(line: 312, column: 11, scope: !765)
!781 = !DILocation(line: 313, column: 9, scope: !765)
!782 = !DILocation(line: 314, column: 9, scope: !765)
!783 = !DILocation(line: 316, column: 16, scope: !784)
!784 = distinct !DILexicalBlock(scope: !765, file: !3, line: 316, column: 15)
!785 = !DILocation(line: 316, column: 15, scope: !765)
!786 = !DILocation(line: 318, column: 22, scope: !787)
!787 = distinct !DILexicalBlock(scope: !784, file: !3, line: 317, column: 13)
!788 = !DILocation(line: 319, column: 27, scope: !787)
!789 = !DILocation(line: 320, column: 13, scope: !787)
!790 = !DILocation(line: 321, column: 16, scope: !791)
!791 = distinct !DILexicalBlock(scope: !765, file: !3, line: 321, column: 15)
!792 = !DILocation(line: 321, column: 15, scope: !765)
!793 = !DILocation(line: 322, column: 13, scope: !791)
!794 = !DILocation(line: 323, column: 11, scope: !765)
!795 = distinct !{!795, !755, !796, !549}
!796 = !DILocation(line: 325, column: 5, scope: !734)
!797 = !DILocation(line: 327, column: 7, scope: !798)
!798 = distinct !DILexicalBlock(scope: !734, file: !3, line: 327, column: 7)
!799 = !DILocation(line: 327, column: 7, scope: !734)
!800 = !DILocation(line: 328, column: 25, scope: !798)
!801 = !DILocation(line: 328, column: 5, scope: !798)
!802 = !DILocation(line: 330, column: 7, scope: !803)
!803 = distinct !DILexicalBlock(scope: !734, file: !3, line: 330, column: 7)
!804 = !DILocation(line: 330, column: 7, scope: !734)
!805 = !DILocation(line: 331, column: 19, scope: !803)
!806 = !DILocation(line: 331, column: 5, scope: !803)
!807 = !DILocation(line: 333, column: 3, scope: !734)
!808 = !DILocation(line: 335, column: 19, scope: !734)
!809 = !DILocation(line: 335, column: 28, scope: !734)
!810 = !DILocation(line: 335, column: 26, scope: !734)
!811 = !DILocation(line: 335, column: 18, scope: !734)
!812 = !DILocation(line: 335, column: 37, scope: !734)
!813 = !DILocation(line: 335, column: 42, scope: !734)
!814 = !DILocation(line: 335, column: 3, scope: !734)
!815 = !DILocation(line: 337, column: 3, scope: !734)
!816 = !DILocation(line: 339, column: 3, scope: !734)
!817 = !DILocation(line: 341, column: 10, scope: !734)
!818 = !DILocation(line: 341, column: 3, scope: !734)
!819 = !DILocalVariable(name: "fp", scope: !42, file: !3, line: 117, type: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !99, line: 7, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !101, line: 49, size: 1728, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !822, file: !101, line: 51, baseType: !28, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !822, file: !101, line: 54, baseType: !22, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !822, file: !101, line: 55, baseType: !22, size: 64, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !822, file: !101, line: 56, baseType: !22, size: 64, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !822, file: !101, line: 57, baseType: !22, size: 64, offset: 256)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !822, file: !101, line: 58, baseType: !22, size: 64, offset: 320)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !822, file: !101, line: 59, baseType: !22, size: 64, offset: 384)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !822, file: !101, line: 60, baseType: !22, size: 64, offset: 448)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !822, file: !101, line: 61, baseType: !22, size: 64, offset: 512)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !822, file: !101, line: 64, baseType: !22, size: 64, offset: 576)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !822, file: !101, line: 65, baseType: !22, size: 64, offset: 640)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !822, file: !101, line: 66, baseType: !22, size: 64, offset: 704)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !822, file: !101, line: 68, baseType: !116, size: 64, offset: 768)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !822, file: !101, line: 70, baseType: !838, size: 64, offset: 832)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !822, file: !101, line: 72, baseType: !28, size: 32, offset: 896)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !822, file: !101, line: 73, baseType: !28, size: 32, offset: 928)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !822, file: !101, line: 74, baseType: !123, size: 64, offset: 960)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !822, file: !101, line: 77, baseType: !29, size: 16, offset: 1024)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !822, file: !101, line: 78, baseType: !127, size: 8, offset: 1040)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !822, file: !101, line: 79, baseType: !129, size: 8, offset: 1048)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !822, file: !101, line: 81, baseType: !133, size: 64, offset: 1088)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !822, file: !101, line: 89, baseType: !136, size: 64, offset: 1152)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !822, file: !101, line: 91, baseType: !138, size: 64, offset: 1216)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !822, file: !101, line: 92, baseType: !141, size: 64, offset: 1280)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !822, file: !101, line: 93, baseType: !838, size: 64, offset: 1344)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !822, file: !101, line: 94, baseType: !24, size: 64, offset: 1408)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !822, file: !101, line: 95, baseType: !146, size: 64, offset: 1472)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !822, file: !101, line: 96, baseType: !28, size: 32, offset: 1536)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !822, file: !101, line: 98, baseType: !150, size: 160, offset: 1568)
!854 = !DILocation(line: 117, column: 9, scope: !42)
!855 = !DILocation(line: 117, column: 14, scope: !42)
!856 = !DILocalVariable(name: "pending_blank", scope: !42, file: !3, line: 122, type: !22)
!857 = !DILocation(line: 122, column: 9, scope: !42)
!858 = !DILocation(line: 124, column: 8, scope: !859)
!859 = distinct !DILexicalBlock(scope: !42, file: !3, line: 124, column: 7)
!860 = !DILocation(line: 124, column: 7, scope: !42)
!861 = !DILocation(line: 125, column: 5, scope: !859)
!862 = !DILocalVariable(name: "mbbuf", scope: !42, file: !3, line: 128, type: !863)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbbuf_t", file: !864, line: 50, baseType: !865)
!864 = !DIFile(filename: "./lib/mbbuf.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0ec2f2727b8356ce94eb797f3e7bb5fd")
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !864, line: 43, size: 320, elements: !866)
!866 = !{!867, !868, !869, !870, !871}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !865, file: !864, line: 45, baseType: !22, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !865, file: !864, line: 46, baseType: !820, size: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !865, file: !864, line: 47, baseType: !155, size: 64, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !865, file: !864, line: 48, baseType: !155, size: 64, offset: 192)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !865, file: !864, line: 49, baseType: !155, size: 64, offset: 256)
!872 = !DILocation(line: 128, column: 11, scope: !42)
!873 = !DILocation(line: 129, column: 48, scope: !42)
!874 = !DILocation(line: 129, column: 3, scope: !42)
!875 = !DILocation(line: 134, column: 29, scope: !42)
!876 = !DILocation(line: 134, column: 46, scope: !42)
!877 = !DILocation(line: 134, column: 62, scope: !42)
!878 = !DILocation(line: 134, column: 19, scope: !42)
!879 = !DILocation(line: 134, column: 17, scope: !42)
!880 = !DILocation(line: 136, column: 3, scope: !42)
!881 = !DILocalVariable(name: "g", scope: !882, file: !3, line: 139, type: !883)
!882 = distinct !DILexicalBlock(scope: !42, file: !3, line: 137, column: 5)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "mcel_t", file: !366, line: 143, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !366, line: 138, size: 64, elements: !885)
!885 = !{!886, !891, !892}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !884, file: !366, line: 140, baseType: !887, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !888, line: 37, baseType: !889)
!888 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !124, line: 57, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !124, line: 42, baseType: !7)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !884, file: !366, line: 141, baseType: !327, size: 8, offset: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !884, file: !366, line: 142, baseType: !327, size: 8, offset: 40)
!893 = !DILocation(line: 139, column: 14, scope: !882)
!894 = !DILocalVariable(name: "convert", scope: !882, file: !3, line: 142, type: !25)
!895 = !DILocation(line: 142, column: 12, scope: !882)
!896 = !DILocalVariable(name: "column", scope: !882, file: !3, line: 149, type: !163)
!897 = !DILocation(line: 149, column: 13, scope: !882)
!898 = !DILocalVariable(name: "next_tab_column", scope: !882, file: !3, line: 152, type: !163)
!899 = !DILocation(line: 152, column: 13, scope: !882)
!900 = !DILocalVariable(name: "tab_index", scope: !882, file: !3, line: 155, type: !155)
!901 = !DILocation(line: 155, column: 13, scope: !882)
!902 = !DILocalVariable(name: "one_blank_before_tab_stop", scope: !882, file: !3, line: 158, type: !25)
!903 = !DILocation(line: 158, column: 12, scope: !882)
!904 = !DILocalVariable(name: "prev_blank", scope: !882, file: !3, line: 163, type: !25)
!905 = !DILocation(line: 163, column: 12, scope: !882)
!906 = !DILocalVariable(name: "pending", scope: !882, file: !3, line: 166, type: !155)
!907 = !DILocation(line: 166, column: 13, scope: !882)
!908 = !DILocation(line: 171, column: 7, scope: !882)
!909 = !DILocation(line: 173, column: 11, scope: !910)
!910 = distinct !DILexicalBlock(scope: !882, file: !3, line: 172, column: 9)
!911 = !DILocation(line: 173, column: 23, scope: !910)
!912 = !DILocation(line: 173, column: 21, scope: !910)
!913 = !DILocation(line: 173, column: 48, scope: !910)
!914 = !DILocation(line: 173, column: 51, scope: !910)
!915 = !DILocation(line: 174, column: 18, scope: !910)
!916 = !DILocation(line: 174, column: 38, scope: !910)
!917 = !DILocation(line: 174, column: 27, scope: !910)
!918 = !DILocation(line: 174, column: 25, scope: !910)
!919 = !DILocation(line: 0, scope: !910)
!920 = !DILocation(line: 175, column: 58, scope: !910)
!921 = !DILocation(line: 175, column: 13, scope: !910)
!922 = distinct !{!922, !909, !923, !549}
!923 = !DILocation(line: 175, column: 60, scope: !910)
!924 = !DILocation(line: 177, column: 15, scope: !925)
!925 = distinct !DILexicalBlock(scope: !910, file: !3, line: 177, column: 15)
!926 = !DILocation(line: 177, column: 15, scope: !910)
!927 = !DILocalVariable(name: "blank", scope: !928, file: !3, line: 179, type: !25)
!928 = distinct !DILexicalBlock(scope: !925, file: !3, line: 178, column: 13)
!929 = !DILocation(line: 179, column: 20, scope: !928)
!930 = !DILocation(line: 179, column: 40, scope: !928)
!931 = !DILocation(line: 179, column: 28, scope: !928)
!932 = !DILocation(line: 181, column: 19, scope: !933)
!933 = distinct !DILexicalBlock(scope: !928, file: !3, line: 181, column: 19)
!934 = !DILocation(line: 181, column: 19, scope: !928)
!935 = !DILocalVariable(name: "last_tab", scope: !936, file: !3, line: 183, type: !25)
!936 = distinct !DILexicalBlock(scope: !933, file: !3, line: 182, column: 17)
!937 = !DILocation(line: 183, column: 24, scope: !936)
!938 = !DILocation(line: 185, column: 58, scope: !936)
!939 = !DILocation(line: 185, column: 37, scope: !936)
!940 = !DILocation(line: 185, column: 35, scope: !936)
!941 = !DILocation(line: 188, column: 23, scope: !942)
!942 = distinct !DILexicalBlock(scope: !936, file: !3, line: 188, column: 23)
!943 = !DILocation(line: 188, column: 23, scope: !936)
!944 = !DILocation(line: 189, column: 29, scope: !942)
!945 = !DILocation(line: 189, column: 21, scope: !942)
!946 = !DILocation(line: 191, column: 23, scope: !947)
!947 = distinct !DILexicalBlock(scope: !936, file: !3, line: 191, column: 23)
!948 = !DILocation(line: 191, column: 23, scope: !936)
!949 = !DILocation(line: 193, column: 29, scope: !950)
!950 = distinct !DILexicalBlock(scope: !951, file: !3, line: 193, column: 27)
!951 = distinct !DILexicalBlock(scope: !947, file: !3, line: 192, column: 21)
!952 = !DILocation(line: 193, column: 32, scope: !950)
!953 = !DILocation(line: 193, column: 27, scope: !951)
!954 = !DILocation(line: 195, column: 36, scope: !955)
!955 = distinct !DILexicalBlock(scope: !950, file: !3, line: 194, column: 25)
!956 = !DILocation(line: 195, column: 34, scope: !955)
!957 = !DILocation(line: 197, column: 31, scope: !958)
!958 = distinct !DILexicalBlock(scope: !955, file: !3, line: 197, column: 31)
!959 = !DILocation(line: 197, column: 31, scope: !955)
!960 = !DILocation(line: 198, column: 29, scope: !958)
!961 = !DILocation(line: 198, column: 46, scope: !958)
!962 = !DILocation(line: 199, column: 25, scope: !955)
!963 = !DILocation(line: 202, column: 49, scope: !964)
!964 = distinct !DILexicalBlock(scope: !950, file: !3, line: 201, column: 25)
!965 = !DILocation(line: 202, column: 37, scope: !964)
!966 = !DILocation(line: 202, column: 34, scope: !964)
!967 = !DILocation(line: 204, column: 34, scope: !968)
!968 = distinct !DILexicalBlock(scope: !964, file: !3, line: 204, column: 31)
!969 = !DILocation(line: 204, column: 45, scope: !968)
!970 = !DILocation(line: 204, column: 48, scope: !968)
!971 = !DILocation(line: 204, column: 58, scope: !968)
!972 = !DILocation(line: 204, column: 55, scope: !968)
!973 = !DILocation(line: 204, column: 31, scope: !964)
!974 = !DILocation(line: 208, column: 35, scope: !975)
!975 = distinct !DILexicalBlock(scope: !976, file: !3, line: 208, column: 35)
!976 = distinct !DILexicalBlock(scope: !968, file: !3, line: 205, column: 29)
!977 = !DILocation(line: 208, column: 45, scope: !975)
!978 = !DILocation(line: 208, column: 42, scope: !975)
!979 = !DILocation(line: 208, column: 35, scope: !976)
!980 = !DILocation(line: 209, column: 59, scope: !975)
!981 = !DILocation(line: 209, column: 33, scope: !975)
!982 = !DILocation(line: 210, column: 39, scope: !976)
!983 = !DILocation(line: 210, column: 55, scope: !976)
!984 = !DILocation(line: 210, column: 53, scope: !976)
!985 = !DILocation(line: 211, column: 39, scope: !976)
!986 = !DILocation(line: 211, column: 72, scope: !976)
!987 = !DILocation(line: 211, column: 70, scope: !976)
!988 = !DILocation(line: 210, column: 31, scope: !976)
!989 = !DILocation(line: 212, column: 44, scope: !976)
!990 = !DILocation(line: 212, column: 42, scope: !976)
!991 = !DILocation(line: 212, column: 39, scope: !976)
!992 = !DILocation(line: 213, column: 42, scope: !976)
!993 = !DILocation(line: 214, column: 31, scope: !976)
!994 = !DILocation(line: 218, column: 29, scope: !964)
!995 = !DILocation(line: 218, column: 33, scope: !964)
!996 = !DILocation(line: 219, column: 31, scope: !997)
!997 = distinct !DILexicalBlock(scope: !964, file: !3, line: 219, column: 31)
!998 = !DILocation(line: 219, column: 51, scope: !997)
!999 = !DILocation(line: 219, column: 31, scope: !964)
!1000 = !DILocation(line: 220, column: 29, scope: !997)
!1001 = !DILocation(line: 221, column: 27, scope: !964)
!1002 = !DILocation(line: 221, column: 44, scope: !964)
!1003 = !DILocation(line: 226, column: 33, scope: !951)
!1004 = !DILocation(line: 226, column: 31, scope: !951)
!1005 = !DILocation(line: 227, column: 21, scope: !951)
!1006 = !DILocation(line: 228, column: 17, scope: !936)
!1007 = !DILocation(line: 229, column: 26, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !933, file: !3, line: 229, column: 24)
!1009 = !DILocation(line: 229, column: 29, scope: !1008)
!1010 = !DILocation(line: 229, column: 24, scope: !933)
!1011 = !DILocation(line: 233, column: 31, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 230, column: 17)
!1013 = !DILocation(line: 233, column: 30, scope: !1012)
!1014 = !DILocation(line: 233, column: 29, scope: !1012)
!1015 = !DILocation(line: 233, column: 26, scope: !1012)
!1016 = !DILocation(line: 234, column: 37, scope: !1012)
!1017 = !DILocation(line: 234, column: 35, scope: !1012)
!1018 = !DILocation(line: 235, column: 34, scope: !1012)
!1019 = !DILocation(line: 235, column: 33, scope: !1012)
!1020 = !DILocation(line: 235, column: 32, scope: !1012)
!1021 = !DILocation(line: 235, column: 29, scope: !1012)
!1022 = !DILocation(line: 236, column: 17, scope: !1012)
!1023 = !DILocalVariable(name: "width", scope: !1024, file: !3, line: 239, type: !28)
!1024 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 238, column: 17)
!1025 = !DILocation(line: 239, column: 23, scope: !1024)
!1026 = !DILocation(line: 239, column: 43, scope: !1024)
!1027 = !DILocation(line: 239, column: 31, scope: !1024)
!1028 = !DILocation(line: 240, column: 23, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 240, column: 23)
!1030 = !DILocation(line: 240, column: 23, scope: !1024)
!1031 = !DILocation(line: 241, column: 21, scope: !1029)
!1032 = !DILocation(line: 244, column: 19, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !928, file: !3, line: 244, column: 19)
!1034 = !DILocation(line: 244, column: 19, scope: !928)
!1035 = !DILocation(line: 246, column: 23, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 246, column: 23)
!1037 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 245, column: 17)
!1038 = !DILocation(line: 246, column: 31, scope: !1036)
!1039 = !DILocation(line: 246, column: 35, scope: !1036)
!1040 = !DILocation(line: 246, column: 38, scope: !1036)
!1041 = !DILocation(line: 246, column: 23, scope: !1037)
!1042 = !DILocation(line: 247, column: 21, scope: !1036)
!1043 = !DILocation(line: 247, column: 38, scope: !1036)
!1044 = !DILocation(line: 248, column: 23, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 248, column: 23)
!1046 = !DILocation(line: 248, column: 69, scope: !1045)
!1047 = !DILocation(line: 248, column: 66, scope: !1045)
!1048 = !DILocation(line: 248, column: 23, scope: !1037)
!1049 = !DILocation(line: 249, column: 21, scope: !1045)
!1050 = !DILocation(line: 250, column: 27, scope: !1037)
!1051 = !DILocation(line: 251, column: 45, scope: !1037)
!1052 = !DILocation(line: 252, column: 17, scope: !1037)
!1053 = !DILocation(line: 254, column: 28, scope: !928)
!1054 = !DILocation(line: 254, column: 26, scope: !928)
!1055 = !DILocation(line: 255, column: 26, scope: !928)
!1056 = !DILocation(line: 255, column: 46, scope: !928)
!1057 = !DILocation(line: 255, column: 49, scope: !928)
!1058 = !DILocation(line: 255, column: 23, scope: !928)
!1059 = !DILocation(line: 256, column: 13, scope: !928)
!1060 = !DILocation(line: 258, column: 17, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !910, file: !3, line: 258, column: 15)
!1062 = !DILocation(line: 258, column: 20, scope: !1061)
!1063 = !DILocation(line: 258, column: 15, scope: !910)
!1064 = !DILocation(line: 260, column: 21, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 259, column: 13)
!1066 = !DILocation(line: 260, column: 15, scope: !1065)
!1067 = !DILocation(line: 261, column: 15, scope: !1065)
!1068 = !DILocation(line: 264, column: 11, scope: !910)
!1069 = !DILocation(line: 265, column: 15, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !910, file: !3, line: 265, column: 15)
!1071 = !DILocation(line: 265, column: 15, scope: !910)
!1072 = !DILocation(line: 266, column: 13, scope: !1070)
!1073 = !DILocation(line: 267, column: 9, scope: !910)
!1074 = !DILocation(line: 268, column: 16, scope: !882)
!1075 = !DILocation(line: 268, column: 19, scope: !882)
!1076 = distinct !{!1076, !908, !1077, !549}
!1077 = !DILocation(line: 268, column: 26, scope: !882)
!1078 = distinct !{!1078, !880, !1079}
!1079 = !DILocation(line: 269, column: 5, scope: !42)
!1080 = !DILocation(line: 270, column: 1, scope: !42)
!1081 = distinct !DISubprogram(name: "c32issep", scope: !34, file: !34, line: 178, type: !1082, scopeLine: 179, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !39)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!25, !887}
!1084 = !DILocalVariable(name: "wc", arg: 1, scope: !1081, file: !34, line: 178, type: !887)
!1085 = !DILocation(line: 178, column: 20, scope: !1081)
!1086 = !DILocation(line: 181, column: 25, scope: !1081)
!1087 = !DILocation(line: 181, column: 13, scope: !1081)
!1088 = !DILocation(line: 181, column: 11, scope: !1081)
!1089 = !DILocation(line: 181, column: 10, scope: !1081)
!1090 = !DILocation(line: 181, column: 3, scope: !1081)
!1091 = distinct !DISubprogram(name: "write_error", scope: !34, file: !34, line: 946, type: !43, scopeLine: 947, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !39)
!1092 = !DILocalVariable(name: "saved_errno", scope: !1091, file: !34, line: 948, type: !28)
!1093 = !DILocation(line: 948, column: 7, scope: !1091)
!1094 = !DILocation(line: 948, column: 21, scope: !1091)
!1095 = !DILocation(line: 949, column: 3, scope: !1091)
!1096 = !DILocation(line: 950, column: 11, scope: !1091)
!1097 = !DILocation(line: 950, column: 3, scope: !1091)
!1098 = !DILocation(line: 951, column: 3, scope: !1091)
!1099 = !DILocation(line: 952, column: 3, scope: !1091)
!1100 = distinct !DISubprogram(name: "add_tab_stop", scope: !63, file: !63, line: 84, type: !1101, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !62, retainedNodes: !39)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{null, !163}
!1103 = !DILocalVariable(name: "tabval", arg: 1, scope: !1100, file: !63, line: 84, type: !163)
!1104 = !DILocation(line: 84, column: 21, scope: !1100)
!1105 = !DILocalVariable(name: "prev_column", scope: !1100, file: !63, line: 86, type: !163)
!1106 = !DILocation(line: 86, column: 9, scope: !1100)
!1107 = !DILocation(line: 86, column: 23, scope: !1100)
!1108 = !DILocation(line: 86, column: 40, scope: !1100)
!1109 = !DILocation(line: 86, column: 49, scope: !1100)
!1110 = !DILocation(line: 86, column: 64, scope: !1100)
!1111 = !DILocalVariable(name: "column_width", scope: !1100, file: !63, line: 87, type: !163)
!1112 = !DILocation(line: 87, column: 9, scope: !1100)
!1113 = !DILocation(line: 87, column: 24, scope: !1100)
!1114 = !DILocation(line: 87, column: 39, scope: !1100)
!1115 = !DILocation(line: 87, column: 36, scope: !1100)
!1116 = !DILocation(line: 87, column: 48, scope: !1100)
!1117 = !DILocation(line: 87, column: 57, scope: !1100)
!1118 = !DILocation(line: 87, column: 55, scope: !1100)
!1119 = !DILocation(line: 89, column: 7, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1100, file: !63, line: 89, column: 7)
!1121 = !DILocation(line: 89, column: 25, scope: !1120)
!1122 = !DILocation(line: 89, column: 22, scope: !1120)
!1123 = !DILocation(line: 89, column: 7, scope: !1100)
!1124 = !DILocation(line: 90, column: 25, scope: !1120)
!1125 = !DILocation(line: 90, column: 16, scope: !1120)
!1126 = !DILocation(line: 90, column: 14, scope: !1120)
!1127 = !DILocation(line: 90, column: 5, scope: !1120)
!1128 = !DILocation(line: 91, column: 32, scope: !1100)
!1129 = !DILocation(line: 91, column: 3, scope: !1100)
!1130 = !DILocation(line: 91, column: 26, scope: !1100)
!1131 = !DILocation(line: 91, column: 30, scope: !1100)
!1132 = !DILocation(line: 93, column: 25, scope: !1100)
!1133 = !DILocation(line: 93, column: 3, scope: !1100)
!1134 = !DILocation(line: 94, column: 1, scope: !1100)
!1135 = distinct !DISubprogram(name: "set_max_column_width", scope: !63, file: !63, line: 73, type: !1101, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !62, retainedNodes: !39)
!1136 = !DILocalVariable(name: "width", arg: 1, scope: !1135, file: !63, line: 73, type: !163)
!1137 = !DILocation(line: 73, column: 29, scope: !1135)
!1138 = !DILocation(line: 75, column: 7, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1135, file: !63, line: 75, column: 7)
!1140 = !DILocation(line: 75, column: 26, scope: !1139)
!1141 = !DILocation(line: 75, column: 24, scope: !1139)
!1142 = !DILocation(line: 75, column: 7, scope: !1135)
!1143 = !DILocation(line: 77, column: 11, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1145, file: !63, line: 77, column: 11)
!1145 = distinct !DILexicalBlock(scope: !1139, file: !63, line: 76, column: 5)
!1146 = !DILocation(line: 77, column: 11, scope: !1145)
!1147 = !DILocation(line: 78, column: 9, scope: !1144)
!1148 = !DILocation(line: 79, column: 5, scope: !1145)
!1149 = !DILocation(line: 80, column: 1, scope: !1135)
!1150 = distinct !DISubprogram(name: "parse_tab_stops", scope: !63, file: !63, line: 137, type: !666, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !62, retainedNodes: !39)
!1151 = !DILocalVariable(name: "stops", arg: 1, scope: !1150, file: !63, line: 137, type: !37)
!1152 = !DILocation(line: 137, column: 30, scope: !1150)
!1153 = !DILocalVariable(name: "have_tabval", scope: !1150, file: !63, line: 139, type: !25)
!1154 = !DILocation(line: 139, column: 8, scope: !1150)
!1155 = !DILocalVariable(name: "tabval", scope: !1150, file: !63, line: 140, type: !163)
!1156 = !DILocation(line: 140, column: 9, scope: !1150)
!1157 = !DILocalVariable(name: "extend_tabval", scope: !1150, file: !63, line: 141, type: !25)
!1158 = !DILocation(line: 141, column: 8, scope: !1150)
!1159 = !DILocalVariable(name: "increment_tabval", scope: !1150, file: !63, line: 142, type: !25)
!1160 = !DILocation(line: 142, column: 8, scope: !1150)
!1161 = !DILocalVariable(name: "num_start", scope: !1150, file: !63, line: 143, type: !37)
!1162 = !DILocation(line: 143, column: 15, scope: !1150)
!1163 = !DILocalVariable(name: "ok", scope: !1150, file: !63, line: 144, type: !25)
!1164 = !DILocation(line: 144, column: 8, scope: !1150)
!1165 = !DILocation(line: 146, column: 3, scope: !1150)
!1166 = !DILocation(line: 146, column: 11, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1168, file: !63, line: 146, column: 3)
!1168 = distinct !DILexicalBlock(scope: !1150, file: !63, line: 146, column: 3)
!1169 = !DILocation(line: 146, column: 10, scope: !1167)
!1170 = !DILocation(line: 146, column: 3, scope: !1168)
!1171 = !DILocation(line: 148, column: 12, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1173, file: !63, line: 148, column: 11)
!1173 = distinct !DILexicalBlock(scope: !1167, file: !63, line: 147, column: 5)
!1174 = !DILocation(line: 148, column: 11, scope: !1172)
!1175 = !DILocation(line: 148, column: 18, scope: !1172)
!1176 = !DILocation(line: 148, column: 25, scope: !1172)
!1177 = !DILocation(line: 148, column: 28, scope: !1172)
!1178 = !DILocation(line: 148, column: 11, scope: !1173)
!1179 = !DILocation(line: 150, column: 15, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1181, file: !63, line: 150, column: 15)
!1181 = distinct !DILexicalBlock(scope: !1172, file: !63, line: 149, column: 9)
!1182 = !DILocation(line: 150, column: 15, scope: !1181)
!1183 = !DILocation(line: 152, column: 19, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1185, file: !63, line: 152, column: 19)
!1185 = distinct !DILexicalBlock(scope: !1180, file: !63, line: 151, column: 13)
!1186 = !DILocation(line: 152, column: 19, scope: !1185)
!1187 = !DILocation(line: 154, column: 42, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1189, file: !63, line: 154, column: 23)
!1189 = distinct !DILexicalBlock(scope: !1184, file: !63, line: 153, column: 17)
!1190 = !DILocation(line: 154, column: 25, scope: !1188)
!1191 = !DILocation(line: 154, column: 23, scope: !1189)
!1192 = !DILocation(line: 156, column: 26, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1188, file: !63, line: 155, column: 21)
!1194 = !DILocation(line: 157, column: 23, scope: !1193)
!1195 = !DILocation(line: 159, column: 17, scope: !1189)
!1196 = !DILocation(line: 160, column: 24, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1184, file: !63, line: 160, column: 24)
!1198 = !DILocation(line: 160, column: 24, scope: !1184)
!1199 = !DILocation(line: 162, column: 45, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1201, file: !63, line: 162, column: 23)
!1201 = distinct !DILexicalBlock(scope: !1197, file: !63, line: 161, column: 17)
!1202 = !DILocation(line: 162, column: 25, scope: !1200)
!1203 = !DILocation(line: 162, column: 23, scope: !1201)
!1204 = !DILocation(line: 164, column: 26, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1200, file: !63, line: 163, column: 21)
!1206 = !DILocation(line: 165, column: 23, scope: !1205)
!1207 = !DILocation(line: 167, column: 17, scope: !1201)
!1208 = !DILocation(line: 169, column: 31, scope: !1197)
!1209 = !DILocation(line: 169, column: 17, scope: !1197)
!1210 = !DILocation(line: 170, column: 13, scope: !1185)
!1211 = !DILocation(line: 171, column: 23, scope: !1181)
!1212 = !DILocation(line: 172, column: 9, scope: !1181)
!1213 = !DILocation(line: 173, column: 17, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1172, file: !63, line: 173, column: 16)
!1215 = !DILocation(line: 173, column: 16, scope: !1214)
!1216 = !DILocation(line: 173, column: 23, scope: !1214)
!1217 = !DILocation(line: 173, column: 16, scope: !1172)
!1218 = !DILocation(line: 175, column: 15, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1220, file: !63, line: 175, column: 15)
!1220 = distinct !DILexicalBlock(scope: !1214, file: !63, line: 174, column: 9)
!1221 = !DILocation(line: 175, column: 15, scope: !1220)
!1222 = !DILocation(line: 177, column: 15, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1219, file: !63, line: 176, column: 13)
!1224 = !DILocation(line: 179, column: 18, scope: !1223)
!1225 = !DILocation(line: 180, column: 13, scope: !1223)
!1226 = !DILocation(line: 181, column: 25, scope: !1220)
!1227 = !DILocation(line: 182, column: 28, scope: !1220)
!1228 = !DILocation(line: 183, column: 9, scope: !1220)
!1229 = !DILocation(line: 184, column: 17, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1214, file: !63, line: 184, column: 16)
!1231 = !DILocation(line: 184, column: 16, scope: !1230)
!1232 = !DILocation(line: 184, column: 23, scope: !1230)
!1233 = !DILocation(line: 184, column: 16, scope: !1214)
!1234 = !DILocation(line: 186, column: 15, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1236, file: !63, line: 186, column: 15)
!1236 = distinct !DILexicalBlock(scope: !1230, file: !63, line: 185, column: 9)
!1237 = !DILocation(line: 186, column: 15, scope: !1236)
!1238 = !DILocation(line: 188, column: 15, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1235, file: !63, line: 187, column: 13)
!1240 = !DILocation(line: 190, column: 18, scope: !1239)
!1241 = !DILocation(line: 191, column: 13, scope: !1239)
!1242 = !DILocation(line: 192, column: 28, scope: !1236)
!1243 = !DILocation(line: 193, column: 25, scope: !1236)
!1244 = !DILocation(line: 194, column: 9, scope: !1236)
!1245 = !DILocation(line: 195, column: 28, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1230, file: !63, line: 195, column: 16)
!1247 = !DILocation(line: 195, column: 27, scope: !1246)
!1248 = !DILocation(line: 195, column: 16, scope: !1246)
