; ModuleID = 'src/mkdir.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.savewd = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.mkdir_options = type { i32 (i8*, i8*, i8*)*, i32, i32, i32, i32, %struct.selabel_handle*, i8* }
%struct.selabel_handle = type opaque
%struct.mode_change = type { i8, i8, i32, i32, i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [36 x i8] c"Usage: %s [OPTION]... DIRECTORY...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 39, type: !77, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !58, globals: !67, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/mkdir.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d793d15b84a01608d40780cfd3f61f54")
!4 = !{!5, !21, !35}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256)
!10 = !DIEnumerator(name: "_ISlower", value: 512)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!14 = !DIEnumerator(name: "_ISspace", value: 8192)
!15 = !DIEnumerator(name: "_ISprint", value: 16384)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768)
!17 = !DIEnumerator(name: "_ISblank", value: 1)
!18 = !DIEnumerator(name: "_IScntrl", value: 2)
!19 = !DIEnumerator(name: "_ISpunct", value: 4)
!20 = !DIEnumerator(name: "_ISalnum", value: 8)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !22, line: 42, baseType: !7, size: 32, elements: !23)
!22 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!24 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!25 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!26 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!27 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!28 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!29 = !DIEnumerator(name: "c_quoting_style", value: 5)
!30 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!31 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!32 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!33 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!34 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !37, file: !36, line: 45, baseType: !7, size: 32, elements: !51)
!36 = !DIFile(filename: "./lib/savewd.h", directory: "/src", checksumkind: CSK_MD5, checksum: "ad4dd1c19e06c974b5c544edb9d47f86")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !36, line: 42, size: 64, elements: !38)
!38 = !{!39, !40}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !37, file: !36, line: 73, baseType: !35, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !37, file: !36, line: 81, baseType: !41, size: 32, offset: 32)
!41 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !37, file: !36, line: 76, size: 32, elements: !42)
!42 = !{!43, !45, !46}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !41, file: !36, line: 78, baseType: !44, size: 32)
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !41, file: !36, line: 79, baseType: !44, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !41, file: !36, line: 80, baseType: !47, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !48, line: 97, baseType: !49)
!48 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !50, line: 154, baseType: !44)
!50 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!51 = !{!52, !53, !54, !55, !56, !57}
!52 = !DIEnumerator(name: "INITIAL_STATE", value: 0)
!53 = !DIEnumerator(name: "FD_STATE", value: 1)
!54 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2)
!55 = !DIEnumerator(name: "FORKING_STATE", value: 3)
!56 = !DIEnumerator(name: "ERROR_STATE", value: 4)
!57 = !DIEnumerator(name: "FINAL_STATE", value: 5)
!58 = !{!59, !61, !44, !62, !63, !65}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!62 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !48, line: 79, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !50, line: 146, baseType: !7)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !48, line: 64, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !50, line: 147, baseType: !7)
!67 = !{!68, !0}
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !70, file: !71, line: 575, type: !44, isLocal: true, isDefinition: true)
!70 = distinct !DISubprogram(name: "oputs_", scope: !71, file: !71, line: 573, type: !72, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !76)
!71 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!72 = !DISubroutineType(types: !73)
!73 = !{null, !74, !74}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!76 = !{}
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 1792, elements: !87)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !80, line: 50, size: 256, elements: !81)
!80 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!81 = !{!82, !83, !84, !86}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !79, file: !80, line: 52, baseType: !74, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !79, file: !80, line: 55, baseType: !44, size: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !79, file: !80, line: 56, baseType: !85, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !79, file: !80, line: 57, baseType: !44, size: 32, offset: 192)
!87 = !{!88}
!88 = !DISubrange(count: 7)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "Version", scope: !91, file: !92, line: 3, type: !74, isLocal: false, isDefinition: true)
!91 = distinct !DICompileUnit(language: DW_LANG_C99, file: !92, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !93, splitDebugInlining: false, nameTableKind: None)
!92 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!93 = !{!89}
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "file_name", scope: !96, file: !97, line: 45, type: !74, isLocal: true, isDefinition: true)
!96 = distinct !DICompileUnit(language: DW_LANG_C99, file: !97, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !98, splitDebugInlining: false, nameTableKind: None)
!97 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!98 = !{!94, !99}
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !96, file: !97, line: 55, type: !101, isLocal: true, isDefinition: true)
!101 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !104, file: !105, line: 66, type: !133, isLocal: false, isDefinition: true)
!104 = distinct !DICompileUnit(language: DW_LANG_C99, file: !105, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !106, globals: !107, splitDebugInlining: false, nameTableKind: None)
!105 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!106 = !{!61}
!107 = !{!108, !127, !102, !129, !131}
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "old_file_name", scope: !110, file: !105, line: 304, type: !74, isLocal: true, isDefinition: true)
!110 = distinct !DISubprogram(name: "verror_at_line", scope: !105, file: !105, line: 298, type: !111, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !104, retainedNodes: !76)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !44, !44, !74, !7, !74, !113}
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !114, line: 52, baseType: !115)
!114 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !116, line: 32, baseType: !117)
!116 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !118, baseType: !119)
!118 = !DIFile(filename: "lib/error.c", directory: "/src")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !120, size: 256, elements: !121)
!120 = !DINamespace(name: "std", scope: null)
!121 = !{!122, !123, !124, !125, !126}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !119, file: !118, baseType: !61, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !119, file: !118, baseType: !61, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !119, file: !118, baseType: !61, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !119, file: !118, baseType: !44, size: 32, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !119, file: !118, baseType: !44, size: 32, offset: 224)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "old_line_number", scope: !110, file: !105, line: 305, type: !7, isLocal: true, isDefinition: true)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "error_message_count", scope: !104, file: !105, line: 69, type: !7, isLocal: false, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !104, file: !105, line: 295, type: !44, isLocal: false, isDefinition: true)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{null}
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "program_name", scope: !138, file: !139, line: 31, type: !74, isLocal: false, isDefinition: true)
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !140, globals: !141, splitDebugInlining: false, nameTableKind: None)
!139 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!140 = !{!59}
!141 = !{!136}
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "utf07FF", scope: !144, file: !145, line: 46, type: !150, isLocal: true, isDefinition: true)
!144 = distinct !DISubprogram(name: "proper_name_lite", scope: !145, file: !145, line: 38, type: !146, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !148, retainedNodes: !76)
!145 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!146 = !DISubroutineType(types: !147)
!147 = !{!74, !74, !74}
!148 = distinct !DICompileUnit(language: DW_LANG_C99, file: !145, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !149, splitDebugInlining: false, nameTableKind: None)
!149 = !{!142}
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 16, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 2)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !155, file: !156, line: 76, type: !212, isLocal: false, isDefinition: true)
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !157, retainedTypes: !163, globals: !167, splitDebugInlining: false, nameTableKind: None)
!156 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!157 = !{!21, !158, !5}
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !22, line: 254, baseType: !7, size: 32, elements: !159)
!159 = !{!160, !161, !162}
!160 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!161 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!162 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!163 = !{!44, !62, !164}
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !165, line: 46, baseType: !166)
!165 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!166 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!167 = !{!153, !168, !174, !186, !188, !193, !201, !208, !210}
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !155, file: !156, line: 92, type: !170, isLocal: false, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 320, elements: !172)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!172 = !{!173}
!173 = !DISubrange(count: 10)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !155, file: !156, line: 1040, type: !176, isLocal: false, isDefinition: true)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !156, line: 56, size: 448, elements: !177)
!177 = !{!178, !179, !180, !184, !185}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !176, file: !156, line: 59, baseType: !21, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !176, file: !156, line: 62, baseType: !44, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !176, file: !156, line: 66, baseType: !181, size: 256, offset: 64)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 8)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !176, file: !156, line: 69, baseType: !74, size: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !176, file: !156, line: 72, baseType: !74, size: 64, offset: 384)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !155, file: !156, line: 107, type: !176, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "slot0", scope: !155, file: !156, line: 831, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2048, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 256)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "quote", scope: !195, file: !156, line: 228, type: !198, isLocal: true, isDefinition: true)
!195 = distinct !DISubprogram(name: "gettext_quote", scope: !156, file: !156, line: 197, type: !196, scopeLine: 198, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !155, retainedNodes: !76)
!196 = !DISubroutineType(types: !197)
!197 = !{!74, !74, !21}
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 64, elements: !199)
!199 = !{!152, !200}
!200 = !DISubrange(count: 4)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "slotvec", scope: !155, file: !156, line: 834, type: !203, isLocal: true, isDefinition: true)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !156, line: 823, size: 128, elements: !205)
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !204, file: !156, line: 825, baseType: !164, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !204, file: !156, line: 826, baseType: !59, size: 64, offset: 64)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "nslots", scope: !155, file: !156, line: 832, type: !44, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "slotvec0", scope: !155, file: !156, line: 833, type: !204, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 704, elements: !214)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!214 = !{!215}
!215 = !DISubrange(count: 11)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !218, file: !219, line: 26, type: !221, isLocal: false, isDefinition: true)
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !220, splitDebugInlining: false, nameTableKind: None)
!219 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!220 = !{!216}
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 376, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 47)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "exit_failure", scope: !226, file: !227, line: 24, type: !229, isLocal: false, isDefinition: true)
!226 = distinct !DICompileUnit(language: DW_LANG_C99, file: !227, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !228, splitDebugInlining: false, nameTableKind: None)
!227 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!228 = !{!224}
!229 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !44)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "internal_state", scope: !232, file: !233, line: 97, type: !237, isLocal: true, isDefinition: true)
!232 = distinct !DICompileUnit(language: DW_LANG_C99, file: !233, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !234, globals: !236, splitDebugInlining: false, nameTableKind: None)
!233 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!234 = !{!61, !164, !235}
!235 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!236 = !{!230}
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !238, line: 6, baseType: !239)
!238 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !240, line: 21, baseType: !241)
!240 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !240, line: 13, size: 64, elements: !242)
!242 = !{!243, !244}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !241, file: !240, line: 15, baseType: !44, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !241, file: !240, line: 20, baseType: !245, size: 32, offset: 32)
!245 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !241, file: !240, line: 16, size: 32, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !245, file: !240, line: 18, baseType: !7, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !245, file: !240, line: 19, baseType: !249, size: 32)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 32, elements: !250)
!250 = !{!200}
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !253, file: !254, line: 506, type: !44, isLocal: true, isDefinition: true)
!253 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !254, file: !254, line: 485, type: !255, scopeLine: 486, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !257, retainedNodes: !76)
!254 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!255 = !DISubroutineType(types: !256)
!256 = !{!44, !44, !44}
!257 = distinct !DICompileUnit(language: DW_LANG_C99, file: !254, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !258, splitDebugInlining: false, nameTableKind: None)
!258 = !{!251}
!259 = distinct !DICompileUnit(language: DW_LANG_C99, file: !260, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!260 = !DIFile(filename: "src/prog-fprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8f170eec0f5223b6ba3ae07aa753e06a")
!261 = distinct !DICompileUnit(language: DW_LANG_C99, file: !262, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!262 = !DIFile(filename: "src/selinux.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f2fe0a2ae80ab081d56e5c6fc8b81c38")
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !140, splitDebugInlining: false, nameTableKind: None)
!264 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!265 = distinct !DICompileUnit(language: DW_LANG_C99, file: !266, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!266 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!267 = distinct !DICompileUnit(language: DW_LANG_C99, file: !268, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, retainedTypes: !284, splitDebugInlining: false, nameTableKind: None)
!268 = !DIFile(filename: "lib/mkdir-p.c", directory: "/src", checksumkind: CSK_MD5, checksum: "35fabba6c7fba2a5201f9ea7f8c0e0d1")
!269 = !{!270, !280}
!270 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !271, file: !36, line: 45, baseType: !7, size: 32, elements: !51)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !36, line: 42, size: 64, elements: !272)
!272 = !{!273, !274}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !271, file: !36, line: 73, baseType: !270, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !271, file: !36, line: 81, baseType: !275, size: 32, offset: 32)
!275 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !271, file: !36, line: 76, size: 32, elements: !276)
!276 = !{!277, !278, !279}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !275, file: !36, line: 78, baseType: !44, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !275, file: !36, line: 79, baseType: !44, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !275, file: !36, line: 80, baseType: !47, size: 32)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 93, baseType: !7, size: 32, elements: !281)
!281 = !{!282, !283}
!282 = !DIEnumerator(name: "SAVEWD_CHDIR_NOFOLLOW", value: 1)
!283 = !DIEnumerator(name: "SAVEWD_CHDIR_SKIP_READABLE", value: 2)
!284 = !{!63, !65}
!285 = distinct !DICompileUnit(language: DW_LANG_C99, file: !286, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !287, splitDebugInlining: false, nameTableKind: None)
!286 = !DIFile(filename: "lib/modechange.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d9d9323c1a974dc920f948d08984b73e")
!287 = !{!288}
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !286, line: 78, baseType: !7, size: 32, elements: !289)
!289 = !{!290, !291, !292, !293}
!290 = !DIEnumerator(name: "MODE_DONE", value: 0)
!291 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1)
!292 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2)
!293 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3)
!294 = distinct !DICompileUnit(language: DW_LANG_C99, file: !295, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !296, splitDebugInlining: false, nameTableKind: None)
!295 = !DIFile(filename: "lib/savewd.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0cafd16d007fc7abd1f9bf11434952af")
!296 = !{!297, !280}
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !298, file: !36, line: 45, baseType: !7, size: 32, elements: !51)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !36, line: 42, size: 64, elements: !299)
!299 = !{!300, !301}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !298, file: !36, line: 73, baseType: !297, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !298, file: !36, line: 81, baseType: !302, size: 32, offset: 32)
!302 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !298, file: !36, line: 76, size: 32, elements: !303)
!303 = !{!304, !305, !306}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !302, file: !36, line: 78, baseType: !44, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !302, file: !36, line: 79, baseType: !44, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !302, file: !36, line: 80, baseType: !47, size: 32)
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!308 = !DIFile(filename: "lib/se-selinux.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cd8f10965091a99e212a6fcf580f5e3b")
!309 = distinct !DICompileUnit(language: DW_LANG_C99, file: !310, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!310 = !DIFile(filename: "lib/streq.c", directory: "/src", checksumkind: CSK_MD5, checksum: "912b0bbb2168195104931254916871aa")
!311 = distinct !DICompileUnit(language: DW_LANG_C99, file: !312, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !106, splitDebugInlining: false, nameTableKind: None)
!312 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!313 = !{!314}
!314 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !312, line: 40, baseType: !7, size: 32, elements: !315)
!315 = !{!316}
!316 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !319, retainedTypes: !336, splitDebugInlining: false, nameTableKind: None)
!318 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!319 = !{!320, !327}
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !321, file: !318, line: 188, baseType: !7, size: 32, elements: !325)
!321 = distinct !DISubprogram(name: "x2nrealloc", scope: !318, file: !318, line: 176, type: !322, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !317, retainedNodes: !76)
!322 = !DISubroutineType(types: !323)
!323 = !{!61, !61, !324, !164}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!325 = !{!326}
!326 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!327 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !328, file: !318, line: 228, baseType: !7, size: 32, elements: !325)
!328 = distinct !DISubprogram(name: "xpalloc", scope: !318, file: !318, line: 223, type: !329, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !317, retainedNodes: !76)
!329 = !DISubroutineType(types: !330)
!330 = !{!61, !61, !331, !332, !334, !332}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !333, line: 130, baseType: !334)
!333 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !165, line: 35, baseType: !335)
!335 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!336 = !{!59, !61, !101, !335, !166}
!337 = distinct !DICompileUnit(language: DW_LANG_C99, file: !338, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!338 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!339 = distinct !DICompileUnit(language: DW_LANG_C99, file: !340, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!340 = !DIFile(filename: "lib/c32isprint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aac58442c7952a27a6ecb1773b2ef569")
!341 = distinct !DICompileUnit(language: DW_LANG_C99, file: !342, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!342 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!343 = distinct !DICompileUnit(language: DW_LANG_C99, file: !344, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!344 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!346 = !DIFile(filename: "lib/open-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84efcad54206a8ffedf254f32134ee9c")
!347 = distinct !DICompileUnit(language: DW_LANG_C99, file: !348, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !106, splitDebugInlining: false, nameTableKind: None)
!348 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!349 = distinct !DICompileUnit(language: DW_LANG_C99, file: !350, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !106, splitDebugInlining: false, nameTableKind: None)
!350 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !106, splitDebugInlining: false, nameTableKind: None)
!352 = !DIFile(filename: "lib/ialloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e1d85861a0099c22cc583b5eb5f30423")
!353 = distinct !DICompileUnit(language: DW_LANG_C99, file: !354, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!354 = !DIFile(filename: "lib/mbszero.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1b51b91fccd359a867925f7b0fc988a4")
!355 = distinct !DICompileUnit(language: DW_LANG_C99, file: !356, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!356 = !DIFile(filename: "lib/memeq.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9bf299a5d27acbe732c4d2f0d9a2144a")
!357 = distinct !DICompileUnit(language: DW_LANG_C99, file: !358, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !359, splitDebugInlining: false, nameTableKind: None)
!358 = !DIFile(filename: "lib/mkancesdirs.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c6b54240f33d18f510b92d67eeccd60e")
!359 = !{!360, !280}
!360 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !361, file: !36, line: 45, baseType: !7, size: 32, elements: !51)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !36, line: 42, size: 64, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !361, file: !36, line: 73, baseType: !360, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !361, file: !36, line: 81, baseType: !365, size: 32, offset: 32)
!365 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !361, file: !36, line: 76, size: 32, elements: !366)
!366 = !{!367, !368, !369}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !365, file: !36, line: 78, baseType: !44, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !365, file: !36, line: 79, baseType: !44, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !365, file: !36, line: 80, baseType: !47, size: 32)
!370 = distinct !DICompileUnit(language: DW_LANG_C99, file: !371, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !372, splitDebugInlining: false, nameTableKind: None)
!371 = !DIFile(filename: "lib/dirchownmod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b1a0bf6d4e9295f75572be521597aa1e")
!372 = !{!63, !65, !373}
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !48, line: 69, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !50, line: 150, baseType: !7)
!375 = distinct !DICompileUnit(language: DW_LANG_C99, file: !376, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!376 = !DIFile(filename: "lib/realloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a76cd3b708f695a3bf546d626aa758d")
!377 = distinct !DICompileUnit(language: DW_LANG_C99, file: !378, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !379, splitDebugInlining: false, nameTableKind: None)
!378 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!379 = !{!101, !166, !61}
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!381 = !DIFile(filename: "lib/fd-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12c3310fb811f6ed0e0fb7e99c1b995b")
!382 = distinct !DICompileUnit(language: DW_LANG_C99, file: !383, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!383 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!384 = distinct !DICompileUnit(language: DW_LANG_C99, file: !385, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!385 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !106, splitDebugInlining: false, nameTableKind: None)
!387 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!389 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!390 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!391 = !{i32 7, !"Dwarf Version", i32 5}
!392 = !{i32 2, !"Debug Info Version", i32 3}
!393 = !{i32 1, !"wchar_size", i32 4}
!394 = !{i32 1, !"branch-target-enforcement", i32 0}
!395 = !{i32 1, !"sign-return-address", i32 0}
!396 = !{i32 1, !"sign-return-address-all", i32 0}
!397 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!398 = !{i32 7, !"PIC Level", i32 2}
!399 = !{i32 7, !"PIE Level", i32 2}
!400 = !{i32 7, !"uwtable", i32 1}
!401 = !{i32 7, !"frame-pointer", i32 1}
!402 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 51, type: !403, scopeLine: 52, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !76)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !44}
!405 = !DILocalVariable(name: "status", arg: 1, scope: !402, file: !3, line: 51, type: !44)
!406 = !DILocation(line: 51, column: 12, scope: !402)
!407 = !DILocation(line: 53, column: 7, scope: !408)
!408 = distinct !DILexicalBlock(scope: !402, file: !3, line: 53, column: 7)
!409 = !DILocation(line: 53, column: 14, scope: !408)
!410 = !DILocation(line: 53, column: 7, scope: !402)
!411 = !DILocation(line: 54, column: 5, scope: !408)
!412 = !DILocation(line: 54, column: 5, scope: !413)
!413 = distinct !DILexicalBlock(scope: !408, file: !3, line: 54, column: 5)
!414 = !DILocation(line: 57, column: 15, scope: !415)
!415 = distinct !DILexicalBlock(scope: !408, file: !3, line: 56, column: 5)
!416 = !DILocation(line: 57, column: 58, scope: !415)
!417 = !DILocation(line: 57, column: 7, scope: !415)
!418 = !DILocation(line: 58, column: 7, scope: !415)
!419 = !DILocation(line: 62, column: 7, scope: !415)
!420 = !DILocation(line: 64, column: 7, scope: !415)
!421 = !DILocation(line: 68, column: 7, scope: !415)
!422 = !DILocation(line: 73, column: 7, scope: !415)
!423 = !DILocation(line: 77, column: 7, scope: !415)
!424 = !DILocation(line: 82, column: 7, scope: !415)
!425 = !DILocation(line: 87, column: 7, scope: !415)
!426 = !DILocation(line: 88, column: 7, scope: !415)
!427 = !DILocation(line: 89, column: 7, scope: !415)
!428 = !DILocation(line: 91, column: 9, scope: !402)
!429 = !DILocation(line: 91, column: 3, scope: !402)
!430 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !71, file: !71, line: 734, type: !134, scopeLine: 735, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !76)
!431 = !DILocation(line: 736, column: 3, scope: !430)
!432 = !DILocation(line: 739, column: 1, scope: !430)
!433 = !DILocalVariable(name: "program", arg: 1, scope: !70, file: !71, line: 573, type: !74)
!434 = !DILocation(line: 573, column: 34, scope: !70)
!435 = !DILocalVariable(name: "option", arg: 2, scope: !70, file: !71, line: 573, type: !74)
!436 = !DILocation(line: 573, column: 55, scope: !70)
!437 = !DILocation(line: 581, column: 7, scope: !438)
!438 = distinct !DILexicalBlock(scope: !70, file: !71, line: 581, column: 7)
!439 = !DILocation(line: 581, column: 19, scope: !438)
!440 = !DILocation(line: 581, column: 7, scope: !70)
!441 = !DILocalVariable(name: "term", scope: !442, file: !71, line: 585, type: !74)
!442 = distinct !DILexicalBlock(scope: !438, file: !71, line: 582, column: 5)
!443 = !DILocation(line: 585, column: 19, scope: !442)
!444 = !DILocation(line: 585, column: 26, scope: !442)
!445 = !DILocation(line: 586, column: 23, scope: !442)
!446 = !DILocation(line: 586, column: 28, scope: !442)
!447 = !DILocation(line: 586, column: 33, scope: !442)
!448 = !DILocation(line: 586, column: 32, scope: !442)
!449 = !DILocation(line: 586, column: 38, scope: !442)
!450 = !DILocation(line: 586, column: 48, scope: !442)
!451 = !DILocation(line: 586, column: 41, scope: !442)
!452 = !DILocation(line: 586, column: 19, scope: !442)
!453 = !DILocation(line: 587, column: 5, scope: !442)
!454 = !DILocation(line: 588, column: 7, scope: !455)
!455 = distinct !DILexicalBlock(scope: !70, file: !71, line: 588, column: 7)
!456 = !DILocation(line: 588, column: 7, scope: !70)
!457 = !DILocation(line: 590, column: 7, scope: !458)
!458 = distinct !DILexicalBlock(scope: !455, file: !71, line: 589, column: 5)
!459 = !DILocation(line: 591, column: 7, scope: !458)
!460 = !DILocalVariable(name: "double_space", scope: !70, file: !71, line: 594, type: !101)
!461 = !DILocation(line: 594, column: 8, scope: !70)
!462 = !DILocalVariable(name: "first_word", scope: !70, file: !71, line: 595, type: !74)
!463 = !DILocation(line: 595, column: 15, scope: !70)
!464 = !DILocation(line: 595, column: 28, scope: !70)
!465 = !DILocation(line: 595, column: 45, scope: !70)
!466 = !DILocation(line: 595, column: 37, scope: !70)
!467 = !DILocation(line: 595, column: 35, scope: !70)
!468 = !DILocalVariable(name: "option_text", scope: !70, file: !71, line: 596, type: !74)
!469 = !DILocation(line: 596, column: 15, scope: !70)
!470 = !DILocation(line: 596, column: 37, scope: !70)
!471 = !DILocation(line: 596, column: 29, scope: !70)
!472 = !DILocation(line: 597, column: 8, scope: !473)
!473 = distinct !DILexicalBlock(scope: !70, file: !71, line: 597, column: 7)
!474 = !DILocation(line: 597, column: 7, scope: !70)
!475 = !DILocation(line: 599, column: 21, scope: !476)
!476 = distinct !DILexicalBlock(scope: !473, file: !71, line: 598, column: 5)
!477 = !DILocation(line: 599, column: 19, scope: !476)
!478 = !DILocation(line: 602, column: 20, scope: !476)
!479 = !DILocation(line: 603, column: 5, scope: !476)
!480 = !DILocation(line: 604, column: 12, scope: !481)
!481 = distinct !DILexicalBlock(scope: !473, file: !71, line: 604, column: 12)
!482 = !DILocation(line: 604, column: 27, scope: !481)
!483 = !DILocation(line: 604, column: 24, scope: !481)
!484 = !DILocation(line: 604, column: 12, scope: !473)
!485 = !DILocalVariable(name: "s", scope: !486, file: !71, line: 608, type: !74)
!486 = distinct !DILexicalBlock(scope: !481, file: !71, line: 605, column: 5)
!487 = !DILocation(line: 608, column: 19, scope: !486)
!488 = !DILocation(line: 608, column: 23, scope: !486)
!489 = !DILocalVariable(name: "spaces", scope: !486, file: !71, line: 609, type: !164)
!490 = !DILocation(line: 609, column: 14, scope: !486)
!491 = !DILocation(line: 610, column: 7, scope: !486)
!492 = !DILocation(line: 610, column: 14, scope: !486)
!493 = !DILocation(line: 610, column: 18, scope: !486)
!494 = !DILocation(line: 610, column: 16, scope: !486)
!495 = !DILocation(line: 610, column: 30, scope: !486)
!496 = !DILocation(line: 610, column: 33, scope: !486)
!497 = !DILocation(line: 610, column: 40, scope: !486)
!498 = !DILocation(line: 0, scope: !486)
!499 = !DILocation(line: 611, column: 21, scope: !486)
!500 = !DILocation(line: 611, column: 20, scope: !486)
!501 = !DILocation(line: 611, column: 19, scope: !486)
!502 = !DILocation(line: 611, column: 16, scope: !486)
!503 = distinct !{!503, !491, !499, !504}
!504 = !{!"llvm.loop.mustprogress"}
!505 = !DILocation(line: 612, column: 11, scope: !506)
!506 = distinct !DILexicalBlock(scope: !486, file: !71, line: 612, column: 11)
!507 = !DILocation(line: 612, column: 18, scope: !506)
!508 = !DILocation(line: 612, column: 11, scope: !486)
!509 = !DILocation(line: 615, column: 25, scope: !510)
!510 = distinct !DILexicalBlock(scope: !506, file: !71, line: 613, column: 9)
!511 = !DILocation(line: 615, column: 23, scope: !510)
!512 = !DILocation(line: 616, column: 24, scope: !510)
!513 = !DILocation(line: 617, column: 9, scope: !510)
!514 = !DILocation(line: 618, column: 5, scope: !486)
!515 = !DILocalVariable(name: "anchor_len", scope: !70, file: !71, line: 620, type: !164)
!516 = !DILocation(line: 620, column: 10, scope: !70)
!517 = !DILocation(line: 620, column: 32, scope: !70)
!518 = !DILocation(line: 620, column: 23, scope: !70)
!519 = !DILocalVariable(name: "desc_text", scope: !70, file: !71, line: 625, type: !74)
!520 = !DILocation(line: 625, column: 15, scope: !70)
!521 = !DILocation(line: 625, column: 27, scope: !70)
!522 = !DILocation(line: 625, column: 41, scope: !70)
!523 = !DILocation(line: 625, column: 39, scope: !70)
!524 = !DILocation(line: 626, column: 3, scope: !70)
!525 = !DILocation(line: 626, column: 11, scope: !70)
!526 = !DILocation(line: 626, column: 10, scope: !70)
!527 = !DILocation(line: 626, column: 21, scope: !70)
!528 = !DILocation(line: 626, column: 25, scope: !70)
!529 = !DILocation(line: 626, column: 24, scope: !70)
!530 = !DILocation(line: 626, column: 35, scope: !70)
!531 = !DILocation(line: 0, scope: !70)
!532 = !DILocation(line: 628, column: 12, scope: !533)
!533 = distinct !DILexicalBlock(scope: !534, file: !71, line: 628, column: 11)
!534 = distinct !DILexicalBlock(scope: !70, file: !71, line: 627, column: 5)
!535 = !DILocation(line: 628, column: 11, scope: !533)
!536 = !DILocation(line: 628, column: 22, scope: !533)
!537 = !DILocation(line: 628, column: 29, scope: !533)
!538 = !DILocation(line: 628, column: 34, scope: !533)
!539 = !DILocation(line: 628, column: 44, scope: !533)
!540 = !DILocation(line: 628, column: 32, scope: !533)
!541 = !DILocation(line: 628, column: 49, scope: !533)
!542 = !DILocation(line: 628, column: 11, scope: !534)
!543 = !DILocation(line: 629, column: 22, scope: !533)
!544 = !DILocation(line: 629, column: 9, scope: !533)
!545 = !DILocation(line: 630, column: 11, scope: !546)
!546 = distinct !DILexicalBlock(scope: !534, file: !71, line: 630, column: 11)
!547 = !DILocation(line: 630, column: 11, scope: !534)
!548 = !DILocation(line: 632, column: 16, scope: !549)
!549 = distinct !DILexicalBlock(scope: !550, file: !71, line: 632, column: 15)
!550 = distinct !DILexicalBlock(scope: !546, file: !71, line: 631, column: 9)
!551 = !DILocation(line: 632, column: 15, scope: !549)
!552 = !DILocation(line: 632, column: 26, scope: !549)
!553 = !DILocation(line: 632, column: 34, scope: !549)
!554 = !DILocation(line: 632, column: 37, scope: !549)
!555 = !DILocation(line: 632, column: 15, scope: !550)
!556 = !DILocation(line: 633, column: 13, scope: !549)
!557 = !DILocation(line: 636, column: 16, scope: !558)
!558 = distinct !DILexicalBlock(scope: !550, file: !71, line: 636, column: 15)
!559 = !DILocation(line: 636, column: 29, scope: !558)
!560 = !DILocation(line: 636, column: 34, scope: !558)
!561 = !DILocation(line: 636, column: 44, scope: !558)
!562 = !DILocation(line: 636, column: 32, scope: !558)
!563 = !DILocation(line: 636, column: 49, scope: !558)
!564 = !DILocation(line: 636, column: 15, scope: !550)
!565 = !DILocation(line: 637, column: 13, scope: !558)
!566 = !DILocation(line: 638, column: 9, scope: !550)
!567 = !DILocation(line: 640, column: 16, scope: !534)
!568 = distinct !{!568, !524, !569, !504}
!569 = !DILocation(line: 641, column: 5, scope: !70)
!570 = !DILocation(line: 644, column: 3, scope: !70)
!571 = !DILocalVariable(name: "url_program", scope: !70, file: !71, line: 648, type: !74)
!572 = !DILocation(line: 648, column: 15, scope: !70)
!573 = !DILocation(line: 648, column: 38, scope: !70)
!574 = !DILocation(line: 648, column: 31, scope: !70)
!575 = !DILocation(line: 649, column: 38, scope: !70)
!576 = !DILocation(line: 649, column: 31, scope: !70)
!577 = !DILocation(line: 650, column: 38, scope: !70)
!578 = !DILocation(line: 650, column: 31, scope: !70)
!579 = !DILocation(line: 651, column: 38, scope: !70)
!580 = !DILocation(line: 651, column: 31, scope: !70)
!581 = !DILocation(line: 652, column: 38, scope: !70)
!582 = !DILocation(line: 652, column: 31, scope: !70)
!583 = !DILocation(line: 653, column: 38, scope: !70)
!584 = !DILocation(line: 653, column: 31, scope: !70)
!585 = !DILocation(line: 654, column: 38, scope: !70)
!586 = !DILocation(line: 654, column: 31, scope: !70)
!587 = !DILocation(line: 655, column: 38, scope: !70)
!588 = !DILocation(line: 655, column: 31, scope: !70)
!589 = !DILocation(line: 656, column: 38, scope: !70)
!590 = !DILocation(line: 656, column: 31, scope: !70)
!591 = !DILocation(line: 657, column: 38, scope: !70)
!592 = !DILocation(line: 657, column: 31, scope: !70)
!593 = !DILocation(line: 658, column: 31, scope: !70)
!594 = !DILocation(line: 663, column: 7, scope: !595)
!595 = distinct !DILexicalBlock(scope: !70, file: !71, line: 663, column: 7)
!596 = !DILocation(line: 664, column: 7, scope: !595)
!597 = !DILocation(line: 664, column: 10, scope: !595)
!598 = !DILocation(line: 663, column: 7, scope: !70)
!599 = !DILocation(line: 670, column: 15, scope: !600)
!600 = distinct !DILexicalBlock(scope: !595, file: !71, line: 665, column: 5)
!601 = !DILocation(line: 670, column: 28, scope: !600)
!602 = !DILocation(line: 670, column: 47, scope: !600)
!603 = !DILocation(line: 670, column: 41, scope: !600)
!604 = !DILocation(line: 670, column: 59, scope: !600)
!605 = !DILocation(line: 669, column: 7, scope: !600)
!606 = !DILocation(line: 671, column: 5, scope: !600)
!607 = !DILocation(line: 676, column: 48, scope: !608)
!608 = distinct !DILexicalBlock(scope: !595, file: !71, line: 673, column: 5)
!609 = !DILocation(line: 677, column: 21, scope: !608)
!610 = !DILocation(line: 677, column: 15, scope: !608)
!611 = !DILocation(line: 677, column: 33, scope: !608)
!612 = !DILocation(line: 676, column: 7, scope: !608)
!613 = !DILocation(line: 679, column: 3, scope: !70)
!614 = !DILocation(line: 683, column: 3, scope: !70)
!615 = !DILocation(line: 686, column: 3, scope: !70)
!616 = !DILocation(line: 688, column: 3, scope: !70)
!617 = !DILocation(line: 691, column: 3, scope: !70)
!618 = !DILocation(line: 695, column: 3, scope: !70)
!619 = !DILocation(line: 696, column: 1, scope: !70)
!620 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !71, file: !71, line: 836, type: !621, scopeLine: 837, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !76)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !74}
!623 = !DILocalVariable(name: "program", arg: 1, scope: !620, file: !71, line: 836, type: !74)
!624 = !DILocation(line: 836, column: 34, scope: !620)
!625 = !DILocalVariable(name: "infomap", scope: !620, file: !71, line: 838, type: !626)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 896, elements: !87)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !620, file: !71, line: 838, size: 128, elements: !629)
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !628, file: !71, line: 838, baseType: !74, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !628, file: !71, line: 838, baseType: !74, size: 64, offset: 64)
!632 = !DILocation(line: 838, column: 67, scope: !620)
!633 = !DILocalVariable(name: "node", scope: !620, file: !71, line: 848, type: !74)
!634 = !DILocation(line: 848, column: 15, scope: !620)
!635 = !DILocation(line: 848, column: 22, scope: !620)
!636 = !DILocalVariable(name: "map_prog", scope: !620, file: !71, line: 849, type: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!638 = !DILocation(line: 849, column: 25, scope: !620)
!639 = !DILocation(line: 849, column: 36, scope: !620)
!640 = !DILocation(line: 851, column: 3, scope: !620)
!641 = !DILocation(line: 851, column: 10, scope: !620)
!642 = !DILocation(line: 851, column: 20, scope: !620)
!643 = !DILocation(line: 851, column: 28, scope: !620)
!644 = !DILocation(line: 851, column: 40, scope: !620)
!645 = !DILocation(line: 851, column: 49, scope: !620)
!646 = !DILocation(line: 851, column: 59, scope: !620)
!647 = !DILocation(line: 851, column: 33, scope: !620)
!648 = !DILocation(line: 851, column: 31, scope: !620)
!649 = !DILocation(line: 0, scope: !620)
!650 = !DILocation(line: 852, column: 13, scope: !620)
!651 = distinct !{!651, !640, !650, !504}
!652 = !DILocation(line: 854, column: 7, scope: !653)
!653 = distinct !DILexicalBlock(scope: !620, file: !71, line: 854, column: 7)
!654 = !DILocation(line: 854, column: 17, scope: !653)
!655 = !DILocation(line: 854, column: 7, scope: !620)
!656 = !DILocation(line: 855, column: 12, scope: !653)
!657 = !DILocation(line: 855, column: 22, scope: !653)
!658 = !DILocation(line: 855, column: 10, scope: !653)
!659 = !DILocation(line: 855, column: 5, scope: !653)
!660 = !DILocation(line: 857, column: 3, scope: !620)
!661 = !DILocalVariable(name: "lc_messages", scope: !620, file: !71, line: 861, type: !74)
!662 = !DILocation(line: 861, column: 15, scope: !620)
!663 = !DILocation(line: 861, column: 29, scope: !620)
!664 = !DILocation(line: 862, column: 7, scope: !665)
!665 = distinct !DILexicalBlock(scope: !620, file: !71, line: 862, column: 7)
!666 = !DILocation(line: 862, column: 19, scope: !665)
!667 = !DILocation(line: 862, column: 22, scope: !665)
!668 = !DILocation(line: 862, column: 7, scope: !620)
!669 = !DILocation(line: 868, column: 7, scope: !670)
!670 = distinct !DILexicalBlock(scope: !665, file: !71, line: 863, column: 5)
!671 = !DILocation(line: 870, column: 5, scope: !670)
!672 = !DILocalVariable(name: "url_program", scope: !620, file: !71, line: 874, type: !74)
!673 = !DILocation(line: 874, column: 15, scope: !620)
!674 = !DILocation(line: 874, column: 36, scope: !620)
!675 = !DILocation(line: 874, column: 29, scope: !620)
!676 = !DILocation(line: 874, column: 61, scope: !620)
!677 = !DILocation(line: 875, column: 11, scope: !620)
!678 = !DILocation(line: 876, column: 24, scope: !620)
!679 = !DILocation(line: 875, column: 3, scope: !620)
!680 = !DILocation(line: 877, column: 11, scope: !620)
!681 = !DILocation(line: 878, column: 11, scope: !620)
!682 = !DILocation(line: 878, column: 17, scope: !620)
!683 = !DILocation(line: 878, column: 25, scope: !620)
!684 = !DILocation(line: 878, column: 22, scope: !620)
!685 = !DILocation(line: 877, column: 3, scope: !620)
!686 = !DILocation(line: 879, column: 1, scope: !620)
!687 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 202, type: !688, scopeLine: 203, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !76)
!688 = !DISubroutineType(types: !689)
!689 = !{!44, !44, !690}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!691 = !DILocalVariable(name: "argc", arg: 1, scope: !687, file: !3, line: 202, type: !44)
!692 = !DILocation(line: 202, column: 11, scope: !687)
!693 = !DILocalVariable(name: "argv", arg: 2, scope: !687, file: !3, line: 202, type: !690)
!694 = !DILocation(line: 202, column: 24, scope: !687)
!695 = !DILocalVariable(name: "specified_mode", scope: !687, file: !3, line: 204, type: !74)
!696 = !DILocation(line: 204, column: 15, scope: !687)
!697 = !DILocalVariable(name: "optc", scope: !687, file: !3, line: 205, type: !44)
!698 = !DILocation(line: 205, column: 7, scope: !687)
!699 = !DILocalVariable(name: "scontext", scope: !687, file: !3, line: 206, type: !74)
!700 = !DILocation(line: 206, column: 15, scope: !687)
!701 = !DILocalVariable(name: "options", scope: !687, file: !3, line: 207, type: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mkdir_options", file: !3, line: 95, size: 320, elements: !703)
!703 = !{!704, !708, !709, !710, !711, !712, !716}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "make_ancestor_function", scope: !702, file: !3, line: 99, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!44, !74, !74, !61}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "umask_ancestor", scope: !702, file: !3, line: 102, baseType: !373, size: 32, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "umask_self", scope: !702, file: !3, line: 105, baseType: !373, size: 32, offset: 96)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !702, file: !3, line: 108, baseType: !373, size: 32, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "mode_bits", scope: !702, file: !3, line: 111, baseType: !373, size: 32, offset: 160)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !702, file: !3, line: 114, baseType: !713, size: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "selabel_handle", file: !715, line: 53, flags: DIFlagFwdDecl)
!715 = !DIFile(filename: "./lib/selinux/label.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a430a70cff1d2c3fd1539e29c9e5e879")
!716 = !DIDerivedType(tag: DW_TAG_member, name: "created_directory_format", scope: !702, file: !3, line: 117, baseType: !74, size: 64, offset: 256)
!717 = !DILocation(line: 207, column: 24, scope: !687)
!718 = !DILocation(line: 209, column: 11, scope: !687)
!719 = !DILocation(line: 209, column: 34, scope: !687)
!720 = !DILocation(line: 210, column: 11, scope: !687)
!721 = !DILocation(line: 210, column: 16, scope: !687)
!722 = !DILocation(line: 211, column: 11, scope: !687)
!723 = !DILocation(line: 211, column: 21, scope: !687)
!724 = !DILocation(line: 212, column: 11, scope: !687)
!725 = !DILocation(line: 212, column: 36, scope: !687)
!726 = !DILocation(line: 213, column: 11, scope: !687)
!727 = !DILocation(line: 213, column: 32, scope: !687)
!728 = !DILocation(line: 216, column: 21, scope: !687)
!729 = !DILocation(line: 216, column: 3, scope: !687)
!730 = !DILocation(line: 217, column: 3, scope: !687)
!731 = !DILocation(line: 218, column: 3, scope: !687)
!732 = !DILocation(line: 219, column: 3, scope: !687)
!733 = !DILocation(line: 221, column: 3, scope: !687)
!734 = !DILocation(line: 223, column: 3, scope: !687)
!735 = !DILocation(line: 223, column: 31, scope: !687)
!736 = !DILocation(line: 223, column: 37, scope: !687)
!737 = !DILocation(line: 223, column: 18, scope: !687)
!738 = !DILocation(line: 223, column: 16, scope: !687)
!739 = !DILocation(line: 223, column: 69, scope: !687)
!740 = !DILocation(line: 225, column: 15, scope: !741)
!741 = distinct !DILexicalBlock(scope: !687, file: !3, line: 224, column: 5)
!742 = !DILocation(line: 225, column: 7, scope: !741)
!743 = !DILocation(line: 228, column: 19, scope: !744)
!744 = distinct !DILexicalBlock(scope: !741, file: !3, line: 226, column: 9)
!745 = !DILocation(line: 228, column: 42, scope: !744)
!746 = !DILocation(line: 229, column: 11, scope: !744)
!747 = !DILocation(line: 231, column: 28, scope: !744)
!748 = !DILocation(line: 231, column: 26, scope: !744)
!749 = !DILocation(line: 232, column: 11, scope: !744)
!750 = !DILocation(line: 234, column: 46, scope: !744)
!751 = !DILocation(line: 234, column: 19, scope: !744)
!752 = !DILocation(line: 234, column: 44, scope: !744)
!753 = !DILocation(line: 235, column: 11, scope: !744)
!754 = !DILocation(line: 237, column: 15, scope: !755)
!755 = distinct !DILexicalBlock(scope: !744, file: !3, line: 237, column: 15)
!756 = !DILocation(line: 237, column: 15, scope: !744)
!757 = !DILocation(line: 240, column: 26, scope: !758)
!758 = distinct !DILexicalBlock(scope: !755, file: !3, line: 238, column: 13)
!759 = !DILocation(line: 240, column: 24, scope: !758)
!760 = !DILocation(line: 241, column: 13, scope: !758)
!761 = !DILocation(line: 254, column: 20, scope: !762)
!762 = distinct !DILexicalBlock(scope: !763, file: !3, line: 254, column: 20)
!763 = distinct !DILexicalBlock(scope: !755, file: !3, line: 242, column: 20)
!764 = !DILocation(line: 254, column: 20, scope: !763)
!765 = !DILocation(line: 256, column: 15, scope: !766)
!766 = distinct !DILexicalBlock(scope: !762, file: !3, line: 255, column: 13)
!767 = !DILocation(line: 259, column: 13, scope: !766)
!768 = !DILocation(line: 260, column: 11, scope: !744)
!769 = !DILocation(line: 261, column: 9, scope: !744)
!770 = !DILocation(line: 262, column: 9, scope: !744)
!771 = !DILocation(line: 264, column: 11, scope: !744)
!772 = distinct !{!772, !734, !773, !504}
!773 = !DILocation(line: 266, column: 5, scope: !687)
!774 = !DILocation(line: 268, column: 7, scope: !775)
!775 = distinct !DILexicalBlock(scope: !687, file: !3, line: 268, column: 7)
!776 = !DILocation(line: 268, column: 17, scope: !775)
!777 = !DILocation(line: 268, column: 14, scope: !775)
!778 = !DILocation(line: 268, column: 7, scope: !687)
!779 = !DILocation(line: 270, column: 7, scope: !780)
!780 = distinct !DILexicalBlock(scope: !775, file: !3, line: 269, column: 5)
!781 = !DILocation(line: 271, column: 7, scope: !780)
!782 = !DILocation(line: 277, column: 7, scope: !783)
!783 = distinct !DILexicalBlock(scope: !687, file: !3, line: 277, column: 7)
!784 = !DILocation(line: 277, column: 7, scope: !687)
!785 = !DILocalVariable(name: "ret", scope: !786, file: !3, line: 279, type: !44)
!786 = distinct !DILexicalBlock(scope: !783, file: !3, line: 278, column: 5)
!787 = !DILocation(line: 279, column: 11, scope: !786)
!788 = !DILocation(line: 280, column: 11, scope: !789)
!789 = distinct !DILexicalBlock(scope: !786, file: !3, line: 280, column: 11)
!790 = !DILocation(line: 280, column: 11, scope: !786)
!791 = !DILocation(line: 281, column: 41, scope: !789)
!792 = !DILocation(line: 281, column: 15, scope: !789)
!793 = !DILocation(line: 281, column: 13, scope: !789)
!794 = !DILocation(line: 281, column: 9, scope: !789)
!795 = !DILocation(line: 283, column: 31, scope: !789)
!796 = !DILocation(line: 283, column: 15, scope: !789)
!797 = !DILocation(line: 283, column: 13, scope: !789)
!798 = !DILocation(line: 285, column: 11, scope: !799)
!799 = distinct !DILexicalBlock(scope: !786, file: !3, line: 285, column: 11)
!800 = !DILocation(line: 285, column: 15, scope: !799)
!801 = !DILocation(line: 285, column: 11, scope: !786)
!802 = !DILocation(line: 286, column: 9, scope: !799)
!803 = !DILocation(line: 289, column: 5, scope: !786)
!804 = !DILocation(line: 292, column: 15, scope: !805)
!805 = distinct !DILexicalBlock(scope: !687, file: !3, line: 292, column: 7)
!806 = !DILocation(line: 292, column: 7, scope: !805)
!807 = !DILocation(line: 292, column: 38, scope: !805)
!808 = !DILocation(line: 292, column: 41, scope: !805)
!809 = !DILocation(line: 292, column: 7, scope: !687)
!810 = !DILocalVariable(name: "umask_value", scope: !811, file: !3, line: 294, type: !373)
!811 = distinct !DILexicalBlock(scope: !805, file: !3, line: 293, column: 5)
!812 = !DILocation(line: 294, column: 14, scope: !811)
!813 = !DILocation(line: 294, column: 28, scope: !811)
!814 = !DILocation(line: 295, column: 32, scope: !811)
!815 = !DILocation(line: 295, column: 44, scope: !811)
!816 = !DILocation(line: 295, column: 15, scope: !811)
!817 = !DILocation(line: 295, column: 30, scope: !811)
!818 = !DILocation(line: 297, column: 11, scope: !819)
!819 = distinct !DILexicalBlock(scope: !811, file: !3, line: 297, column: 11)
!820 = !DILocation(line: 297, column: 11, scope: !811)
!821 = !DILocalVariable(name: "change", scope: !822, file: !3, line: 299, type: !823)
!822 = distinct !DILexicalBlock(scope: !819, file: !3, line: 298, column: 9)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !825, line: 35, flags: DIFlagFwdDecl)
!825 = !DIFile(filename: "./lib/modechange.h", directory: "/src", checksumkind: CSK_MD5, checksum: "41f2efe3cfeccb00721320834728c24b")
!826 = !DILocation(line: 299, column: 31, scope: !822)
!827 = !DILocation(line: 299, column: 54, scope: !822)
!828 = !DILocation(line: 299, column: 40, scope: !822)
!829 = !DILocation(line: 300, column: 16, scope: !830)
!830 = distinct !DILexicalBlock(scope: !822, file: !3, line: 300, column: 15)
!831 = !DILocation(line: 300, column: 15, scope: !822)
!832 = !DILocation(line: 301, column: 13, scope: !830)
!833 = !DILocation(line: 303, column: 56, scope: !822)
!834 = !DILocation(line: 303, column: 69, scope: !822)
!835 = !DILocation(line: 304, column: 48, scope: !822)
!836 = !DILocation(line: 303, column: 26, scope: !822)
!837 = !DILocation(line: 303, column: 19, scope: !822)
!838 = !DILocation(line: 303, column: 24, scope: !822)
!839 = !DILocation(line: 305, column: 32, scope: !822)
!840 = !DILocation(line: 305, column: 55, scope: !822)
!841 = !DILocation(line: 305, column: 46, scope: !822)
!842 = !DILocation(line: 305, column: 44, scope: !822)
!843 = !DILocation(line: 305, column: 19, scope: !822)
!844 = !DILocation(line: 305, column: 30, scope: !822)
!845 = !DILocation(line: 306, column: 17, scope: !822)
!846 = !DILocation(line: 306, column: 11, scope: !822)
!847 = !DILocation(line: 307, column: 9, scope: !822)
!848 = !DILocation(line: 310, column: 19, scope: !849)
!849 = distinct !DILexicalBlock(scope: !819, file: !3, line: 309, column: 9)
!850 = !DILocation(line: 310, column: 24, scope: !849)
!851 = !DILocation(line: 311, column: 32, scope: !849)
!852 = !DILocation(line: 311, column: 19, scope: !849)
!853 = !DILocation(line: 311, column: 30, scope: !849)
!854 = !DILocation(line: 314, column: 22, scope: !811)
!855 = !DILocation(line: 314, column: 7, scope: !811)
!856 = !DILocation(line: 315, column: 5, scope: !811)
!857 = !DILocation(line: 317, column: 32, scope: !687)
!858 = !DILocation(line: 317, column: 39, scope: !687)
!859 = !DILocation(line: 317, column: 37, scope: !687)
!860 = !DILocation(line: 317, column: 47, scope: !687)
!861 = !DILocation(line: 317, column: 54, scope: !687)
!862 = !DILocation(line: 317, column: 52, scope: !687)
!863 = !DILocation(line: 318, column: 45, scope: !687)
!864 = !DILocation(line: 317, column: 10, scope: !687)
!865 = !DILocation(line: 317, column: 3, scope: !687)
!866 = distinct !DISubprogram(name: "make_ancestor", scope: !3, file: !3, line: 135, type: !706, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !76)
!867 = !DILocalVariable(name: "dir", arg: 1, scope: !866, file: !3, line: 135, type: !74)
!868 = !DILocation(line: 135, column: 28, scope: !866)
!869 = !DILocalVariable(name: "component", arg: 2, scope: !866, file: !3, line: 135, type: !74)
!870 = !DILocation(line: 135, column: 45, scope: !866)
!871 = !DILocalVariable(name: "options", arg: 3, scope: !866, file: !3, line: 135, type: !61)
!872 = !DILocation(line: 135, column: 62, scope: !866)
!873 = !DILocalVariable(name: "o", scope: !866, file: !3, line: 137, type: !874)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !702)
!876 = !DILocation(line: 137, column: 31, scope: !866)
!877 = !DILocation(line: 137, column: 35, scope: !866)
!878 = !DILocation(line: 139, column: 7, scope: !879)
!879 = distinct !DILexicalBlock(scope: !866, file: !3, line: 139, column: 7)
!880 = !DILocation(line: 139, column: 10, scope: !879)
!881 = !DILocation(line: 140, column: 7, scope: !879)
!882 = !DILocation(line: 140, column: 22, scope: !879)
!883 = !DILocation(line: 140, column: 25, scope: !879)
!884 = !DILocation(line: 140, column: 47, scope: !879)
!885 = !DILocation(line: 140, column: 10, scope: !879)
!886 = !DILocation(line: 140, column: 67, scope: !879)
!887 = !DILocation(line: 141, column: 7, scope: !879)
!888 = !DILocation(line: 141, column: 31, scope: !879)
!889 = !DILocation(line: 141, column: 12, scope: !879)
!890 = !DILocation(line: 139, column: 7, scope: !866)
!891 = !DILocation(line: 142, column: 5, scope: !879)
!892 = !DILocation(line: 145, column: 7, scope: !893)
!893 = distinct !DILexicalBlock(scope: !866, file: !3, line: 145, column: 7)
!894 = !DILocation(line: 145, column: 10, scope: !893)
!895 = !DILocation(line: 145, column: 28, scope: !893)
!896 = !DILocation(line: 145, column: 31, scope: !893)
!897 = !DILocation(line: 145, column: 25, scope: !893)
!898 = !DILocation(line: 145, column: 7, scope: !866)
!899 = !DILocation(line: 146, column: 12, scope: !893)
!900 = !DILocation(line: 146, column: 15, scope: !893)
!901 = !DILocation(line: 146, column: 5, scope: !893)
!902 = !DILocalVariable(name: "r", scope: !866, file: !3, line: 147, type: !44)
!903 = !DILocation(line: 147, column: 7, scope: !866)
!904 = !DILocation(line: 147, column: 18, scope: !866)
!905 = !DILocation(line: 147, column: 11, scope: !866)
!906 = !DILocation(line: 148, column: 7, scope: !907)
!907 = distinct !DILexicalBlock(scope: !866, file: !3, line: 148, column: 7)
!908 = !DILocation(line: 148, column: 10, scope: !907)
!909 = !DILocation(line: 148, column: 28, scope: !907)
!910 = !DILocation(line: 148, column: 31, scope: !907)
!911 = !DILocation(line: 148, column: 25, scope: !907)
!912 = !DILocation(line: 148, column: 7, scope: !866)
!913 = !DILocalVariable(name: "mkdir_errno", scope: !914, file: !3, line: 150, type: !44)
!914 = distinct !DILexicalBlock(scope: !907, file: !3, line: 149, column: 5)
!915 = !DILocation(line: 150, column: 11, scope: !914)
!916 = !DILocation(line: 150, column: 25, scope: !914)
!917 = !DILocation(line: 151, column: 14, scope: !914)
!918 = !DILocation(line: 151, column: 17, scope: !914)
!919 = !DILocation(line: 151, column: 7, scope: !914)
!920 = !DILocation(line: 152, column: 15, scope: !914)
!921 = !DILocation(line: 152, column: 7, scope: !914)
!922 = !DILocation(line: 152, column: 13, scope: !914)
!923 = !DILocation(line: 153, column: 5, scope: !914)
!924 = !DILocation(line: 154, column: 7, scope: !925)
!925 = distinct !DILexicalBlock(scope: !866, file: !3, line: 154, column: 7)
!926 = !DILocation(line: 154, column: 9, scope: !925)
!927 = !DILocation(line: 154, column: 7, scope: !866)
!928 = !DILocation(line: 156, column: 12, scope: !929)
!929 = distinct !DILexicalBlock(scope: !925, file: !3, line: 155, column: 5)
!930 = !DILocation(line: 156, column: 15, scope: !929)
!931 = !DILocation(line: 156, column: 30, scope: !929)
!932 = !DILocation(line: 156, column: 41, scope: !929)
!933 = !DILocation(line: 156, column: 9, scope: !929)
!934 = !DILocation(line: 157, column: 23, scope: !929)
!935 = !DILocation(line: 157, column: 28, scope: !929)
!936 = !DILocation(line: 157, column: 7, scope: !929)
!937 = !DILocation(line: 158, column: 5, scope: !929)
!938 = !DILocation(line: 159, column: 10, scope: !866)
!939 = !DILocation(line: 159, column: 3, scope: !866)
!940 = distinct !DISubprogram(name: "is_smack_enabled", scope: !941, file: !941, line: 37, type: !942, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !76)
!941 = !DIFile(filename: "./lib/smack.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f8a0c9df6e268b12bd40a2b1000b787d")
!942 = !DISubroutineType(types: !943)
!943 = !{!101}
!944 = !DILocation(line: 42, column: 3, scope: !940)
!945 = distinct !DISubprogram(name: "smack_set_label_for_self", scope: !941, file: !941, line: 30, type: !946, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !76)
!946 = !DISubroutineType(types: !947)
!947 = !{!44, !74}
!948 = !DILocalVariable(name: "label", arg: 1, scope: !945, file: !941, line: 30, type: !74)
!949 = !DILocation(line: 30, column: 52, scope: !945)
!950 = !DILocation(line: 32, column: 3, scope: !945)
!951 = distinct !DISubprogram(name: "process_dir", scope: !3, file: !3, line: 164, type: !952, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !76)
!952 = !DISubroutineType(types: !953)
!953 = !{!44, !59, !954, !61}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!955 = !DILocalVariable(name: "dir", arg: 1, scope: !951, file: !3, line: 164, type: !59)
!956 = !DILocation(line: 164, column: 20, scope: !951)
!957 = !DILocalVariable(name: "wd", arg: 2, scope: !951, file: !3, line: 164, type: !954)
!958 = !DILocation(line: 164, column: 40, scope: !951)
!959 = !DILocalVariable(name: "options", arg: 3, scope: !951, file: !3, line: 164, type: !61)
!960 = !DILocation(line: 164, column: 50, scope: !951)
!961 = !DILocalVariable(name: "o", scope: !951, file: !3, line: 166, type: !874)
!962 = !DILocation(line: 166, column: 31, scope: !951)
!963 = !DILocation(line: 166, column: 35, scope: !951)
!964 = !DILocation(line: 169, column: 7, scope: !965)
!965 = distinct !DILexicalBlock(scope: !951, file: !3, line: 169, column: 7)
!966 = !DILocation(line: 169, column: 10, scope: !965)
!967 = !DILocation(line: 169, column: 7, scope: !951)
!968 = !DILocation(line: 171, column: 13, scope: !969)
!969 = distinct !DILexicalBlock(scope: !970, file: !3, line: 171, column: 11)
!970 = distinct !DILexicalBlock(scope: !965, file: !3, line: 170, column: 5)
!971 = !DILocation(line: 171, column: 16, scope: !969)
!972 = !DILocation(line: 172, column: 11, scope: !969)
!973 = !DILocation(line: 172, column: 26, scope: !969)
!974 = !DILocation(line: 172, column: 29, scope: !969)
!975 = !DILocation(line: 172, column: 51, scope: !969)
!976 = !DILocation(line: 172, column: 14, scope: !969)
!977 = !DILocation(line: 172, column: 65, scope: !969)
!978 = !DILocation(line: 173, column: 11, scope: !969)
!979 = !DILocation(line: 173, column: 35, scope: !969)
!980 = !DILocation(line: 173, column: 16, scope: !969)
!981 = !DILocation(line: 171, column: 11, scope: !970)
!982 = !DILocation(line: 174, column: 9, scope: !969)
!983 = !DILocation(line: 176, column: 5, scope: !970)
!984 = !DILocalVariable(name: "ret", scope: !951, file: !3, line: 178, type: !44)
!985 = !DILocation(line: 178, column: 7, scope: !951)
!986 = !DILocation(line: 178, column: 32, scope: !951)
!987 = !DILocation(line: 178, column: 37, scope: !951)
!988 = !DILocation(line: 178, column: 41, scope: !951)
!989 = !DILocation(line: 178, column: 44, scope: !951)
!990 = !DILocation(line: 178, column: 68, scope: !951)
!991 = !DILocation(line: 179, column: 32, scope: !951)
!992 = !DILocation(line: 179, column: 35, scope: !951)
!993 = !DILocation(line: 180, column: 32, scope: !951)
!994 = !DILocation(line: 180, column: 35, scope: !951)
!995 = !DILocation(line: 178, column: 14, scope: !951)
!996 = !DILocation(line: 189, column: 7, scope: !997)
!997 = distinct !DILexicalBlock(scope: !951, file: !3, line: 189, column: 7)
!998 = !DILocation(line: 189, column: 11, scope: !997)
!999 = !DILocation(line: 189, column: 27, scope: !997)
!1000 = !DILocation(line: 189, column: 30, scope: !997)
!1001 = !DILocation(line: 189, column: 33, scope: !997)
!1002 = !DILocation(line: 190, column: 7, scope: !997)
!1003 = !DILocation(line: 190, column: 10, scope: !997)
!1004 = !DILocation(line: 190, column: 13, scope: !997)
!1005 = !DILocation(line: 189, column: 7, scope: !951)
!1006 = !DILocation(line: 192, column: 25, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 192, column: 11)
!1008 = distinct !DILexicalBlock(scope: !997, file: !3, line: 191, column: 5)
!1009 = !DILocation(line: 192, column: 28, scope: !1007)
!1010 = !DILocation(line: 192, column: 66, scope: !1007)
!1011 = !DILocation(line: 192, column: 50, scope: !1007)
!1012 = !DILocation(line: 192, column: 13, scope: !1007)
!1013 = !DILocation(line: 193, column: 11, scope: !1007)
!1014 = !DILocation(line: 193, column: 35, scope: !1007)
!1015 = !DILocation(line: 193, column: 16, scope: !1007)
!1016 = !DILocation(line: 192, column: 11, scope: !1008)
!1017 = !DILocation(line: 194, column: 9, scope: !1007)
!1018 = !DILocation(line: 196, column: 5, scope: !1008)
!1019 = !DILocation(line: 198, column: 10, scope: !951)
!1020 = !DILocation(line: 198, column: 3, scope: !951)
!1021 = distinct !DISubprogram(name: "defaultcon", scope: !1022, file: !1022, line: 49, type: !1023, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !76)
!1022 = !DIFile(filename: "src/selinux.h", directory: "/src", checksumkind: CSK_MD5, checksum: "13efa93c67c6cc8e1be8195655a2b752")
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!44, !713, !74, !373}
!1025 = !DILocalVariable(name: "selabel_handle", arg: 1, scope: !1021, file: !1022, line: 49, type: !713)
!1026 = !DILocation(line: 49, column: 49, scope: !1021)
!1027 = !DILocalVariable(name: "path", arg: 2, scope: !1021, file: !1022, line: 50, type: !74)
!1028 = !DILocation(line: 50, column: 38, scope: !1021)
!1029 = !DILocalVariable(name: "mode", arg: 3, scope: !1021, file: !1022, line: 50, type: !373)
!1030 = !DILocation(line: 50, column: 64, scope: !1021)
!1031 = !DILocation(line: 51, column: 3, scope: !1021)
!1032 = !DILocation(line: 51, column: 9, scope: !1021)
!1033 = !DILocation(line: 51, column: 20, scope: !1021)
!1034 = distinct !DISubprogram(name: "ignorable_ctx_err", scope: !1022, file: !1022, line: 27, type: !1035, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !76)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!101, !44}
!1037 = !DILocalVariable(name: "err", arg: 1, scope: !1034, file: !1022, line: 27, type: !44)
!1038 = !DILocation(line: 27, column: 24, scope: !1034)
!1039 = !DILocation(line: 29, column: 10, scope: !1034)
!1040 = !DILocation(line: 29, column: 14, scope: !1034)
!1041 = !DILocation(line: 29, column: 25, scope: !1034)
!1042 = !DILocation(line: 29, column: 28, scope: !1034)
!1043 = !DILocation(line: 29, column: 32, scope: !1034)
!1044 = !DILocation(line: 29, column: 3, scope: !1034)
!1045 = distinct !DISubprogram(name: "announce_mkdir", scope: !3, file: !3, line: 122, type: !1046, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !76)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{null, !74, !61}
!1048 = !DILocalVariable(name: "dir", arg: 1, scope: !1045, file: !3, line: 122, type: !74)
!1049 = !DILocation(line: 122, column: 29, scope: !1045)
!1050 = !DILocalVariable(name: "options", arg: 2, scope: !1045, file: !3, line: 122, type: !61)
!1051 = !DILocation(line: 122, column: 40, scope: !1045)
!1052 = !DILocalVariable(name: "o", scope: !1045, file: !3, line: 124, type: !874)
!1053 = !DILocation(line: 124, column: 31, scope: !1045)
!1054 = !DILocation(line: 124, column: 35, scope: !1045)
!1055 = !DILocation(line: 125, column: 7, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 125, column: 7)
!1057 = !DILocation(line: 125, column: 10, scope: !1056)
!1058 = !DILocation(line: 125, column: 7, scope: !1045)
!1059 = !DILocation(line: 126, column: 19, scope: !1056)
!1060 = !DILocation(line: 126, column: 27, scope: !1056)
!1061 = !DILocation(line: 126, column: 30, scope: !1056)
!1062 = !DILocation(line: 126, column: 56, scope: !1056)
!1063 = !DILocation(line: 126, column: 5, scope: !1056)
!1064 = !DILocation(line: 127, column: 1, scope: !1045)
!1065 = distinct !DISubprogram(name: "restorecon", scope: !1022, file: !1022, line: 44, type: !1066, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !76)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!101, !713, !74, !101}
!1068 = !DILocalVariable(name: "selabel_handle", arg: 1, scope: !1065, file: !1022, line: 44, type: !713)
!1069 = !DILocation(line: 44, column: 49, scope: !1065)
!1070 = !DILocalVariable(name: "path", arg: 2, scope: !1065, file: !1022, line: 45, type: !74)
!1071 = !DILocation(line: 45, column: 38, scope: !1065)
!1072 = !DILocalVariable(name: "recurse", arg: 3, scope: !1065, file: !1022, line: 45, type: !101)
!1073 = !DILocation(line: 45, column: 62, scope: !1065)
!1074 = !DILocation(line: 46, column: 3, scope: !1065)
!1075 = !DILocation(line: 46, column: 9, scope: !1065)
!1076 = !DILocation(line: 46, column: 20, scope: !1065)
!1077 = distinct !DISubprogram(name: "prog_fprintf", scope: !260, file: !260, line: 28, type: !1078, scopeLine: 29, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !259, retainedNodes: !76)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{null, !1080, !74, null}
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1082, line: 7, baseType: !1083)
!1082 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1084, line: 49, size: 1728, elements: !1085)
!1084 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!1085 = !{!1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1101, !1103, !1104, !1105, !1107, !1108, !1110, !1114, !1117, !1119, !1122, !1125, !1126, !1127, !1128, !1129}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1083, file: !1084, line: 51, baseType: !44, size: 32)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1083, file: !1084, line: 54, baseType: !59, size: 64, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1083, file: !1084, line: 55, baseType: !59, size: 64, offset: 128)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1083, file: !1084, line: 56, baseType: !59, size: 64, offset: 192)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1083, file: !1084, line: 57, baseType: !59, size: 64, offset: 256)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1083, file: !1084, line: 58, baseType: !59, size: 64, offset: 320)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1083, file: !1084, line: 59, baseType: !59, size: 64, offset: 384)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1083, file: !1084, line: 60, baseType: !59, size: 64, offset: 448)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1083, file: !1084, line: 61, baseType: !59, size: 64, offset: 512)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1083, file: !1084, line: 64, baseType: !59, size: 64, offset: 576)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1083, file: !1084, line: 65, baseType: !59, size: 64, offset: 640)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1083, file: !1084, line: 66, baseType: !59, size: 64, offset: 704)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1083, file: !1084, line: 68, baseType: !1099, size: 64, offset: 768)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1084, line: 36, flags: DIFlagFwdDecl)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1083, file: !1084, line: 70, baseType: !1102, size: 64, offset: 832)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1083, file: !1084, line: 72, baseType: !44, size: 32, offset: 896)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1083, file: !1084, line: 73, baseType: !44, size: 32, offset: 928)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1083, file: !1084, line: 74, baseType: !1106, size: 64, offset: 960)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !50, line: 152, baseType: !335)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1083, file: !1084, line: 77, baseType: !62, size: 16, offset: 1024)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1083, file: !1084, line: 78, baseType: !1109, size: 8, offset: 1040)
!1109 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1083, file: !1084, line: 79, baseType: !1111, size: 8, offset: 1048)
!1111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 8, elements: !1112)
!1112 = !{!1113}
!1113 = !DISubrange(count: 1)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1083, file: !1084, line: 81, baseType: !1115, size: 64, offset: 1088)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1084, line: 43, baseType: null)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1083, file: !1084, line: 89, baseType: !1118, size: 64, offset: 1152)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !50, line: 153, baseType: !335)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1083, file: !1084, line: 91, baseType: !1120, size: 64, offset: 1216)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1084, line: 37, flags: DIFlagFwdDecl)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1083, file: !1084, line: 92, baseType: !1123, size: 64, offset: 1280)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1084, line: 38, flags: DIFlagFwdDecl)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1083, file: !1084, line: 93, baseType: !1102, size: 64, offset: 1344)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1083, file: !1084, line: 94, baseType: !61, size: 64, offset: 1408)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1083, file: !1084, line: 95, baseType: !164, size: 64, offset: 1472)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1083, file: !1084, line: 96, baseType: !44, size: 32, offset: 1536)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1083, file: !1084, line: 98, baseType: !1130, size: 160, offset: 1568)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 160, elements: !1131)
!1131 = !{!1132}
!1132 = !DISubrange(count: 20)
!1133 = !DILocalVariable(name: "fp", arg: 1, scope: !1077, file: !260, line: 28, type: !1080)
!1134 = !DILocation(line: 28, column: 21, scope: !1077)
!1135 = !DILocalVariable(name: "fmt", arg: 2, scope: !1077, file: !260, line: 28, type: !74)
!1136 = !DILocation(line: 28, column: 37, scope: !1077)
!1137 = !DILocalVariable(name: "ap", scope: !1077, file: !260, line: 30, type: !1138)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !114, line: 52, baseType: !1139)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !116, line: 32, baseType: !1140)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1141, baseType: !1142)
!1141 = !DIFile(filename: "src/prog-fprintf.c", directory: "/src")
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !120, size: 256, elements: !1143)
!1143 = !{!1144, !1145, !1146, !1147, !1148}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1142, file: !1141, line: 30, baseType: !61, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1142, file: !1141, line: 30, baseType: !61, size: 64, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1142, file: !1141, line: 30, baseType: !61, size: 64, offset: 128)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1142, file: !1141, line: 30, baseType: !44, size: 32, offset: 192)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1142, file: !1141, line: 30, baseType: !44, size: 32, offset: 224)
!1149 = !DILocation(line: 30, column: 11, scope: !1077)
!1150 = !DILocation(line: 31, column: 3, scope: !1077)
!1151 = !DILocation(line: 32, column: 3, scope: !1077)
!1152 = !DILocation(line: 33, column: 3, scope: !1077)
!1153 = !DILocation(line: 34, column: 13, scope: !1077)
!1154 = !DILocation(line: 34, column: 17, scope: !1077)
!1155 = !DILocation(line: 34, column: 3, scope: !1077)
!1156 = !DILocation(line: 35, column: 3, scope: !1077)
!1157 = !DILocation(line: 36, column: 3, scope: !1077)
!1158 = !DILocation(line: 37, column: 1, scope: !1077)
!1159 = distinct !DISubprogram(name: "last_component", scope: !264, file: !264, line: 29, type: !1160, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !263, retainedNodes: !76)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!59, !74}
!1162 = !DILocalVariable(name: "name", arg: 1, scope: !1159, file: !264, line: 29, type: !74)
!1163 = !DILocation(line: 29, column: 29, scope: !1159)
!1164 = !DILocalVariable(name: "base", scope: !1159, file: !264, line: 31, type: !74)
!1165 = !DILocation(line: 31, column: 15, scope: !1159)
!1166 = !DILocation(line: 31, column: 22, scope: !1159)
!1167 = !DILocation(line: 31, column: 29, scope: !1159)
!1168 = !DILocation(line: 31, column: 27, scope: !1159)
!1169 = !DILocation(line: 32, column: 3, scope: !1159)
!1170 = !DILocation(line: 32, column: 10, scope: !1159)
!1171 = !DILocation(line: 33, column: 9, scope: !1159)
!1172 = distinct !{!1172, !1169, !1171, !504}
!1173 = !DILocalVariable(name: "last_was_slash", scope: !1159, file: !264, line: 35, type: !101)
!1174 = !DILocation(line: 35, column: 8, scope: !1159)
!1175 = !DILocalVariable(name: "p", scope: !1176, file: !264, line: 36, type: !74)
!1176 = distinct !DILexicalBlock(scope: !1159, file: !264, line: 36, column: 3)
!1177 = !DILocation(line: 36, column: 20, scope: !1176)
!1178 = !DILocation(line: 36, column: 24, scope: !1176)
!1179 = !DILocation(line: 36, column: 8, scope: !1176)
!1180 = !DILocation(line: 36, column: 31, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1176, file: !264, line: 36, column: 3)
!1182 = !DILocation(line: 36, column: 30, scope: !1181)
!1183 = !DILocation(line: 36, column: 3, scope: !1176)
!1184 = !DILocation(line: 38, column: 11, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1186, file: !264, line: 38, column: 11)
!1186 = distinct !DILexicalBlock(scope: !1181, file: !264, line: 37, column: 5)
!1187 = !DILocation(line: 38, column: 11, scope: !1186)
!1188 = !DILocation(line: 39, column: 24, scope: !1185)
!1189 = !DILocation(line: 39, column: 9, scope: !1185)
!1190 = !DILocation(line: 40, column: 16, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1185, file: !264, line: 40, column: 16)
!1192 = !DILocation(line: 40, column: 16, scope: !1185)
!1193 = !DILocation(line: 42, column: 18, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1191, file: !264, line: 41, column: 9)
!1195 = !DILocation(line: 42, column: 16, scope: !1194)
!1196 = !DILocation(line: 43, column: 26, scope: !1194)
!1197 = !DILocation(line: 44, column: 9, scope: !1194)
!1198 = !DILocation(line: 45, column: 5, scope: !1186)
!1199 = !DILocation(line: 36, column: 35, scope: !1181)
!1200 = !DILocation(line: 36, column: 3, scope: !1181)
!1201 = distinct !{!1201, !1183, !1202, !504}
!1202 = !DILocation(line: 45, column: 5, scope: !1176)
!1203 = !DILocation(line: 47, column: 19, scope: !1159)
!1204 = !DILocation(line: 47, column: 3, scope: !1159)
!1205 = distinct !DISubprogram(name: "base_len", scope: !264, file: !264, line: 51, type: !1206, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !263, retainedNodes: !76)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!164, !74}
!1208 = !DILocalVariable(name: "name", arg: 1, scope: !1205, file: !264, line: 51, type: !74)
!1209 = !DILocation(line: 51, column: 23, scope: !1205)
!1210 = !DILocalVariable(name: "len", scope: !1205, file: !264, line: 53, type: !164)
!1211 = !DILocation(line: 53, column: 10, scope: !1205)
!1212 = !DILocation(line: 54, column: 22, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1205, file: !264, line: 54, column: 3)
!1214 = !DILocation(line: 54, column: 14, scope: !1213)
!1215 = !DILocation(line: 54, column: 12, scope: !1213)
!1216 = !DILocation(line: 54, column: 8, scope: !1213)
!1217 = !DILocation(line: 54, column: 34, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1213, file: !264, line: 54, column: 3)
!1219 = !DILocation(line: 54, column: 32, scope: !1218)
!1220 = !DILocation(line: 54, column: 38, scope: !1218)
!1221 = !DILocation(line: 54, column: 41, scope: !1218)
!1222 = !DILocation(line: 0, scope: !1218)
!1223 = !DILocation(line: 54, column: 3, scope: !1213)
!1224 = !DILocation(line: 55, column: 5, scope: !1218)
!1225 = !DILocation(line: 54, column: 70, scope: !1218)
!1226 = !DILocation(line: 54, column: 3, scope: !1218)
!1227 = distinct !{!1227, !1223, !1228, !504}
!1228 = !DILocation(line: 55, column: 5, scope: !1213)
!1229 = !DILocalVariable(name: "prefix_len", scope: !1205, file: !264, line: 61, type: !164)
!1230 = !DILocation(line: 61, column: 10, scope: !1205)
!1231 = !DILocation(line: 61, column: 23, scope: !1205)
!1232 = !DILocation(line: 66, column: 10, scope: !1205)
!1233 = !DILocation(line: 66, column: 3, scope: !1205)
!1234 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !97, file: !97, line: 50, type: !621, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !96, retainedNodes: !76)
!1235 = !DILocalVariable(name: "file", arg: 1, scope: !1234, file: !97, line: 50, type: !74)
!1236 = !DILocation(line: 50, column: 41, scope: !1234)
!1237 = !DILocation(line: 52, column: 15, scope: !1234)
!1238 = !DILocation(line: 52, column: 13, scope: !1234)
!1239 = !DILocation(line: 53, column: 1, scope: !1234)
!1240 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !97, file: !97, line: 87, type: !1241, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !96, retainedNodes: !76)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{null, !101}
!1243 = !DILocalVariable(name: "ignore", arg: 1, scope: !1240, file: !97, line: 87, type: !101)
!1244 = !DILocation(line: 87, column: 37, scope: !1240)
!1245 = !DILocation(line: 89, column: 18, scope: !1240)
!1246 = !DILocation(line: 89, column: 16, scope: !1240)
!1247 = !DILocation(line: 90, column: 1, scope: !1240)
!1248 = distinct !DISubprogram(name: "close_stdout", scope: !97, file: !97, line: 116, type: !134, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !96, retainedNodes: !76)
