; ModuleID = 'src/rm.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon.54 }
%union.anon.54 = type { i32 }
%struct.rm_options = type { i8, i32, i8, i8, i8, %struct.dev_ino*, i8, i8, i8, i8 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [2 x i32] }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }

!6 = !DIFile(filename: "src/remove.h", directory: "/src", checksumkind: CSK_MD5, checksum: "fc0a0c88faec8481849ad8f08e777d96")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "RMI_ALWAYS", value: 3)
!10 = !DIEnumerator(name: "RMI_SOMETIMES", value: 4)
!11 = !DIEnumerator(name: "RMI_NEVER", value: 5)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "interactive_type", file: !3, line: 54, baseType: !7, size: 32, elements: !13)
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "interactive_never", value: 0)
!15 = !DIEnumerator(name: "interactive_once", value: 1)
!16 = !DIEnumerator(name: "interactive_always", value: 2)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !18, line: 42, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!20 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!21 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!22 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!23 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!24 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!25 = !DIEnumerator(name: "c_quoting_style", value: 5)
!26 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!27 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!28 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!29 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!30 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RM_status", file: !6, line: 78, baseType: !7, size: 32, elements: !32)
!32 = !{!33, !34, !35, !36, !37}
!33 = !DIEnumerator(name: "RM_OK", value: 2)
!34 = !DIEnumerator(name: "RM_USER_ACCEPTED", value: 3)
!35 = !DIEnumerator(name: "RM_USER_DECLINED", value: 4)
!36 = !DIEnumerator(name: "RM_ERROR", value: 5)
!37 = !DIEnumerator(name: "RM_NONEMPTY_DIR", value: 6)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 46, baseType: !7, size: 32, elements: !40)
!39 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!41 = !DIEnumerator(name: "_ISupper", value: 256)
!42 = !DIEnumerator(name: "_ISlower", value: 512)
!43 = !DIEnumerator(name: "_ISalpha", value: 1024)
!44 = !DIEnumerator(name: "_ISdigit", value: 2048)
!45 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!46 = !DIEnumerator(name: "_ISspace", value: 8192)
!47 = !DIEnumerator(name: "_ISprint", value: 16384)
!48 = !DIEnumerator(name: "_ISgraph", value: 32768)
!49 = !DIEnumerator(name: "_ISblank", value: 1)
!50 = !DIEnumerator(name: "_IScntrl", value: 2)
!51 = !DIEnumerator(name: "_ISpunct", value: 4)
!52 = !DIEnumerator(name: "_ISalnum", value: 8)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !55, file: !54, line: 209, baseType: !7, size: 32, elements: !64)
!54 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!55 = distinct !DISubprogram(name: "select_plural", scope: !54, file: !54, line: 205, type: !56, scopeLine: 206, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !63)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !59}
!58 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !60, line: 102, baseType: !61)
!60 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !62, line: 73, baseType: !58)
!62 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!63 = !{}
!64 = !{!65}
!65 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000)
!66 = !{!67, !69, !71, !72, !73}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!72 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!73 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!74 = !{!75, !91, !0, !98, !104}
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !77, file: !3, line: 368, type: !81, isLocal: true, isDefinition: true)
!77 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 234, type: !78, scopeLine: 235, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !63)
!78 = !DISubroutineType(types: !79)
!79 = !{!72, !72, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !82, line: 30, size: 128, elements: !83)
!82 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!83 = !{!84, !88}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !81, file: !82, line: 32, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !86, line: 47, baseType: !87)
!86 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !62, line: 148, baseType: !58)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !81, file: !82, line: 33, baseType: !89, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !86, line: 59, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !62, line: 145, baseType: !58)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !93, file: !54, line: 575, type: !72, isLocal: true, isDefinition: true)
!93 = distinct !DISubprogram(name: "oputs_", scope: !54, file: !54, line: 573, type: !94, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !63)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !96, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "interactive_types", scope: !2, file: !3, line: 90, type: !100, isLocal: true, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 192, elements: !102)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!102 = !{!103}
!103 = !DISubrange(count: 6)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "interactive_args", scope: !2, file: !3, line: 84, type: !106, isLocal: true, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 448, elements: !108)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!108 = !{!109}
!109 = !DISubrange(count: 7)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 3072, elements: !120)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !113, line: 50, size: 256, elements: !114)
!113 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!114 = !{!115, !116, !117, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !112, file: !113, line: 52, baseType: !96, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !112, file: !113, line: 55, baseType: !72, size: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !112, file: !113, line: 56, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !112, file: !113, line: 57, baseType: !72, size: 32, offset: 192)
!120 = !{!121}
!121 = !DISubrange(count: 12)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "Version", scope: !124, file: !125, line: 3, type: !96, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !126, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!126 = !{!122}
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !129, file: !130, line: 65, type: !134, isLocal: false, isDefinition: true)
!129 = distinct !DICompileUnit(language: DW_LANG_C99, file: !130, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !131, retainedTypes: !132, globals: !133, splitDebugInlining: false, nameTableKind: None)
!130 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!131 = !{!17}
!132 = !{!71, !96}
!133 = !{!127}
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !135, line: 69, baseType: !136)
!135 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{null}
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "file_name", scope: !141, file: !142, line: 36, type: !96, isLocal: true, isDefinition: true)
!141 = distinct !DICompileUnit(language: DW_LANG_C99, file: !142, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !143, splitDebugInlining: false, nameTableKind: None)
!142 = !DIFile(filename: "lib/closein.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9fec55e4ddd91bb874b8f9175b89c7e1")
!143 = !{!139}
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "file_name", scope: !146, file: !147, line: 45, type: !96, isLocal: true, isDefinition: true)
!146 = distinct !DICompileUnit(language: DW_LANG_C99, file: !147, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !148, splitDebugInlining: false, nameTableKind: None)
!147 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!148 = !{!144, !149}
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !146, file: !147, line: 55, type: !151, isLocal: true, isDefinition: true)
!151 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !154, file: !155, line: 66, type: !136, isLocal: false, isDefinition: true)
!154 = distinct !DICompileUnit(language: DW_LANG_C99, file: !155, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !156, globals: !157, splitDebugInlining: false, nameTableKind: None)
!155 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!156 = !{!71}
!157 = !{!158, !177, !152, !179, !181}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "old_file_name", scope: !160, file: !155, line: 304, type: !96, isLocal: true, isDefinition: true)
!160 = distinct !DISubprogram(name: "verror_at_line", scope: !155, file: !155, line: 298, type: !161, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !154, retainedNodes: !63)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !72, !72, !96, !7, !96, !163}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !164, line: 52, baseType: !165)
!164 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !166, line: 32, baseType: !167)
!166 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !168, baseType: !169)
!168 = !DIFile(filename: "lib/error.c", directory: "/src")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !170, size: 256, elements: !171)
!170 = !DINamespace(name: "std", scope: null)
!171 = !{!172, !173, !174, !175, !176}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !169, file: !168, baseType: !71, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !169, file: !168, baseType: !71, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !169, file: !168, baseType: !71, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !169, file: !168, baseType: !72, size: 32, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !169, file: !168, baseType: !72, size: 32, offset: 224)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "old_line_number", scope: !160, file: !155, line: 305, type: !7, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "error_message_count", scope: !154, file: !155, line: 69, type: !7, isLocal: false, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !154, file: !155, line: 295, type: !72, isLocal: false, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "default_tuning", scope: !185, file: !186, line: 134, type: !192, isLocal: true, isDefinition: true)
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !187, globals: !191, splitDebugInlining: false, nameTableKind: None)
!186 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!187 = !{!58, !71, !188, !189}
!188 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !190, line: 46, baseType: !58)
!190 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!191 = !{!183}
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !194, line: 52, baseType: !195)
!194 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !194, line: 40, size: 160, elements: !196)
!196 = !{!197, !198, !199, !200, !201}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !195, file: !194, line: 45, baseType: !188, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !195, file: !194, line: 46, baseType: !188, size: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !195, file: !194, line: 47, baseType: !188, size: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !195, file: !194, line: 48, baseType: !188, size: 32, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !195, file: !194, line: 49, baseType: !151, size: 8, offset: 128)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "program_name", scope: !204, file: !205, line: 31, type: !96, isLocal: false, isDefinition: true)
!204 = distinct !DICompileUnit(language: DW_LANG_C99, file: !205, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !206, globals: !207, splitDebugInlining: false, nameTableKind: None)
!205 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!206 = !{!69}
!207 = !{!202}
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "utf07FF", scope: !210, file: !211, line: 46, type: !216, isLocal: true, isDefinition: true)
!210 = distinct !DISubprogram(name: "proper_name_lite", scope: !211, file: !211, line: 38, type: !212, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !214, retainedNodes: !63)
!211 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!212 = !DISubroutineType(types: !213)
!213 = !{!96, !96, !96}
!214 = distinct !DICompileUnit(language: DW_LANG_C99, file: !211, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !215, splitDebugInlining: false, nameTableKind: None)
!215 = !{!208}
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 16, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 2)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !221, file: !222, line: 76, type: !275, isLocal: false, isDefinition: true)
!221 = distinct !DICompileUnit(language: DW_LANG_C99, file: !222, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !223, retainedTypes: !229, globals: !230, splitDebugInlining: false, nameTableKind: None)
!222 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!223 = !{!17, !224, !38}
!224 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !18, line: 254, baseType: !7, size: 32, elements: !225)
!225 = !{!226, !227, !228}
!226 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!227 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!228 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!229 = !{!72, !73, !189}
!230 = !{!219, !231, !237, !249, !251, !256, !264, !271, !273}
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !221, file: !222, line: 92, type: !233, isLocal: false, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 320, elements: !235)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!235 = !{!236}
!236 = !DISubrange(count: 10)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !221, file: !222, line: 1040, type: !239, isLocal: false, isDefinition: true)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !222, line: 56, size: 448, elements: !240)
!240 = !{!241, !242, !243, !247, !248}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !239, file: !222, line: 59, baseType: !17, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !239, file: !222, line: 62, baseType: !72, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !239, file: !222, line: 66, baseType: !244, size: 256, offset: 64)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 8)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !239, file: !222, line: 69, baseType: !96, size: 64, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !239, file: !222, line: 72, baseType: !96, size: 64, offset: 384)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !221, file: !222, line: 107, type: !239, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "slot0", scope: !221, file: !222, line: 831, type: !253, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 2048, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 256)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "quote", scope: !258, file: !222, line: 228, type: !261, isLocal: true, isDefinition: true)
!258 = distinct !DISubprogram(name: "gettext_quote", scope: !222, file: !222, line: 197, type: !259, scopeLine: 198, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !221, retainedNodes: !63)
!259 = !DISubroutineType(types: !260)
!260 = !{!96, !96, !17}
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 64, elements: !262)
!262 = !{!218, !263}
!263 = !DISubrange(count: 4)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "slotvec", scope: !221, file: !222, line: 834, type: !266, isLocal: true, isDefinition: true)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !222, line: 823, size: 128, elements: !268)
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !267, file: !222, line: 825, baseType: !189, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !267, file: !222, line: 826, baseType: !69, size: 64, offset: 64)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "nslots", scope: !221, file: !222, line: 832, type: !72, isLocal: true, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "slotvec0", scope: !221, file: !222, line: 833, type: !267, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 704, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 11)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !280, file: !281, line: 26, type: !283, isLocal: false, isDefinition: true)
!280 = distinct !DICompileUnit(language: DW_LANG_C99, file: !281, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !282, splitDebugInlining: false, nameTableKind: None)
!281 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!282 = !{!278}
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 376, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 47)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "initialized", scope: !288, file: !289, line: 41, type: !151, isLocal: true, isDefinition: true)
!288 = distinct !DISubprogram(name: "can_write_any_file", scope: !289, file: !289, line: 39, type: !290, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !292, retainedNodes: !63)
!289 = !DIFile(filename: "lib/write-any-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d0180a8dace2a19c551daec82ca064f9")
!290 = !DISubroutineType(types: !291)
!291 = !{!151}
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !289, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !293, splitDebugInlining: false, nameTableKind: None)
!293 = !{!286, !294}
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "can_write", scope: !288, file: !289, line: 42, type: !151, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "exit_failure", scope: !298, file: !299, line: 24, type: !301, isLocal: false, isDefinition: true)
!298 = distinct !DICompileUnit(language: DW_LANG_C99, file: !299, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !300, splitDebugInlining: false, nameTableKind: None)
!299 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!300 = !{!296}
!301 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !72)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !304, file: !305, line: 506, type: !72, isLocal: true, isDefinition: true)
!304 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !305, file: !305, line: 485, type: !306, scopeLine: 486, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !308, retainedNodes: !63)
!305 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!306 = !DISubroutineType(types: !307)
!307 = !{!72, !72, !72}
!308 = distinct !DICompileUnit(language: DW_LANG_C99, file: !305, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !309, splitDebugInlining: false, nameTableKind: None)
!309 = !{!302}
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "internal_state", scope: !312, file: !313, line: 97, type: !317, isLocal: true, isDefinition: true)
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !314, globals: !316, splitDebugInlining: false, nameTableKind: None)
!313 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!314 = !{!71, !189, !315}
!315 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!316 = !{!310}
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !318, line: 6, baseType: !319)
!318 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !320, line: 21, baseType: !321)
!320 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 13, size: 64, elements: !322)
!322 = !{!323, !324}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !321, file: !320, line: 15, baseType: !72, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !321, file: !320, line: 20, baseType: !325, size: 32, offset: 32)
!325 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !321, file: !320, line: 16, size: 32, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !325, file: !320, line: 18, baseType: !7, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !325, file: !320, line: 19, baseType: !329, size: 32)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 32, elements: !330)
!330 = !{!263}
!331 = distinct !DICompileUnit(language: DW_LANG_C99, file: !332, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !333, retainedTypes: !156, splitDebugInlining: false, nameTableKind: None)
!332 = !DIFile(filename: "src/remove.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5b44ba291ad4d7b78c5ea04d27ccb860")
!333 = !{!31, !5, !334, !17, !339, !343}
!334 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !54, line: 299, baseType: !72, size: 32, elements: !335)
!335 = !{!336, !337, !338}
!336 = !DIEnumerator(name: "DS_UNKNOWN", value: -2)
!337 = !DIEnumerator(name: "DS_EMPTY", value: -1)
!338 = !DIEnumerator(name: "DS_NONEMPTY", value: 0)
!339 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Prompt_action", file: !332, line: 38, baseType: !7, size: 32, elements: !340)
!340 = !{!341, !342}
!341 = !DIEnumerator(name: "PA_DESCEND_INTO_DIR", value: 2)
!342 = !DIEnumerator(name: "PA_REMOVE_DIR", value: 3)
!343 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !344, line: 97, baseType: !7, size: 32, elements: !345)
!344 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!345 = !{!346, !347, !348, !349, !350, !351, !352, !353, !354}
!346 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!347 = !DIEnumerator(name: "DT_FIFO", value: 1)
!348 = !DIEnumerator(name: "DT_CHR", value: 2)
!349 = !DIEnumerator(name: "DT_DIR", value: 4)
!350 = !DIEnumerator(name: "DT_BLK", value: 6)
!351 = !DIEnumerator(name: "DT_REG", value: 8)
!352 = !DIEnumerator(name: "DT_LNK", value: 10)
!353 = !DIEnumerator(name: "DT_SOCK", value: 12)
!354 = !DIEnumerator(name: "DT_WHT", value: 14)
!355 = distinct !DICompileUnit(language: DW_LANG_C99, file: !356, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !206, splitDebugInlining: false, nameTableKind: None)
!356 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!357 = distinct !DICompileUnit(language: DW_LANG_C99, file: !358, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !156, splitDebugInlining: false, nameTableKind: None)
!358 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!359 = distinct !DICompileUnit(language: DW_LANG_C99, file: !360, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!360 = !DIFile(filename: "lib/file-type.c", directory: "/src", checksumkind: CSK_MD5, checksum: "50015f77027750ae004026e1298a48e3")
!361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !362, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !156, splitDebugInlining: false, nameTableKind: None)
!362 = !DIFile(filename: "lib/filenamecat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a58f68c719d6eade07443f6349d1f193")
!363 = distinct !DICompileUnit(language: DW_LANG_C99, file: !364, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !156, splitDebugInlining: false, nameTableKind: None)
!364 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "19114c82e79ffcf16d6cc09933141d08")
!365 = distinct !DICompileUnit(language: DW_LANG_C99, file: !366, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!366 = !DIFile(filename: "lib/freadahead.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0335573db6cc583acb894a308e230b2b")
!367 = distinct !DICompileUnit(language: DW_LANG_C99, file: !368, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !156, splitDebugInlining: false, nameTableKind: None)
!368 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!369 = distinct !DICompileUnit(language: DW_LANG_C99, file: !370, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !371, retainedTypes: !516, splitDebugInlining: false, nameTableKind: None)
!370 = !DIFile(filename: "lib/fts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "790475fd5d16e5b9bfdbc337c34f4fa2")
!371 = !{!372, !376, !503, !506, !343, !510, !513}
!372 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !370, line: 159, baseType: !7, size: 32, elements: !373)
!373 = !{!374, !375}
!374 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!375 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !378, file: !377, line: 54, baseType: !7, size: 32, elements: !501)
!377 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/src", checksumkind: CSK_MD5, checksum: "270205dca4a7d3b7c2e61f5b3b63f3eb")
!378 = distinct !DISubprogram(name: "setup_dir", scope: !377, file: !377, line: 50, type: !379, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !369, retainedNodes: !63)
!379 = !DISubroutineType(types: !380)
!380 = !{!151, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !383, line: 233, baseType: !384)
!383 = !DIFile(filename: "./lib/fts_.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8acf5ffdd2781290912583d2be00a5f3")
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !383, line: 115, size: 1024, elements: !385)
!385 = !{!386, !454, !455, !457, !458, !459, !460, !461, !462, !463, !470, !471, !474, !490}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !384, file: !383, line: 116, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !383, line: 235, size: 1920, elements: !389)
!389 = !{!390, !391, !392, !393, !397, !399, !400, !401, !402, !403, !404, !405, !406, !408, !409, !410, !411, !412, !450}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !388, file: !383, line: 236, baseType: !387, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !388, file: !383, line: 237, baseType: !387, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !388, file: !383, line: 238, baseType: !387, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !388, file: !383, line: 239, baseType: !394, size: 64, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !344, line: 127, baseType: !396)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !344, line: 127, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !388, file: !383, line: 242, baseType: !398, size: 64, offset: 256)
!398 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !388, file: !383, line: 243, baseType: !71, size: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !388, file: !383, line: 244, baseType: !69, size: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !388, file: !383, line: 245, baseType: !69, size: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !388, file: !383, line: 246, baseType: !72, size: 32, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !388, file: !383, line: 247, baseType: !72, size: 32, offset: 544)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !388, file: !383, line: 248, baseType: !189, size: 64, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !388, file: !383, line: 250, baseType: !381, size: 64, offset: 640)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !388, file: !383, line: 254, baseType: !407, size: 64, offset: 704)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !190, line: 35, baseType: !398)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !388, file: !383, line: 256, baseType: !189, size: 64, offset: 768)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !388, file: !383, line: 272, baseType: !73, size: 16, offset: 832)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !388, file: !383, line: 276, baseType: !73, size: 16, offset: 848)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !388, file: !383, line: 282, baseType: !73, size: 16, offset: 864)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !388, file: !383, line: 284, baseType: !413, size: 1024, offset: 896)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 1024, elements: !448)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !415, line: 44, size: 1024, elements: !416)
!415 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!416 = !{!417, !418, !419, !421, !423, !425, !427, !428, !429, !431, !433, !434, !436, !444, !445, !446}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !414, file: !415, line: 46, baseType: !90, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !414, file: !415, line: 47, baseType: !87, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !414, file: !415, line: 48, baseType: !420, size: 32, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !62, line: 150, baseType: !7)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !414, file: !415, line: 49, baseType: !422, size: 32, offset: 160)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !62, line: 151, baseType: !7)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !414, file: !415, line: 50, baseType: !424, size: 32, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !62, line: 146, baseType: !7)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !414, file: !415, line: 51, baseType: !426, size: 32, offset: 224)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !62, line: 147, baseType: !7)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !414, file: !415, line: 52, baseType: !90, size: 64, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !414, file: !415, line: 53, baseType: !90, size: 64, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !414, file: !415, line: 54, baseType: !430, size: 64, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !62, line: 152, baseType: !398)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !414, file: !415, line: 55, baseType: !432, size: 32, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !62, line: 175, baseType: !72)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !414, file: !415, line: 56, baseType: !72, size: 32, offset: 480)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !414, file: !415, line: 57, baseType: !435, size: 64, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !62, line: 180, baseType: !398)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !414, file: !415, line: 65, baseType: !437, size: 128, offset: 576)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !438, line: 11, size: 128, elements: !439)
!438 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!439 = !{!440, !442}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !437, file: !438, line: 16, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !62, line: 160, baseType: !398)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !437, file: !438, line: 21, baseType: !443, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !62, line: 197, baseType: !398)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !414, file: !415, line: 66, baseType: !437, size: 128, offset: 704)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !414, file: !415, line: 67, baseType: !437, size: 128, offset: 832)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !414, file: !415, line: 79, baseType: !447, size: 64, offset: 960)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 64, elements: !217)
!448 = !{!449}
!449 = !DISubrange(count: 1)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !388, file: !383, line: 285, baseType: !451, offset: 1920)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: -1)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !384, file: !383, line: 117, baseType: !387, size: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !384, file: !383, line: 118, baseType: !456, size: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !384, file: !383, line: 119, baseType: !89, size: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !384, file: !383, line: 120, baseType: !69, size: 64, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !384, file: !383, line: 121, baseType: !72, size: 32, offset: 320)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !384, file: !383, line: 122, baseType: !72, size: 32, offset: 352)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !384, file: !383, line: 124, baseType: !189, size: 64, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !384, file: !383, line: 125, baseType: !189, size: 64, offset: 448)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !384, file: !383, line: 126, baseType: !464, size: 64, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!72, !467, !467}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !384, file: !383, line: 196, baseType: !72, size: 32, offset: 576)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !384, file: !383, line: 205, baseType: !472, size: 64, offset: 640)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !383, line: 205, flags: DIFlagFwdDecl)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !384, file: !383, line: 227, baseType: !475, size: 64, offset: 704)
!475 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !384, file: !383, line: 207, size: 64, elements: !476)
!476 = !{!477, !478}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !475, file: !383, line: 220, baseType: !472, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !475, file: !383, line: 226, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !481, line: 32, size: 256, elements: !482)
!481 = !DIFile(filename: "./lib/cycle-check.h", directory: "/src", checksumkind: CSK_MD5, checksum: "5b1b442060400da72f41cd561f8be0ce")
!482 = !{!483, !488, !489}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !480, file: !481, line: 34, baseType: !484, size: 128)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !82, line: 30, size: 128, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !484, file: !82, line: 32, baseType: !85, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !484, file: !82, line: 33, baseType: !89, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !480, file: !481, line: 35, baseType: !59, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !480, file: !481, line: 36, baseType: !72, size: 32, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !384, file: !383, line: 232, baseType: !491, size: 256, offset: 768)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !492, line: 47, baseType: !493)
!492 = !DIFile(filename: "./lib/i-ring.h", directory: "/src", checksumkind: CSK_MD5, checksum: "e5a837f066348a79b8b8c179c8da2a6d")
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !492, line: 39, size: 256, elements: !494)
!494 = !{!495, !497, !498, !499, !500}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !493, file: !492, line: 41, baseType: !496, size: 128)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 128, elements: !330)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !493, file: !492, line: 42, baseType: !72, size: 32, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !493, file: !492, line: 43, baseType: !7, size: 32, offset: 160)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !493, file: !492, line: 44, baseType: !7, size: 32, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !493, file: !492, line: 45, baseType: !151, size: 8, offset: 224)
!501 = !{!502}
!502 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31)
!503 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !370, line: 635, baseType: !7, size: 32, elements: !504)
!504 = !{!505}
!505 = !DIEnumerator(name: "MIN_DIR_NLINK", value: 2)
!506 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !370, line: 638, baseType: !7, size: 32, elements: !507)
!507 = !{!508, !509}
!508 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0)
!509 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1)
!510 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !370, line: 154, baseType: !7, size: 32, elements: !511)
!511 = !{!512}
!512 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000)
!513 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !370, line: 676, baseType: !7, size: 32, elements: !514)
!514 = !{!515}
!515 = !DIEnumerator(name: "DEV_TYPE_HT_INITIAL_SIZE", value: 13)
!516 = !{!71, !59, !517, !518, !521}
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !60, line: 90, baseType: !58)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!72, !67, !67}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !383, line: 286, baseType: !388)
!525 = distinct !DICompileUnit(language: DW_LANG_C99, file: !526, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!526 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !529, splitDebugInlining: false, nameTableKind: None)
!528 = !DIFile(filename: "lib/i-ring.c", directory: "/src", checksumkind: CSK_MD5, checksum: "581251246a0cdfeb716d0893ef103e1d")
!529 = !{!530}
!530 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !492, line: 28, baseType: !7, size: 32, elements: !531)
!531 = !{!532}
!532 = !DIEnumerator(name: "I_RING_SIZE", value: 4)
!533 = distinct !DICompileUnit(language: DW_LANG_C99, file: !534, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!534 = !DIFile(filename: "lib/memeq.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9bf299a5d27acbe732c4d2f0d9a2144a")
!535 = distinct !DICompileUnit(language: DW_LANG_C99, file: !536, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!536 = !DIFile(filename: "lib/next-prime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9e10a95d0a1244096fa4fe5ba361f714")
!537 = distinct !DICompileUnit(language: DW_LANG_C99, file: !538, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!538 = !DIFile(filename: "lib/openat-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "946ef6e8fdb1124c3d2ae8982ba6c16b")
!539 = distinct !DICompileUnit(language: DW_LANG_C99, file: !540, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!540 = !DIFile(filename: "lib/opendirat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9ae84c4c59278018f497b82d8ee5d941")
!541 = distinct !DICompileUnit(language: DW_LANG_C99, file: !542, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!542 = !DIFile(filename: "lib/priv-set.c", directory: "/src", checksumkind: CSK_MD5, checksum: "73cae01e9bacd765cb125fa3656f197c")
!543 = distinct !DICompileUnit(language: DW_LANG_C99, file: !544, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!544 = !DIFile(filename: "lib/realloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a76cd3b708f695a3bf546d626aa758d")
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !546, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !547, splitDebugInlining: false, nameTableKind: None)
!546 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!547 = !{!151, !58, !71}
!548 = distinct !DICompileUnit(language: DW_LANG_C99, file: !549, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!549 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b0632229108c1521929601778d55996f")
!550 = distinct !DICompileUnit(language: DW_LANG_C99, file: !551, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!551 = !DIFile(filename: "lib/streq.c", directory: "/src", checksumkind: CSK_MD5, checksum: "912b0bbb2168195104931254916871aa")
!552 = distinct !DICompileUnit(language: DW_LANG_C99, file: !553, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!553 = !DIFile(filename: "lib/fd-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12c3310fb811f6ed0e0fb7e99c1b995b")
!554 = distinct !DICompileUnit(language: DW_LANG_C99, file: !555, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !556, retainedTypes: !156, splitDebugInlining: false, nameTableKind: None)
!555 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!556 = !{!557}
!557 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !555, line: 40, baseType: !7, size: 32, elements: !558)
!558 = !{!559}
!559 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!560 = distinct !DICompileUnit(language: DW_LANG_C99, file: !561, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !562, retainedTypes: !577, splitDebugInlining: false, nameTableKind: None)
!561 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!562 = !{!563, !570}
!563 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !564, file: !561, line: 188, baseType: !7, size: 32, elements: !568)
!564 = distinct !DISubprogram(name: "x2nrealloc", scope: !561, file: !561, line: 176, type: !565, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !560, retainedNodes: !63)
!565 = !DISubroutineType(types: !566)
!566 = !{!71, !71, !567, !189}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!568 = !{!569}
!569 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!570 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !571, file: !561, line: 228, baseType: !7, size: 32, elements: !568)
!571 = distinct !DISubprogram(name: "xpalloc", scope: !561, file: !561, line: 223, type: !572, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !560, retainedNodes: !63)
!572 = !DISubroutineType(types: !573)
!573 = !{!71, !71, !574, !575, !407, !575}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !576, line: 130, baseType: !407)
!576 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!577 = !{!69, !71, !151, !398, !58}
!578 = distinct !DICompileUnit(language: DW_LANG_C99, file: !579, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!579 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!580 = distinct !DICompileUnit(language: DW_LANG_C99, file: !581, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !156, splitDebugInlining: false, nameTableKind: None)
!581 = !DIFile(filename: "lib/xfts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84bc35d35364cd7c760cb21288203f20")
!582 = distinct !DICompileUnit(language: DW_LANG_C99, file: !583, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!583 = !DIFile(filename: "lib/yesno.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f502cb9314a0b73fa3879d5bf878f96f")
!584 = distinct !DICompileUnit(language: DW_LANG_C99, file: !585, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !586, splitDebugInlining: false, nameTableKind: None)
!585 = !DIFile(filename: "lib/bitrotate.c", directory: "/src", checksumkind: CSK_MD5, checksum: "447ab96324f6b3138fedae3f998f2539")
!586 = !{!7}
!587 = distinct !DICompileUnit(language: DW_LANG_C99, file: !588, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!588 = !DIFile(filename: "lib/c-file-type.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a3dfce754b72420a39e7e891cf0b31be")
!589 = distinct !DICompileUnit(language: DW_LANG_C99, file: !590, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!590 = !DIFile(filename: "lib/c32isprint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aac58442c7952a27a6ecb1773b2ef569")
!591 = distinct !DICompileUnit(language: DW_LANG_C99, file: !592, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!592 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!593 = distinct !DICompileUnit(language: DW_LANG_C99, file: !594, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!594 = !DIFile(filename: "lib/cycle-check.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9029e4490609d8d0ac3188f897240e9")
!595 = distinct !DICompileUnit(language: DW_LANG_C99, file: !596, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!596 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!597 = distinct !DICompileUnit(language: DW_LANG_C99, file: !598, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!598 = !DIFile(filename: "lib/open-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84efcad54206a8ffedf254f32134ee9c")
!599 = distinct !DICompileUnit(language: DW_LANG_C99, file: !600, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !156, splitDebugInlining: false, nameTableKind: None)
!600 = !DIFile(filename: "lib/ialloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e1d85861a0099c22cc583b5eb5f30423")
!601 = distinct !DICompileUnit(language: DW_LANG_C99, file: !602, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!602 = !DIFile(filename: "lib/mbszero.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1b51b91fccd359a867925f7b0fc988a4")
!603 = distinct !DICompileUnit(language: DW_LANG_C99, file: !604, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!604 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!605 = distinct !DICompileUnit(language: DW_LANG_C99, file: !606, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!606 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!607 = distinct !DICompileUnit(language: DW_LANG_C99, file: !608, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!608 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!609 = distinct !DICompileUnit(language: DW_LANG_C99, file: !610, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !156, splitDebugInlining: false, nameTableKind: None)
!610 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!611 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!612 = !{i32 7, !"Dwarf Version", i32 5}
!613 = !{i32 2, !"Debug Info Version", i32 3}
!614 = !{i32 1, !"wchar_size", i32 4}
!615 = !{i32 1, !"branch-target-enforcement", i32 0}
!616 = !{i32 1, !"sign-return-address", i32 0}
!617 = !{i32 1, !"sign-return-address-all", i32 0}
!618 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!619 = !{i32 7, !"PIC Level", i32 2}
!620 = !{i32 7, !"PIE Level", i32 2}
!621 = !{i32 7, !"uwtable", i32 1}
!622 = !{i32 7, !"frame-pointer", i32 1}
!623 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 125, type: !624, scopeLine: 126, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !63)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !72}
!626 = !DILocalVariable(name: "status", arg: 1, scope: !623, file: !3, line: 125, type: !72)
!627 = !DILocation(line: 125, column: 12, scope: !623)
!628 = !DILocation(line: 127, column: 7, scope: !629)
!629 = distinct !DILexicalBlock(scope: !623, file: !3, line: 127, column: 7)
!630 = !DILocation(line: 127, column: 14, scope: !629)
!631 = !DILocation(line: 127, column: 7, scope: !623)
!632 = !DILocation(line: 128, column: 5, scope: !629)
!633 = !DILocation(line: 128, column: 5, scope: !634)
!634 = distinct !DILexicalBlock(scope: !629, file: !3, line: 128, column: 5)
!635 = !DILocation(line: 131, column: 15, scope: !636)
!636 = distinct !DILexicalBlock(scope: !629, file: !3, line: 130, column: 5)
!637 = !DILocation(line: 131, column: 55, scope: !636)
!638 = !DILocation(line: 131, column: 7, scope: !636)
!639 = !DILocation(line: 132, column: 7, scope: !636)
!640 = !DILocation(line: 136, column: 7, scope: !636)
!641 = !DILocation(line: 140, column: 7, scope: !636)
!642 = !DILocation(line: 144, column: 7, scope: !636)
!643 = !DILocation(line: 150, column: 7, scope: !636)
!644 = !DILocation(line: 155, column: 7, scope: !636)
!645 = !DILocation(line: 161, column: 7, scope: !636)
!646 = !DILocation(line: 165, column: 7, scope: !636)
!647 = !DILocation(line: 171, column: 7, scope: !636)
!648 = !DILocation(line: 175, column: 7, scope: !636)
!649 = !DILocation(line: 179, column: 7, scope: !636)
!650 = !DILocation(line: 183, column: 7, scope: !636)
!651 = !DILocation(line: 184, column: 7, scope: !636)
!652 = !DILocation(line: 185, column: 7, scope: !636)
!653 = !DILocation(line: 190, column: 7, scope: !636)
!654 = !DILocation(line: 195, column: 15, scope: !636)
!655 = !DILocation(line: 203, column: 15, scope: !636)
!656 = !DILocation(line: 203, column: 29, scope: !636)
!657 = !DILocation(line: 195, column: 7, scope: !636)
!658 = !DILocation(line: 204, column: 7, scope: !636)
!659 = !DILocation(line: 210, column: 7, scope: !636)
!660 = !DILocation(line: 212, column: 9, scope: !623)
!661 = !DILocation(line: 212, column: 3, scope: !623)
!662 = !DILocalVariable(name: "program", arg: 1, scope: !93, file: !54, line: 573, type: !96)
!663 = !DILocation(line: 573, column: 34, scope: !93)
!664 = !DILocalVariable(name: "option", arg: 2, scope: !93, file: !54, line: 573, type: !96)
!665 = !DILocation(line: 573, column: 55, scope: !93)
!666 = !DILocation(line: 581, column: 7, scope: !667)
!667 = distinct !DILexicalBlock(scope: !93, file: !54, line: 581, column: 7)
!668 = !DILocation(line: 581, column: 19, scope: !667)
!669 = !DILocation(line: 581, column: 7, scope: !93)
!670 = !DILocalVariable(name: "term", scope: !671, file: !54, line: 585, type: !96)
!671 = distinct !DILexicalBlock(scope: !667, file: !54, line: 582, column: 5)
!672 = !DILocation(line: 585, column: 19, scope: !671)
!673 = !DILocation(line: 585, column: 26, scope: !671)
!674 = !DILocation(line: 586, column: 23, scope: !671)
!675 = !DILocation(line: 586, column: 28, scope: !671)
!676 = !DILocation(line: 586, column: 33, scope: !671)
!677 = !DILocation(line: 586, column: 32, scope: !671)
!678 = !DILocation(line: 586, column: 38, scope: !671)
!679 = !DILocation(line: 586, column: 48, scope: !671)
!680 = !DILocation(line: 586, column: 41, scope: !671)
!681 = !DILocation(line: 586, column: 19, scope: !671)
!682 = !DILocation(line: 587, column: 5, scope: !671)
!683 = !DILocation(line: 588, column: 7, scope: !684)
!684 = distinct !DILexicalBlock(scope: !93, file: !54, line: 588, column: 7)
!685 = !DILocation(line: 588, column: 7, scope: !93)
!686 = !DILocation(line: 590, column: 7, scope: !687)
!687 = distinct !DILexicalBlock(scope: !684, file: !54, line: 589, column: 5)
!688 = !DILocation(line: 591, column: 7, scope: !687)
!689 = !DILocalVariable(name: "double_space", scope: !93, file: !54, line: 594, type: !151)
!690 = !DILocation(line: 594, column: 8, scope: !93)
!691 = !DILocalVariable(name: "first_word", scope: !93, file: !54, line: 595, type: !96)
!692 = !DILocation(line: 595, column: 15, scope: !93)
!693 = !DILocation(line: 595, column: 28, scope: !93)
!694 = !DILocation(line: 595, column: 45, scope: !93)
!695 = !DILocation(line: 595, column: 37, scope: !93)
!696 = !DILocation(line: 595, column: 35, scope: !93)
!697 = !DILocalVariable(name: "option_text", scope: !93, file: !54, line: 596, type: !96)
!698 = !DILocation(line: 596, column: 15, scope: !93)
!699 = !DILocation(line: 596, column: 37, scope: !93)
!700 = !DILocation(line: 596, column: 29, scope: !93)
!701 = !DILocation(line: 597, column: 8, scope: !702)
!702 = distinct !DILexicalBlock(scope: !93, file: !54, line: 597, column: 7)
!703 = !DILocation(line: 597, column: 7, scope: !93)
!704 = !DILocation(line: 599, column: 21, scope: !705)
!705 = distinct !DILexicalBlock(scope: !702, file: !54, line: 598, column: 5)
!706 = !DILocation(line: 599, column: 19, scope: !705)
!707 = !DILocation(line: 602, column: 20, scope: !705)
!708 = !DILocation(line: 603, column: 5, scope: !705)
!709 = !DILocation(line: 604, column: 12, scope: !710)
!710 = distinct !DILexicalBlock(scope: !702, file: !54, line: 604, column: 12)
!711 = !DILocation(line: 604, column: 27, scope: !710)
!712 = !DILocation(line: 604, column: 24, scope: !710)
!713 = !DILocation(line: 604, column: 12, scope: !702)
!714 = !DILocalVariable(name: "s", scope: !715, file: !54, line: 608, type: !96)
!715 = distinct !DILexicalBlock(scope: !710, file: !54, line: 605, column: 5)
!716 = !DILocation(line: 608, column: 19, scope: !715)
!717 = !DILocation(line: 608, column: 23, scope: !715)
!718 = !DILocalVariable(name: "spaces", scope: !715, file: !54, line: 609, type: !189)
!719 = !DILocation(line: 609, column: 14, scope: !715)
!720 = !DILocation(line: 610, column: 7, scope: !715)
!721 = !DILocation(line: 610, column: 14, scope: !715)
!722 = !DILocation(line: 610, column: 18, scope: !715)
!723 = !DILocation(line: 610, column: 16, scope: !715)
!724 = !DILocation(line: 610, column: 30, scope: !715)
!725 = !DILocation(line: 610, column: 33, scope: !715)
!726 = !DILocation(line: 610, column: 40, scope: !715)
!727 = !DILocation(line: 0, scope: !715)
!728 = !DILocation(line: 611, column: 21, scope: !715)
!729 = !DILocation(line: 611, column: 20, scope: !715)
!730 = !DILocation(line: 611, column: 19, scope: !715)
!731 = !DILocation(line: 611, column: 16, scope: !715)
!732 = distinct !{!732, !720, !728, !733}
!733 = !{!"llvm.loop.mustprogress"}
!734 = !DILocation(line: 612, column: 11, scope: !735)
!735 = distinct !DILexicalBlock(scope: !715, file: !54, line: 612, column: 11)
!736 = !DILocation(line: 612, column: 18, scope: !735)
!737 = !DILocation(line: 612, column: 11, scope: !715)
!738 = !DILocation(line: 615, column: 25, scope: !739)
!739 = distinct !DILexicalBlock(scope: !735, file: !54, line: 613, column: 9)
!740 = !DILocation(line: 615, column: 23, scope: !739)
!741 = !DILocation(line: 616, column: 24, scope: !739)
!742 = !DILocation(line: 617, column: 9, scope: !739)
!743 = !DILocation(line: 618, column: 5, scope: !715)
!744 = !DILocalVariable(name: "anchor_len", scope: !93, file: !54, line: 620, type: !189)
!745 = !DILocation(line: 620, column: 10, scope: !93)
!746 = !DILocation(line: 620, column: 32, scope: !93)
!747 = !DILocation(line: 620, column: 23, scope: !93)
!748 = !DILocalVariable(name: "desc_text", scope: !93, file: !54, line: 625, type: !96)
!749 = !DILocation(line: 625, column: 15, scope: !93)
!750 = !DILocation(line: 625, column: 27, scope: !93)
!751 = !DILocation(line: 625, column: 41, scope: !93)
!752 = !DILocation(line: 625, column: 39, scope: !93)
!753 = !DILocation(line: 626, column: 3, scope: !93)
!754 = !DILocation(line: 626, column: 11, scope: !93)
!755 = !DILocation(line: 626, column: 10, scope: !93)
!756 = !DILocation(line: 626, column: 21, scope: !93)
!757 = !DILocation(line: 626, column: 25, scope: !93)
!758 = !DILocation(line: 626, column: 24, scope: !93)
!759 = !DILocation(line: 626, column: 35, scope: !93)
!760 = !DILocation(line: 0, scope: !93)
!761 = !DILocation(line: 628, column: 12, scope: !762)
!762 = distinct !DILexicalBlock(scope: !763, file: !54, line: 628, column: 11)
!763 = distinct !DILexicalBlock(scope: !93, file: !54, line: 627, column: 5)
!764 = !DILocation(line: 628, column: 11, scope: !762)
!765 = !DILocation(line: 628, column: 22, scope: !762)
!766 = !DILocation(line: 628, column: 29, scope: !762)
!767 = !DILocation(line: 628, column: 34, scope: !762)
!768 = !DILocation(line: 628, column: 44, scope: !762)
!769 = !DILocation(line: 628, column: 32, scope: !762)
!770 = !DILocation(line: 628, column: 49, scope: !762)
!771 = !DILocation(line: 628, column: 11, scope: !763)
!772 = !DILocation(line: 629, column: 22, scope: !762)
!773 = !DILocation(line: 629, column: 9, scope: !762)
!774 = !DILocation(line: 630, column: 11, scope: !775)
!775 = distinct !DILexicalBlock(scope: !763, file: !54, line: 630, column: 11)
!776 = !DILocation(line: 630, column: 11, scope: !763)
!777 = !DILocation(line: 632, column: 16, scope: !778)
!778 = distinct !DILexicalBlock(scope: !779, file: !54, line: 632, column: 15)
!779 = distinct !DILexicalBlock(scope: !775, file: !54, line: 631, column: 9)
!780 = !DILocation(line: 632, column: 15, scope: !778)
!781 = !DILocation(line: 632, column: 26, scope: !778)
!782 = !DILocation(line: 632, column: 34, scope: !778)
!783 = !DILocation(line: 632, column: 37, scope: !778)
!784 = !DILocation(line: 632, column: 15, scope: !779)
!785 = !DILocation(line: 633, column: 13, scope: !778)
!786 = !DILocation(line: 636, column: 16, scope: !787)
!787 = distinct !DILexicalBlock(scope: !779, file: !54, line: 636, column: 15)
!788 = !DILocation(line: 636, column: 29, scope: !787)
!789 = !DILocation(line: 636, column: 34, scope: !787)
!790 = !DILocation(line: 636, column: 44, scope: !787)
!791 = !DILocation(line: 636, column: 32, scope: !787)
!792 = !DILocation(line: 636, column: 49, scope: !787)
!793 = !DILocation(line: 636, column: 15, scope: !779)
!794 = !DILocation(line: 637, column: 13, scope: !787)
!795 = !DILocation(line: 638, column: 9, scope: !779)
!796 = !DILocation(line: 640, column: 16, scope: !763)
!797 = distinct !{!797, !753, !798, !733}
!798 = !DILocation(line: 641, column: 5, scope: !93)
!799 = !DILocation(line: 644, column: 3, scope: !93)
!800 = !DILocalVariable(name: "url_program", scope: !93, file: !54, line: 648, type: !96)
!801 = !DILocation(line: 648, column: 15, scope: !93)
!802 = !DILocation(line: 648, column: 38, scope: !93)
!803 = !DILocation(line: 648, column: 31, scope: !93)
!804 = !DILocation(line: 649, column: 38, scope: !93)
!805 = !DILocation(line: 649, column: 31, scope: !93)
!806 = !DILocation(line: 650, column: 38, scope: !93)
!807 = !DILocation(line: 650, column: 31, scope: !93)
!808 = !DILocation(line: 651, column: 38, scope: !93)
!809 = !DILocation(line: 651, column: 31, scope: !93)
!810 = !DILocation(line: 652, column: 38, scope: !93)
!811 = !DILocation(line: 652, column: 31, scope: !93)
!812 = !DILocation(line: 653, column: 38, scope: !93)
!813 = !DILocation(line: 653, column: 31, scope: !93)
!814 = !DILocation(line: 654, column: 38, scope: !93)
!815 = !DILocation(line: 654, column: 31, scope: !93)
!816 = !DILocation(line: 655, column: 38, scope: !93)
!817 = !DILocation(line: 655, column: 31, scope: !93)
!818 = !DILocation(line: 656, column: 38, scope: !93)
!819 = !DILocation(line: 656, column: 31, scope: !93)
!820 = !DILocation(line: 657, column: 38, scope: !93)
!821 = !DILocation(line: 657, column: 31, scope: !93)
!822 = !DILocation(line: 658, column: 31, scope: !93)
!823 = !DILocation(line: 663, column: 7, scope: !824)
!824 = distinct !DILexicalBlock(scope: !93, file: !54, line: 663, column: 7)
!825 = !DILocation(line: 664, column: 7, scope: !824)
!826 = !DILocation(line: 664, column: 10, scope: !824)
!827 = !DILocation(line: 663, column: 7, scope: !93)
!828 = !DILocation(line: 670, column: 15, scope: !829)
!829 = distinct !DILexicalBlock(scope: !824, file: !54, line: 665, column: 5)
!830 = !DILocation(line: 670, column: 28, scope: !829)
!831 = !DILocation(line: 670, column: 47, scope: !829)
!832 = !DILocation(line: 670, column: 41, scope: !829)
!833 = !DILocation(line: 670, column: 59, scope: !829)
!834 = !DILocation(line: 669, column: 7, scope: !829)
!835 = !DILocation(line: 671, column: 5, scope: !829)
!836 = !DILocation(line: 676, column: 48, scope: !837)
!837 = distinct !DILexicalBlock(scope: !824, file: !54, line: 673, column: 5)
!838 = !DILocation(line: 677, column: 21, scope: !837)
!839 = !DILocation(line: 677, column: 15, scope: !837)
!840 = !DILocation(line: 677, column: 33, scope: !837)
!841 = !DILocation(line: 676, column: 7, scope: !837)
!842 = !DILocation(line: 679, column: 3, scope: !93)
!843 = !DILocation(line: 683, column: 3, scope: !93)
!844 = !DILocation(line: 686, column: 3, scope: !93)
!845 = !DILocation(line: 688, column: 3, scope: !93)
!846 = !DILocation(line: 691, column: 3, scope: !93)
!847 = !DILocation(line: 695, column: 3, scope: !93)
!848 = !DILocation(line: 696, column: 1, scope: !93)
!849 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !54, file: !54, line: 836, type: !850, scopeLine: 837, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !63)
!850 = !DISubroutineType(types: !851)
!851 = !{null, !96}
!852 = !DILocalVariable(name: "program", arg: 1, scope: !849, file: !54, line: 836, type: !96)
!853 = !DILocation(line: 836, column: 34, scope: !849)
!854 = !DILocalVariable(name: "infomap", scope: !849, file: !54, line: 838, type: !855)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !856, size: 896, elements: !108)
!856 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !849, file: !54, line: 838, size: 128, elements: !858)
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !857, file: !54, line: 838, baseType: !96, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !857, file: !54, line: 838, baseType: !96, size: 64, offset: 64)
!861 = !DILocation(line: 838, column: 67, scope: !849)
!862 = !DILocalVariable(name: "node", scope: !849, file: !54, line: 848, type: !96)
!863 = !DILocation(line: 848, column: 15, scope: !849)
!864 = !DILocation(line: 848, column: 22, scope: !849)
!865 = !DILocalVariable(name: "map_prog", scope: !849, file: !54, line: 849, type: !866)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!867 = !DILocation(line: 849, column: 25, scope: !849)
!868 = !DILocation(line: 849, column: 36, scope: !849)
!869 = !DILocation(line: 851, column: 3, scope: !849)
!870 = !DILocation(line: 851, column: 10, scope: !849)
!871 = !DILocation(line: 851, column: 20, scope: !849)
!872 = !DILocation(line: 851, column: 28, scope: !849)
!873 = !DILocation(line: 851, column: 40, scope: !849)
!874 = !DILocation(line: 851, column: 49, scope: !849)
!875 = !DILocation(line: 851, column: 59, scope: !849)
!876 = !DILocation(line: 851, column: 33, scope: !849)
!877 = !DILocation(line: 851, column: 31, scope: !849)
!878 = !DILocation(line: 0, scope: !849)
!879 = !DILocation(line: 852, column: 13, scope: !849)
!880 = distinct !{!880, !869, !879, !733}
!881 = !DILocation(line: 854, column: 7, scope: !882)
!882 = distinct !DILexicalBlock(scope: !849, file: !54, line: 854, column: 7)
!883 = !DILocation(line: 854, column: 17, scope: !882)
!884 = !DILocation(line: 854, column: 7, scope: !849)
!885 = !DILocation(line: 855, column: 12, scope: !882)
!886 = !DILocation(line: 855, column: 22, scope: !882)
!887 = !DILocation(line: 855, column: 10, scope: !882)
!888 = !DILocation(line: 855, column: 5, scope: !882)
!889 = !DILocation(line: 857, column: 3, scope: !849)
!890 = !DILocalVariable(name: "lc_messages", scope: !849, file: !54, line: 861, type: !96)
!891 = !DILocation(line: 861, column: 15, scope: !849)
!892 = !DILocation(line: 861, column: 29, scope: !849)
!893 = !DILocation(line: 862, column: 7, scope: !894)
!894 = distinct !DILexicalBlock(scope: !849, file: !54, line: 862, column: 7)
!895 = !DILocation(line: 862, column: 19, scope: !894)
!896 = !DILocation(line: 862, column: 22, scope: !894)
!897 = !DILocation(line: 862, column: 7, scope: !849)
!898 = !DILocation(line: 868, column: 7, scope: !899)
!899 = distinct !DILexicalBlock(scope: !894, file: !54, line: 863, column: 5)
!900 = !DILocation(line: 870, column: 5, scope: !899)
!901 = !DILocalVariable(name: "url_program", scope: !849, file: !54, line: 874, type: !96)
!902 = !DILocation(line: 874, column: 15, scope: !849)
!903 = !DILocation(line: 874, column: 36, scope: !849)
!904 = !DILocation(line: 874, column: 29, scope: !849)
!905 = !DILocation(line: 874, column: 61, scope: !849)
!906 = !DILocation(line: 875, column: 11, scope: !849)
!907 = !DILocation(line: 876, column: 24, scope: !849)
!908 = !DILocation(line: 875, column: 3, scope: !849)
!909 = !DILocation(line: 877, column: 11, scope: !849)
!910 = !DILocation(line: 878, column: 11, scope: !849)
!911 = !DILocation(line: 878, column: 17, scope: !849)
!912 = !DILocation(line: 878, column: 25, scope: !849)
!913 = !DILocation(line: 878, column: 22, scope: !849)
!914 = !DILocation(line: 877, column: 3, scope: !849)
!915 = !DILocation(line: 879, column: 1, scope: !849)
!916 = !DILocalVariable(name: "argc", arg: 1, scope: !77, file: !3, line: 234, type: !72)
!917 = !DILocation(line: 234, column: 11, scope: !77)
!918 = !DILocalVariable(name: "argv", arg: 2, scope: !77, file: !3, line: 234, type: !80)
!919 = !DILocation(line: 234, column: 24, scope: !77)
!920 = !DILocalVariable(name: "preserve_root", scope: !77, file: !3, line: 236, type: !151)
!921 = !DILocation(line: 236, column: 8, scope: !77)
!922 = !DILocalVariable(name: "x", scope: !77, file: !3, line: 237, type: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !6, line: 32, size: 256, elements: !924)
!924 = !{!925, !926, !927, !928, !929, !930, !932, !933, !934, !935}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !923, file: !6, line: 35, baseType: !151, size: 8)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !923, file: !6, line: 38, baseType: !5, size: 32, offset: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !923, file: !6, line: 47, baseType: !151, size: 8, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !923, file: !6, line: 50, baseType: !151, size: 8, offset: 72)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !923, file: !6, line: 53, baseType: !151, size: 8, offset: 80)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !923, file: !6, line: 57, baseType: !931, size: 64, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !923, file: !6, line: 61, baseType: !151, size: 8, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !923, file: !6, line: 64, baseType: !151, size: 8, offset: 200)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !923, file: !6, line: 67, baseType: !151, size: 8, offset: 208)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !923, file: !6, line: 75, baseType: !151, size: 8, offset: 216)
!936 = !DILocation(line: 237, column: 21, scope: !77)
!937 = !DILocalVariable(name: "prompt_once", scope: !77, file: !3, line: 238, type: !151)
!938 = !DILocation(line: 238, column: 8, scope: !77)
!939 = !DILocalVariable(name: "c", scope: !77, file: !3, line: 239, type: !72)
!940 = !DILocation(line: 239, column: 7, scope: !77)
!941 = !DILocation(line: 242, column: 21, scope: !77)
!942 = !DILocation(line: 242, column: 3, scope: !77)
!943 = !DILocation(line: 243, column: 3, scope: !77)
!944 = !DILocation(line: 244, column: 3, scope: !77)
!945 = !DILocation(line: 245, column: 3, scope: !77)
!946 = !DILocation(line: 247, column: 3, scope: !77)
!947 = !DILocation(line: 249, column: 3, scope: !77)
!948 = !DILocation(line: 252, column: 3, scope: !77)
!949 = !DILocation(line: 254, column: 3, scope: !77)
!950 = !DILocation(line: 254, column: 28, scope: !77)
!951 = !DILocation(line: 254, column: 34, scope: !77)
!952 = !DILocation(line: 254, column: 15, scope: !77)
!953 = !DILocation(line: 254, column: 13, scope: !77)
!954 = !DILocation(line: 254, column: 69, scope: !77)
!955 = !DILocation(line: 256, column: 15, scope: !956)
!956 = distinct !DILexicalBlock(scope: !77, file: !3, line: 255, column: 5)
!957 = !DILocation(line: 256, column: 7, scope: !956)
!958 = !DILocation(line: 259, column: 13, scope: !959)
!959 = distinct !DILexicalBlock(scope: !956, file: !3, line: 257, column: 9)
!960 = !DILocation(line: 259, column: 38, scope: !959)
!961 = !DILocation(line: 260, column: 11, scope: !959)
!962 = !DILocation(line: 263, column: 13, scope: !959)
!963 = !DILocation(line: 263, column: 25, scope: !959)
!964 = !DILocation(line: 264, column: 13, scope: !959)
!965 = !DILocation(line: 264, column: 34, scope: !959)
!966 = !DILocation(line: 265, column: 23, scope: !959)
!967 = !DILocation(line: 266, column: 11, scope: !959)
!968 = !DILocation(line: 269, column: 13, scope: !959)
!969 = !DILocation(line: 269, column: 25, scope: !959)
!970 = !DILocation(line: 270, column: 13, scope: !959)
!971 = !DILocation(line: 270, column: 34, scope: !959)
!972 = !DILocation(line: 271, column: 23, scope: !959)
!973 = !DILocation(line: 272, column: 11, scope: !959)
!974 = !DILocation(line: 275, column: 13, scope: !959)
!975 = !DILocation(line: 275, column: 25, scope: !959)
!976 = !DILocation(line: 276, column: 13, scope: !959)
!977 = !DILocation(line: 276, column: 34, scope: !959)
!978 = !DILocation(line: 277, column: 23, scope: !959)
!979 = !DILocation(line: 278, column: 11, scope: !959)
!980 = !DILocation(line: 282, column: 13, scope: !959)
!981 = !DILocation(line: 282, column: 23, scope: !959)
!982 = !DILocation(line: 283, column: 11, scope: !959)
!983 = !DILocalVariable(name: "i", scope: !984, file: !3, line: 287, type: !72)
!984 = distinct !DILexicalBlock(scope: !959, file: !3, line: 286, column: 11)
!985 = !DILocation(line: 287, column: 17, scope: !984)
!986 = !DILocation(line: 288, column: 17, scope: !987)
!987 = distinct !DILexicalBlock(scope: !984, file: !3, line: 288, column: 17)
!988 = !DILocation(line: 288, column: 17, scope: !984)
!989 = !DILocation(line: 289, column: 19, scope: !987)
!990 = !DILocation(line: 289, column: 17, scope: !987)
!991 = !DILocation(line: 289, column: 15, scope: !987)
!992 = !DILocation(line: 292, column: 17, scope: !987)
!993 = !DILocation(line: 293, column: 21, scope: !984)
!994 = !DILocation(line: 293, column: 13, scope: !984)
!995 = !DILocation(line: 296, column: 19, scope: !996)
!996 = distinct !DILexicalBlock(scope: !984, file: !3, line: 294, column: 15)
!997 = !DILocation(line: 296, column: 31, scope: !996)
!998 = !DILocation(line: 297, column: 29, scope: !996)
!999 = !DILocation(line: 298, column: 17, scope: !996)
!1000 = !DILocation(line: 301, column: 19, scope: !996)
!1001 = !DILocation(line: 301, column: 31, scope: !996)
!1002 = !DILocation(line: 302, column: 19, scope: !996)
!1003 = !DILocation(line: 302, column: 40, scope: !996)
!1004 = !DILocation(line: 303, column: 29, scope: !996)
!1005 = !DILocation(line: 304, column: 17, scope: !996)
!1006 = !DILocation(line: 307, column: 19, scope: !996)
!1007 = !DILocation(line: 307, column: 31, scope: !996)
!1008 = !DILocation(line: 308, column: 19, scope: !996)
!1009 = !DILocation(line: 308, column: 40, scope: !996)
!1010 = !DILocation(line: 309, column: 29, scope: !996)
!1011 = !DILocation(line: 310, column: 17, scope: !996)
!1012 = !DILocation(line: 312, column: 13, scope: !984)
!1013 = !DILocation(line: 316, column: 13, scope: !959)
!1014 = !DILocation(line: 316, column: 29, scope: !959)
!1015 = !DILocation(line: 317, column: 11, scope: !959)
!1016 = !DILocation(line: 320, column: 24, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !959, file: !3, line: 320, column: 15)
!1018 = !DILocation(line: 320, column: 29, scope: !1017)
!1019 = !DILocation(line: 320, column: 36, scope: !1017)
!1020 = !DILocation(line: 320, column: 17, scope: !1017)
!1021 = !DILocation(line: 320, column: 15, scope: !959)
!1022 = !DILocation(line: 321, column: 13, scope: !1017)
!1023 = !DILocation(line: 323, column: 25, scope: !959)
!1024 = !DILocation(line: 324, column: 11, scope: !959)
!1025 = !DILocation(line: 327, column: 15, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !959, file: !3, line: 327, column: 15)
!1027 = !DILocation(line: 327, column: 15, scope: !959)
!1028 = !DILocation(line: 329, column: 26, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 329, column: 19)
!1030 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 328, column: 13)
!1031 = !DILocation(line: 329, column: 19, scope: !1029)
!1032 = !DILocation(line: 329, column: 19, scope: !1030)
!1033 = !DILocation(line: 330, column: 19, scope: !1029)
!1034 = !DILocation(line: 330, column: 37, scope: !1029)
!1035 = !DILocation(line: 330, column: 17, scope: !1029)
!1036 = !DILocation(line: 332, column: 17, scope: !1029)
!1037 = !DILocation(line: 335, column: 13, scope: !1030)
!1038 = !DILocation(line: 336, column: 25, scope: !959)
!1039 = !DILocation(line: 337, column: 11, scope: !959)
!1040 = !DILocation(line: 340, column: 13, scope: !959)
!1041 = !DILocation(line: 340, column: 23, scope: !959)
!1042 = !DILocation(line: 341, column: 11, scope: !959)
!1043 = !DILocation(line: 344, column: 13, scope: !959)
!1044 = !DILocation(line: 344, column: 21, scope: !959)
!1045 = !DILocation(line: 345, column: 11, scope: !959)
!1046 = !DILocation(line: 347, column: 9, scope: !959)
!1047 = !DILocation(line: 348, column: 9, scope: !959)
!1048 = !DILocation(line: 350, column: 36, scope: !959)
!1049 = !DILocation(line: 350, column: 42, scope: !959)
!1050 = !DILocation(line: 350, column: 11, scope: !959)
!1051 = !DILocation(line: 351, column: 11, scope: !959)
!1052 = distinct !{!1052, !949, !1053, !733}
!1053 = !DILocation(line: 353, column: 5, scope: !77)
!1054 = !DILocation(line: 355, column: 7, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !77, file: !3, line: 355, column: 7)
!1056 = !DILocation(line: 355, column: 15, scope: !1055)
!1057 = !DILocation(line: 355, column: 12, scope: !1055)
!1058 = !DILocation(line: 355, column: 7, scope: !77)
!1059 = !DILocation(line: 357, column: 13, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 357, column: 11)
!1061 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 356, column: 5)
!1062 = !DILocation(line: 357, column: 11, scope: !1061)
!1063 = !DILocation(line: 358, column: 9, scope: !1060)
!1064 = !DILocation(line: 361, column: 11, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 360, column: 9)
!1066 = !DILocation(line: 362, column: 11, scope: !1065)
!1067 = !DILocation(line: 366, column: 9, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !77, file: !3, line: 366, column: 7)
!1069 = !DILocation(line: 366, column: 19, scope: !1068)
!1070 = !DILocation(line: 366, column: 22, scope: !1068)
!1071 = !DILocation(line: 366, column: 7, scope: !77)
!1072 = !DILocation(line: 369, column: 24, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1068, file: !3, line: 367, column: 5)
!1074 = !DILocation(line: 369, column: 9, scope: !1073)
!1075 = !DILocation(line: 369, column: 22, scope: !1073)
!1076 = !DILocation(line: 370, column: 13, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1073, file: !3, line: 370, column: 11)
!1078 = !DILocation(line: 370, column: 26, scope: !1077)
!1079 = !DILocation(line: 370, column: 11, scope: !1073)
!1080 = !DILocation(line: 371, column: 9, scope: !1077)
!1081 = !DILocation(line: 373, column: 5, scope: !1073)
!1082 = !DILocalVariable(name: "n_files", scope: !77, file: !3, line: 375, type: !59)
!1083 = !DILocation(line: 375, column: 13, scope: !77)
!1084 = !DILocation(line: 375, column: 23, scope: !77)
!1085 = !DILocation(line: 375, column: 30, scope: !77)
!1086 = !DILocation(line: 375, column: 28, scope: !77)
!1087 = !DILocalVariable(name: "file", scope: !77, file: !3, line: 376, type: !80)
!1088 = !DILocation(line: 376, column: 10, scope: !77)
!1089 = !DILocation(line: 376, column: 18, scope: !77)
!1090 = !DILocation(line: 376, column: 25, scope: !77)
!1091 = !DILocation(line: 376, column: 23, scope: !77)
!1092 = !DILocation(line: 378, column: 7, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !77, file: !3, line: 378, column: 7)
!1094 = !DILocation(line: 378, column: 19, scope: !1093)
!1095 = !DILocation(line: 378, column: 25, scope: !1093)
!1096 = !DILocation(line: 378, column: 35, scope: !1093)
!1097 = !DILocation(line: 378, column: 42, scope: !1093)
!1098 = !DILocation(line: 378, column: 40, scope: !1093)
!1099 = !DILocation(line: 378, column: 7, scope: !77)
!1100 = !DILocation(line: 380, column: 16, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 379, column: 5)
!1102 = !DILocation(line: 381, column: 19, scope: !1101)
!1103 = !DILocation(line: 381, column: 17, scope: !1101)
!1104 = !DILocation(line: 384, column: 44, scope: !1101)
!1105 = !DILocation(line: 384, column: 29, scope: !1101)
!1106 = !DILocation(line: 382, column: 19, scope: !1101)
!1107 = !DILocation(line: 387, column: 44, scope: !1101)
!1108 = !DILocation(line: 387, column: 29, scope: !1101)
!1109 = !DILocation(line: 385, column: 19, scope: !1101)
!1110 = !DILocation(line: 388, column: 16, scope: !1101)
!1111 = !DILocation(line: 388, column: 30, scope: !1101)
!1112 = !DILocation(line: 380, column: 7, scope: !1101)
!1113 = !DILocation(line: 389, column: 12, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 389, column: 11)
!1115 = !DILocation(line: 389, column: 11, scope: !1101)
!1116 = !DILocation(line: 390, column: 9, scope: !1114)
!1117 = !DILocation(line: 391, column: 5, scope: !1101)
!1118 = !DILocalVariable(name: "status", scope: !77, file: !3, line: 393, type: !31)
!1119 = !DILocation(line: 393, column: 18, scope: !77)
!1120 = !DILocation(line: 393, column: 31, scope: !77)
!1121 = !DILocation(line: 393, column: 27, scope: !77)
!1122 = !DILocation(line: 394, column: 3, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1124, file: !3, line: 394, column: 3)
!1124 = distinct !DILexicalBlock(scope: !77, file: !3, line: 394, column: 3)
!1125 = !DILocation(line: 394, column: 3, scope: !1124)
!1126 = !DILocation(line: 395, column: 10, scope: !77)
!1127 = !DILocation(line: 395, column: 17, scope: !77)
!1128 = !DILocation(line: 395, column: 3, scope: !77)
!1129 = !DILocation(line: 396, column: 1, scope: !77)
!1130 = distinct !DISubprogram(name: "rm_option_init", scope: !3, file: !3, line: 216, type: !1131, scopeLine: 217, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !63)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{null, !1133}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!1134 = !DILocalVariable(name: "x", arg: 1, scope: !1130, file: !3, line: 216, type: !1133)
!1135 = !DILocation(line: 216, column: 36, scope: !1130)
!1136 = !DILocation(line: 218, column: 3, scope: !1130)
!1137 = !DILocation(line: 218, column: 6, scope: !1130)
!1138 = !DILocation(line: 218, column: 27, scope: !1130)
!1139 = !DILocation(line: 219, column: 3, scope: !1130)
!1140 = !DILocation(line: 219, column: 6, scope: !1130)
!1141 = !DILocation(line: 219, column: 18, scope: !1130)
!1142 = !DILocation(line: 220, column: 3, scope: !1130)
!1143 = !DILocation(line: 220, column: 6, scope: !1130)
!1144 = !DILocation(line: 220, column: 22, scope: !1130)
!1145 = !DILocation(line: 221, column: 3, scope: !1130)
!1146 = !DILocation(line: 221, column: 6, scope: !1130)
!1147 = !DILocation(line: 221, column: 31, scope: !1130)
!1148 = !DILocation(line: 222, column: 3, scope: !1130)
!1149 = !DILocation(line: 222, column: 6, scope: !1130)
!1150 = !DILocation(line: 222, column: 16, scope: !1130)
!1151 = !DILocation(line: 223, column: 3, scope: !1130)
!1152 = !DILocation(line: 223, column: 6, scope: !1130)
!1153 = !DILocation(line: 223, column: 19, scope: !1130)
!1154 = !DILocation(line: 224, column: 3, scope: !1130)
!1155 = !DILocation(line: 224, column: 6, scope: !1130)
!1156 = !DILocation(line: 224, column: 24, scope: !1130)
!1157 = !DILocation(line: 225, column: 18, scope: !1130)
!1158 = !DILocation(line: 225, column: 3, scope: !1130)
!1159 = !DILocation(line: 225, column: 6, scope: !1130)
!1160 = !DILocation(line: 225, column: 16, scope: !1130)
!1161 = !DILocation(line: 226, column: 3, scope: !1130)
!1162 = !DILocation(line: 226, column: 6, scope: !1130)
!1163 = !DILocation(line: 226, column: 14, scope: !1130)
!1164 = !DILocation(line: 230, column: 3, scope: !1130)
!1165 = !DILocation(line: 230, column: 6, scope: !1130)
!1166 = !DILocation(line: 230, column: 26, scope: !1130)
!1167 = !DILocation(line: 231, column: 1, scope: !1130)
!1168 = distinct !DISubprogram(name: "diagnose_leading_hyphen", scope: !3, file: !3, line: 102, type: !1169, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !63)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{null, !72, !80}
!1171 = !DILocalVariable(name: "argc", arg: 1, scope: !1168, file: !3, line: 102, type: !72)
!1172 = !DILocation(line: 102, column: 30, scope: !1168)
!1173 = !DILocalVariable(name: "argv", arg: 2, scope: !1168, file: !3, line: 102, type: !80)
!1174 = !DILocation(line: 102, column: 43, scope: !1168)
!1175 = !DILocalVariable(name: "i", scope: !1176, file: !3, line: 107, type: !72)
!1176 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 107, column: 3)
!1177 = !DILocation(line: 107, column: 12, scope: !1176)
!1178 = !DILocation(line: 107, column: 8, scope: !1176)
!1179 = !DILocation(line: 107, column: 19, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1176, file: !3, line: 107, column: 3)
!1181 = !DILocation(line: 107, column: 23, scope: !1180)
!1182 = !DILocation(line: 107, column: 21, scope: !1180)
!1183 = !DILocation(line: 107, column: 3, scope: !1176)
!1184 = !DILocalVariable(name: "arg", scope: !1185, file: !3, line: 109, type: !96)
!1185 = distinct !DILexicalBlock(scope: !1180, file: !3, line: 108, column: 5)
!1186 = !DILocation(line: 109, column: 19, scope: !1185)
!1187 = !DILocation(line: 109, column: 25, scope: !1185)
!1188 = !DILocation(line: 109, column: 30, scope: !1185)
!1189 = !DILocalVariable(name: "st", scope: !1185, file: !3, line: 110, type: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !415, line: 44, size: 1024, elements: !1191)
