; ModuleID = 'src/chown.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon.28 }
%union.anon.28 = type { i32 }
%struct.Chown_option = type { i32, i8, %struct.dev_ino*, i8, i8, i8*, i8* }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [2 x i32] }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 54, type: !82, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !46, globals: !52, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/chown.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a02eccf22a7d82d4fc209d7ee0d5491e")
!4 = !{!5, !11, !17, !31}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chown_modes", file: !6, line: 1, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/chown.h", directory: "/src", checksumkind: CSK_MD5, checksum: "50ba9cc23f94a0654dc79a8cbc8f764f")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "CHOWN_CHOWN", value: 0)
!10 = !DIEnumerator(name: "CHOWN_CHGRP", value: 1)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !12, line: 32, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "src/chown-core.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a6be4c36df40aa37134c0db7329b7a85")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "V_high", value: 0)
!15 = !DIEnumerator(name: "V_changes_only", value: 1)
!16 = !DIEnumerator(name: "V_off", value: 2)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !18, line: 42, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!20 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!21 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!22 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!23 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!24 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!25 = !DIEnumerator(name: "c_quoting_style", value: 5)
!26 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!27 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!28 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!29 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!30 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 46, baseType: !7, size: 32, elements: !33)
!32 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!34 = !DIEnumerator(name: "_ISupper", value: 256)
!35 = !DIEnumerator(name: "_ISlower", value: 512)
!36 = !DIEnumerator(name: "_ISalpha", value: 1024)
!37 = !DIEnumerator(name: "_ISdigit", value: 2048)
!38 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!39 = !DIEnumerator(name: "_ISspace", value: 8192)
!40 = !DIEnumerator(name: "_ISprint", value: 16384)
!41 = !DIEnumerator(name: "_ISgraph", value: 32768)
!42 = !DIEnumerator(name: "_ISblank", value: 1)
!43 = !DIEnumerator(name: "_IScntrl", value: 2)
!44 = !DIEnumerator(name: "_ISpunct", value: 4)
!45 = !DIEnumerator(name: "_ISalnum", value: 8)
!46 = !{!47, !49, !50, !51}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!52 = !{!53, !72, !74, !0}
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !55, file: !3, line: 353, type: !60, isLocal: true, isDefinition: true)
!55 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 178, type: !56, scopeLine: 179, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !59)
!56 = !DISubroutineType(types: !57)
!57 = !{!50, !50, !58}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!59 = !{}
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !61, line: 30, size: 128, elements: !62)
!61 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!62 = !{!63, !69}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !60, file: !61, line: 32, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !65, line: 47, baseType: !66)
!65 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !67, line: 148, baseType: !68)
!67 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!68 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !60, file: !61, line: 33, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !65, line: 59, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !67, line: 145, baseType: !68)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "reference_file", scope: !2, file: !3, line: 41, type: !47, isLocal: true, isDefinition: true)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !76, file: !77, line: 575, type: !50, isLocal: true, isDefinition: true)
!76 = distinct !DISubprogram(name: "oputs_", scope: !77, file: !77, line: 573, type: !78, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !59)
!77 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!78 = !DISubroutineType(types: !79)
!79 = !{null, !80, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 3584, elements: !92)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !85, line: 50, size: 256, elements: !86)
!85 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!86 = !{!87, !88, !89, !91}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !84, file: !85, line: 52, baseType: !80, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !84, file: !85, line: 55, baseType: !50, size: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !84, file: !85, line: 56, baseType: !90, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !84, file: !85, line: 57, baseType: !50, size: 32, offset: 192)
!92 = !{!93}
!93 = !DISubrange(count: 14)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "chown_mode", scope: !96, file: !97, line: 2, type: !5, isLocal: false, isDefinition: true)
!96 = distinct !DICompileUnit(language: DW_LANG_C99, file: !97, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !98, globals: !99, splitDebugInlining: false, nameTableKind: None)
!97 = !DIFile(filename: "src/chown-chown.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3a1b210c35e4963aa8514922b01ea0b2")
!98 = !{!5}
!99 = !{!94}
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "Version", scope: !102, file: !103, line: 3, type: !80, isLocal: false, isDefinition: true)
!102 = distinct !DICompileUnit(language: DW_LANG_C99, file: !103, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !104, splitDebugInlining: false, nameTableKind: None)
!103 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!104 = !{!100}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "file_name", scope: !107, file: !108, line: 45, type: !80, isLocal: true, isDefinition: true)
!107 = distinct !DICompileUnit(language: DW_LANG_C99, file: !108, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !109, splitDebugInlining: false, nameTableKind: None)
!108 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!109 = !{!105, !110}
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !107, file: !108, line: 55, type: !112, isLocal: true, isDefinition: true)
!112 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !115, file: !116, line: 66, type: !144, isLocal: false, isDefinition: true)
!115 = distinct !DICompileUnit(language: DW_LANG_C99, file: !116, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !117, globals: !118, splitDebugInlining: false, nameTableKind: None)
!116 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!117 = !{!49}
!118 = !{!119, !138, !113, !140, !142}
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "old_file_name", scope: !121, file: !116, line: 304, type: !80, isLocal: true, isDefinition: true)
!121 = distinct !DISubprogram(name: "verror_at_line", scope: !116, file: !116, line: 298, type: !122, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !115, retainedNodes: !59)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !50, !50, !80, !7, !80, !124}
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !125, line: 52, baseType: !126)
!125 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !127, line: 32, baseType: !128)
!127 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !129, baseType: !130)
!129 = !DIFile(filename: "lib/error.c", directory: "/src")
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !131, size: 256, elements: !132)
!131 = !DINamespace(name: "std", scope: null)
!132 = !{!133, !134, !135, !136, !137}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !130, file: !129, baseType: !49, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !130, file: !129, baseType: !49, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !130, file: !129, baseType: !49, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !130, file: !129, baseType: !50, size: 32, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !130, file: !129, baseType: !50, size: 32, offset: 224)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "old_line_number", scope: !121, file: !116, line: 305, type: !7, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "error_message_count", scope: !115, file: !116, line: 69, type: !7, isLocal: false, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !115, file: !116, line: 295, type: !50, isLocal: false, isDefinition: true)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null}
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "default_tuning", scope: !149, file: !150, line: 134, type: !156, isLocal: true, isDefinition: true)
!149 = distinct !DICompileUnit(language: DW_LANG_C99, file: !150, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !151, globals: !155, splitDebugInlining: false, nameTableKind: None)
!150 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!151 = !{!68, !49, !152, !153}
!152 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !154, line: 46, baseType: !68)
!154 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!155 = !{!147}
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !158, line: 52, baseType: !159)
!158 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !158, line: 40, size: 160, elements: !160)
!160 = !{!161, !162, !163, !164, !165}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !159, file: !158, line: 45, baseType: !152, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !159, file: !158, line: 46, baseType: !152, size: 32, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !159, file: !158, line: 47, baseType: !152, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !159, file: !158, line: 48, baseType: !152, size: 32, offset: 96)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !159, file: !158, line: 49, baseType: !112, size: 8, offset: 128)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "program_name", scope: !168, file: !169, line: 31, type: !80, isLocal: false, isDefinition: true)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !170, globals: !171, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!170 = !{!47}
!171 = !{!166}
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "utf07FF", scope: !174, file: !175, line: 46, type: !180, isLocal: true, isDefinition: true)
!174 = distinct !DISubprogram(name: "proper_name_lite", scope: !175, file: !175, line: 38, type: !176, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !178, retainedNodes: !59)
!175 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!176 = !DISubroutineType(types: !177)
!177 = !{!80, !80, !80}
!178 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !179, splitDebugInlining: false, nameTableKind: None)
!179 = !{!172}
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 16, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 2)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !185, file: !186, line: 76, type: !239, isLocal: false, isDefinition: true)
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !187, retainedTypes: !193, globals: !194, splitDebugInlining: false, nameTableKind: None)
!186 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!187 = !{!17, !188, !31}
!188 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !18, line: 254, baseType: !7, size: 32, elements: !189)
!189 = !{!190, !191, !192}
!190 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!191 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!192 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!193 = !{!50, !51, !153}
!194 = !{!183, !195, !201, !213, !215, !220, !228, !235, !237}
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !185, file: !186, line: 92, type: !197, isLocal: false, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 320, elements: !199)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!199 = !{!200}
!200 = !DISubrange(count: 10)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !185, file: !186, line: 1040, type: !203, isLocal: false, isDefinition: true)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !186, line: 56, size: 448, elements: !204)
!204 = !{!205, !206, !207, !211, !212}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !203, file: !186, line: 59, baseType: !17, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !203, file: !186, line: 62, baseType: !50, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !203, file: !186, line: 66, baseType: !208, size: 256, offset: 64)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 8)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !203, file: !186, line: 69, baseType: !80, size: 64, offset: 320)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !203, file: !186, line: 72, baseType: !80, size: 64, offset: 384)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !185, file: !186, line: 107, type: !203, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "slot0", scope: !185, file: !186, line: 831, type: !217, isLocal: true, isDefinition: true)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 2048, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 256)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "quote", scope: !222, file: !186, line: 228, type: !225, isLocal: true, isDefinition: true)
!222 = distinct !DISubprogram(name: "gettext_quote", scope: !186, file: !186, line: 197, type: !223, scopeLine: 198, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !185, retainedNodes: !59)
!223 = !DISubroutineType(types: !224)
!224 = !{!80, !80, !17}
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 64, elements: !226)
!226 = !{!182, !227}
!227 = !DISubrange(count: 4)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "slotvec", scope: !185, file: !186, line: 834, type: !230, isLocal: true, isDefinition: true)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !186, line: 823, size: 128, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !231, file: !186, line: 825, baseType: !153, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !231, file: !186, line: 826, baseType: !47, size: 64, offset: 64)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "nslots", scope: !185, file: !186, line: 832, type: !50, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "slotvec0", scope: !185, file: !186, line: 833, type: !231, isLocal: true, isDefinition: true)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 704, elements: !241)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!241 = !{!242}
!242 = !DISubrange(count: 11)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !245, file: !246, line: 26, type: !248, isLocal: false, isDefinition: true)
!245 = distinct !DICompileUnit(language: DW_LANG_C99, file: !246, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !247, splitDebugInlining: false, nameTableKind: None)
!246 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!247 = !{!243}
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 376, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 47)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "exit_failure", scope: !253, file: !254, line: 24, type: !256, isLocal: false, isDefinition: true)
!253 = distinct !DICompileUnit(language: DW_LANG_C99, file: !254, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !255, splitDebugInlining: false, nameTableKind: None)
!254 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!255 = !{!251}
!256 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !50)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !259, file: !260, line: 506, type: !50, isLocal: true, isDefinition: true)
!259 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !260, file: !260, line: 485, type: !261, scopeLine: 486, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !263, retainedNodes: !59)
!260 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!261 = !DISubroutineType(types: !262)
!262 = !{!50, !50, !50}
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !260, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !264, splitDebugInlining: false, nameTableKind: None)
!264 = !{!257}
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "internal_state", scope: !267, file: !268, line: 97, type: !272, isLocal: true, isDefinition: true)
!267 = distinct !DICompileUnit(language: DW_LANG_C99, file: !268, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !269, globals: !271, splitDebugInlining: false, nameTableKind: None)
!268 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!269 = !{!49, !153, !270}
!270 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!271 = !{!265}
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !273, line: 6, baseType: !274)
!273 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !275, line: 21, baseType: !276)
!275 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !275, line: 13, size: 64, elements: !277)
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !276, file: !275, line: 15, baseType: !50, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !276, file: !275, line: 20, baseType: !280, size: 32, offset: 32)
!280 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !276, file: !275, line: 16, size: 32, elements: !281)
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !280, file: !275, line: 18, baseType: !7, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !280, file: !275, line: 19, baseType: !284, size: 32)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !285)
!285 = !{!227}
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !288, retainedTypes: !302, splitDebugInlining: false, nameTableKind: None)
!287 = !DIFile(filename: "src/chown-core.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0cc937f337309996c839dc01ee932e6")
!288 = !{!11, !17, !289, !296}
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RCH_status", file: !287, line: 38, baseType: !7, size: 32, elements: !290)
!290 = !{!291, !292, !293, !294, !295}
!291 = !DIEnumerator(name: "RC_ok", value: 2)
!292 = !DIEnumerator(name: "RC_excluded", value: 3)
!293 = !DIEnumerator(name: "RC_inode_changed", value: 4)
!294 = !DIEnumerator(name: "RC_do_ordinary_chown", value: 5)
!295 = !DIEnumerator(name: "RC_error", value: 6)
!296 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !12, line: 24, baseType: !7, size: 32, elements: !297)
!297 = !{!298, !299, !300, !301}
!298 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 1)
!299 = !DIEnumerator(name: "CH_SUCCEEDED", value: 2)
!300 = !DIEnumerator(name: "CH_FAILED", value: 3)
!301 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 4)
!302 = !{!303, !305, !49}
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !65, line: 79, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !67, line: 146, baseType: !7)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !65, line: 64, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !67, line: 147, baseType: !7)
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!308 = !DIFile(filename: "lib/chownat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "911dc564dc02bfb78f751e028580121f")
!309 = distinct !DICompileUnit(language: DW_LANG_C99, file: !310, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !311, retainedTypes: !469, splitDebugInlining: false, nameTableKind: None)
!310 = !DIFile(filename: "lib/fts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "790475fd5d16e5b9bfdbc337c34f4fa2")
!311 = !{!312, !316, !445, !448, !452, !463, !466}
!312 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !310, line: 159, baseType: !7, size: 32, elements: !313)
!313 = !{!314, !315}
!314 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!315 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!316 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !318, file: !317, line: 54, baseType: !7, size: 32, elements: !443)
!317 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/src", checksumkind: CSK_MD5, checksum: "270205dca4a7d3b7c2e61f5b3b63f3eb")
!318 = distinct !DISubprogram(name: "setup_dir", scope: !317, file: !317, line: 50, type: !319, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !309, retainedNodes: !59)
!319 = !DISubroutineType(types: !320)
!320 = !{!112, !321}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !323, line: 233, baseType: !324)
!323 = !DIFile(filename: "./lib/fts_.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8acf5ffdd2781290912583d2be00a5f3")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 115, size: 1024, elements: !325)
!325 = !{!326, !393, !394, !396, !397, !398, !399, !400, !401, !402, !409, !410, !413, !432}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !324, file: !323, line: 116, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !323, line: 235, size: 1920, elements: !329)
!329 = !{!330, !331, !332, !333, !338, !340, !341, !342, !343, !344, !345, !346, !347, !349, !350, !351, !352, !353, !389}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !328, file: !323, line: 236, baseType: !327, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !328, file: !323, line: 237, baseType: !327, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !328, file: !323, line: 238, baseType: !327, size: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !328, file: !323, line: 239, baseType: !334, size: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !336, line: 127, baseType: !337)
!336 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !336, line: 127, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !328, file: !323, line: 242, baseType: !339, size: 64, offset: 256)
!339 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !328, file: !323, line: 243, baseType: !49, size: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !328, file: !323, line: 244, baseType: !47, size: 64, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !328, file: !323, line: 245, baseType: !47, size: 64, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !328, file: !323, line: 246, baseType: !50, size: 32, offset: 512)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !328, file: !323, line: 247, baseType: !50, size: 32, offset: 544)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !328, file: !323, line: 248, baseType: !153, size: 64, offset: 576)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !328, file: !323, line: 250, baseType: !321, size: 64, offset: 640)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !328, file: !323, line: 254, baseType: !348, size: 64, offset: 704)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !154, line: 35, baseType: !339)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !328, file: !323, line: 256, baseType: !153, size: 64, offset: 768)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !328, file: !323, line: 272, baseType: !51, size: 16, offset: 832)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !328, file: !323, line: 276, baseType: !51, size: 16, offset: 848)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !328, file: !323, line: 282, baseType: !51, size: 16, offset: 864)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !328, file: !323, line: 284, baseType: !354, size: 1024, offset: 896)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 1024, elements: !387)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !356, line: 44, size: 1024, elements: !357)
!356 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!357 = !{!358, !359, !360, !362, !364, !365, !366, !367, !368, !370, !372, !373, !375, !383, !384, !385}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !355, file: !356, line: 46, baseType: !71, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !355, file: !356, line: 47, baseType: !66, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !355, file: !356, line: 48, baseType: !361, size: 32, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !67, line: 150, baseType: !7)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !355, file: !356, line: 49, baseType: !363, size: 32, offset: 160)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !67, line: 151, baseType: !7)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !355, file: !356, line: 50, baseType: !304, size: 32, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !355, file: !356, line: 51, baseType: !306, size: 32, offset: 224)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !355, file: !356, line: 52, baseType: !71, size: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !355, file: !356, line: 53, baseType: !71, size: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !355, file: !356, line: 54, baseType: !369, size: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !67, line: 152, baseType: !339)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !355, file: !356, line: 55, baseType: !371, size: 32, offset: 448)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !67, line: 175, baseType: !50)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !355, file: !356, line: 56, baseType: !50, size: 32, offset: 480)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !355, file: !356, line: 57, baseType: !374, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !67, line: 180, baseType: !339)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !355, file: !356, line: 65, baseType: !376, size: 128, offset: 576)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !377, line: 11, size: 128, elements: !378)
!377 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!378 = !{!379, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !376, file: !377, line: 16, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !67, line: 160, baseType: !339)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !376, file: !377, line: 21, baseType: !382, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !67, line: 197, baseType: !339)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !355, file: !356, line: 66, baseType: !376, size: 128, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !355, file: !356, line: 67, baseType: !376, size: 128, offset: 832)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !355, file: !356, line: 79, baseType: !386, size: 64, offset: 960)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 64, elements: !181)
!387 = !{!388}
!388 = !DISubrange(count: 1)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !328, file: !323, line: 285, baseType: !390, offset: 1920)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: -1)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !324, file: !323, line: 117, baseType: !327, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !324, file: !323, line: 118, baseType: !395, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !324, file: !323, line: 119, baseType: !70, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !324, file: !323, line: 120, baseType: !47, size: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !324, file: !323, line: 121, baseType: !50, size: 32, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !324, file: !323, line: 122, baseType: !50, size: 32, offset: 352)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !324, file: !323, line: 124, baseType: !153, size: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !324, file: !323, line: 125, baseType: !153, size: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !324, file: !323, line: 126, baseType: !403, size: 64, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!50, !406, !406}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !328)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !324, file: !323, line: 196, baseType: !50, size: 32, offset: 576)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !324, file: !323, line: 205, baseType: !411, size: 64, offset: 640)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !323, line: 205, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !324, file: !323, line: 227, baseType: !414, size: 64, offset: 704)
!414 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !324, file: !323, line: 207, size: 64, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !414, file: !323, line: 220, baseType: !411, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !414, file: !323, line: 226, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !420, line: 32, size: 256, elements: !421)
!420 = !DIFile(filename: "./lib/cycle-check.h", directory: "/src", checksumkind: CSK_MD5, checksum: "5b1b442060400da72f41cd561f8be0ce")
!421 = !{!422, !427, !431}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !419, file: !420, line: 34, baseType: !423, size: 128)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !61, line: 30, size: 128, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !423, file: !61, line: 32, baseType: !64, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !423, file: !61, line: 33, baseType: !70, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !419, file: !420, line: 35, baseType: !428, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !429, line: 102, baseType: !430)
!429 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !67, line: 73, baseType: !68)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !419, file: !420, line: 36, baseType: !50, size: 32, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !324, file: !323, line: 232, baseType: !433, size: 256, offset: 768)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !434, line: 47, baseType: !435)
!434 = !DIFile(filename: "./lib/i-ring.h", directory: "/src", checksumkind: CSK_MD5, checksum: "e5a837f066348a79b8b8c179c8da2a6d")
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !434, line: 39, size: 256, elements: !436)
!436 = !{!437, !439, !440, !441, !442}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !435, file: !434, line: 41, baseType: !438, size: 128)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 128, elements: !285)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !435, file: !434, line: 42, baseType: !50, size: 32, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !435, file: !434, line: 43, baseType: !7, size: 32, offset: 160)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !435, file: !434, line: 44, baseType: !7, size: 32, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !435, file: !434, line: 45, baseType: !112, size: 8, offset: 224)
!443 = !{!444}
!444 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31)
!445 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !310, line: 635, baseType: !7, size: 32, elements: !446)
!446 = !{!447}
!447 = !DIEnumerator(name: "MIN_DIR_NLINK", value: 2)
!448 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !310, line: 638, baseType: !7, size: 32, elements: !449)
!449 = !{!450, !451}
!450 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0)
!451 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1)
!452 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !336, line: 97, baseType: !7, size: 32, elements: !453)
!453 = !{!454, !455, !456, !457, !458, !459, !460, !461, !462}
!454 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!455 = !DIEnumerator(name: "DT_FIFO", value: 1)
!456 = !DIEnumerator(name: "DT_CHR", value: 2)
!457 = !DIEnumerator(name: "DT_DIR", value: 4)
!458 = !DIEnumerator(name: "DT_BLK", value: 6)
!459 = !DIEnumerator(name: "DT_REG", value: 8)
!460 = !DIEnumerator(name: "DT_LNK", value: 10)
!461 = !DIEnumerator(name: "DT_SOCK", value: 12)
!462 = !DIEnumerator(name: "DT_WHT", value: 14)
!463 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !310, line: 154, baseType: !7, size: 32, elements: !464)
!464 = !{!465}
!465 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000)
!466 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !310, line: 676, baseType: !7, size: 32, elements: !467)
!467 = !{!468}
!468 = !DIEnumerator(name: "DEV_TYPE_HT_INITIAL_SIZE", value: 13)
!469 = !{!49, !428, !470, !471, !476}
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !429, line: 90, baseType: !68)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!50, !474, !474}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !323, line: 286, baseType: !328)
!480 = distinct !DICompileUnit(language: DW_LANG_C99, file: !481, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!481 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!482 = distinct !DICompileUnit(language: DW_LANG_C99, file: !483, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, splitDebugInlining: false, nameTableKind: None)
!483 = !DIFile(filename: "lib/i-ring.c", directory: "/src", checksumkind: CSK_MD5, checksum: "581251246a0cdfeb716d0893ef103e1d")
!484 = !{!485}
!485 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !434, line: 28, baseType: !7, size: 32, elements: !486)
!486 = !{!487}
!487 = !DIEnumerator(name: "I_RING_SIZE", value: 4)
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !490, splitDebugInlining: false, nameTableKind: None)
!489 = !DIFile(filename: "lib/umaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "afa759af6e92fed26f32f683da6c23a8")
!490 = !{!428}
!491 = distinct !DICompileUnit(language: DW_LANG_C99, file: !492, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!492 = !DIFile(filename: "lib/next-prime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9e10a95d0a1244096fa4fe5ba361f714")
!493 = distinct !DICompileUnit(language: DW_LANG_C99, file: !494, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!494 = !DIFile(filename: "lib/openat-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "946ef6e8fdb1124c3d2ae8982ba6c16b")
!495 = distinct !DICompileUnit(language: DW_LANG_C99, file: !496, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!496 = !DIFile(filename: "lib/opendirat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9ae84c4c59278018f497b82d8ee5d941")
!497 = distinct !DICompileUnit(language: DW_LANG_C99, file: !498, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!498 = !DIFile(filename: "lib/realloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a76cd3b708f695a3bf546d626aa758d")
!499 = distinct !DICompileUnit(language: DW_LANG_C99, file: !500, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !501, splitDebugInlining: false, nameTableKind: None)
!500 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!501 = !{!112, !68, !49}
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!503 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b0632229108c1521929601778d55996f")
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "lib/same-inode.c", directory: "/src", checksumkind: CSK_MD5, checksum: "645a5a197803e6f5b21d413e2fdff71f")
!506 = distinct !DICompileUnit(language: DW_LANG_C99, file: !507, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!507 = !DIFile(filename: "lib/streq.c", directory: "/src", checksumkind: CSK_MD5, checksum: "912b0bbb2168195104931254916871aa")
!508 = distinct !DICompileUnit(language: DW_LANG_C99, file: !509, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!509 = !DIFile(filename: "lib/fd-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12c3310fb811f6ed0e0fb7e99c1b995b")
!510 = distinct !DICompileUnit(language: DW_LANG_C99, file: !511, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !512, retainedTypes: !521, splitDebugInlining: false, nameTableKind: None)
!511 = !DIFile(filename: "lib/userspec.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9b1d112c5d74602907b912457199dc83")
!512 = !{!513}
!513 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !514, line: 30, baseType: !7, size: 32, elements: !515)
!514 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!515 = !{!516, !517, !518, !519, !520}
!516 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!517 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!518 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!519 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!520 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!521 = !{!49, !303, !305}
!522 = distinct !DICompileUnit(language: DW_LANG_C99, file: !523, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !524, retainedTypes: !117, splitDebugInlining: false, nameTableKind: None)
!523 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!524 = !{!525}
!525 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !523, line: 40, baseType: !7, size: 32, elements: !526)
!526 = !{!527}
!527 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!528 = distinct !DICompileUnit(language: DW_LANG_C99, file: !529, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !530, retainedTypes: !545, splitDebugInlining: false, nameTableKind: None)
!529 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!530 = !{!531, !538}
!531 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !532, file: !529, line: 188, baseType: !7, size: 32, elements: !536)
!532 = distinct !DISubprogram(name: "x2nrealloc", scope: !529, file: !529, line: 176, type: !533, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !528, retainedNodes: !59)
!533 = !DISubroutineType(types: !534)
!534 = !{!49, !49, !535, !153}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!536 = !{!537}
!537 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!538 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !539, file: !529, line: 228, baseType: !7, size: 32, elements: !536)
!539 = distinct !DISubprogram(name: "xpalloc", scope: !529, file: !529, line: 223, type: !540, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !528, retainedNodes: !59)
!540 = !DISubroutineType(types: !541)
!541 = !{!49, !49, !542, !543, !348, !543}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !544, line: 130, baseType: !348)
!544 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!545 = !{!47, !49, !112, !339, !68}
!546 = distinct !DICompileUnit(language: DW_LANG_C99, file: !547, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!547 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!548 = distinct !DICompileUnit(language: DW_LANG_C99, file: !549, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !117, splitDebugInlining: false, nameTableKind: None)
!549 = !DIFile(filename: "lib/xfts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84bc35d35364cd7c760cb21288203f20")
!550 = distinct !DICompileUnit(language: DW_LANG_C99, file: !551, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !552, retainedTypes: !553, splitDebugInlining: false, nameTableKind: None)
!551 = !DIFile(filename: "lib/xstrtoul.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2b318e5928e8382cfa3ae094c8d00222")
!552 = !{!513, !31}
!553 = !{!50, !51, !47, !112, !68}
!554 = distinct !DICompileUnit(language: DW_LANG_C99, file: !555, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !556, splitDebugInlining: false, nameTableKind: None)
!555 = !DIFile(filename: "lib/bitrotate.c", directory: "/src", checksumkind: CSK_MD5, checksum: "447ab96324f6b3138fedae3f998f2539")
!556 = !{!7}
!557 = distinct !DICompileUnit(language: DW_LANG_C99, file: !558, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!558 = !DIFile(filename: "lib/c32isprint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aac58442c7952a27a6ecb1773b2ef569")
!559 = distinct !DICompileUnit(language: DW_LANG_C99, file: !560, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!560 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!561 = distinct !DICompileUnit(language: DW_LANG_C99, file: !562, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!562 = !DIFile(filename: "lib/cycle-check.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9029e4490609d8d0ac3188f897240e9")
!563 = distinct !DICompileUnit(language: DW_LANG_C99, file: !564, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!564 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!565 = distinct !DICompileUnit(language: DW_LANG_C99, file: !566, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!566 = !DIFile(filename: "lib/open-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84efcad54206a8ffedf254f32134ee9c")
!567 = distinct !DICompileUnit(language: DW_LANG_C99, file: !568, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !117, splitDebugInlining: false, nameTableKind: None)
!568 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!569 = distinct !DICompileUnit(language: DW_LANG_C99, file: !570, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !117, splitDebugInlining: false, nameTableKind: None)
!570 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!571 = distinct !DICompileUnit(language: DW_LANG_C99, file: !572, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !117, splitDebugInlining: false, nameTableKind: None)
!572 = !DIFile(filename: "lib/ialloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e1d85861a0099c22cc583b5eb5f30423")
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!574 = !DIFile(filename: "lib/mbszero.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1b51b91fccd359a867925f7b0fc988a4")
!575 = distinct !DICompileUnit(language: DW_LANG_C99, file: !576, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!576 = !DIFile(filename: "lib/memeq.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9bf299a5d27acbe732c4d2f0d9a2144a")
!577 = distinct !DICompileUnit(language: DW_LANG_C99, file: !578, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!578 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!579 = distinct !DICompileUnit(language: DW_LANG_C99, file: !580, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!580 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!581 = distinct !DICompileUnit(language: DW_LANG_C99, file: !582, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!582 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!583 = distinct !DICompileUnit(language: DW_LANG_C99, file: !584, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !117, splitDebugInlining: false, nameTableKind: None)
!584 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!585 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!586 = !{i32 7, !"Dwarf Version", i32 5}
!587 = !{i32 2, !"Debug Info Version", i32 3}
!588 = !{i32 1, !"wchar_size", i32 4}
!589 = !{i32 1, !"branch-target-enforcement", i32 0}
!590 = !{i32 1, !"sign-return-address", i32 0}
!591 = !{i32 1, !"sign-return-address-all", i32 0}
!592 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!593 = !{i32 7, !"PIC Level", i32 2}
!594 = !{i32 7, !"PIE Level", i32 2}
!595 = !{i32 7, !"uwtable", i32 1}
!596 = !{i32 7, !"frame-pointer", i32 1}
!597 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 73, type: !598, scopeLine: 74, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !59)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !50}
!600 = !DILocalVariable(name: "status", arg: 1, scope: !597, file: !3, line: 73, type: !50)
!601 = !DILocation(line: 73, column: 12, scope: !597)
!602 = !DILocation(line: 75, column: 7, scope: !603)
!603 = distinct !DILexicalBlock(scope: !597, file: !3, line: 75, column: 7)
!604 = !DILocation(line: 75, column: 14, scope: !603)
!605 = !DILocation(line: 75, column: 7, scope: !597)
!606 = !DILocation(line: 76, column: 5, scope: !603)
!607 = !DILocation(line: 76, column: 5, scope: !608)
!608 = distinct !DILexicalBlock(scope: !603, file: !3, line: 76, column: 5)
!609 = !DILocation(line: 79, column: 15, scope: !610)
!610 = distinct !DILexicalBlock(scope: !603, file: !3, line: 78, column: 5)
!611 = !DILocation(line: 83, column: 15, scope: !610)
!612 = !DILocation(line: 84, column: 15, scope: !610)
!613 = !DILocation(line: 84, column: 26, scope: !610)
!614 = !DILocation(line: 84, column: 43, scope: !610)
!615 = !DILocation(line: 84, column: 68, scope: !610)
!616 = !DILocation(line: 85, column: 15, scope: !610)
!617 = !DILocation(line: 79, column: 7, scope: !610)
!618 = !DILocation(line: 86, column: 11, scope: !619)
!619 = distinct !DILexicalBlock(scope: !610, file: !3, line: 86, column: 11)
!620 = !DILocation(line: 86, column: 22, scope: !619)
!621 = !DILocation(line: 86, column: 11, scope: !610)
!622 = !DILocation(line: 87, column: 9, scope: !619)
!623 = !DILocation(line: 93, column: 9, scope: !619)
!624 = !DILocation(line: 98, column: 7, scope: !610)
!625 = !DILocation(line: 102, column: 7, scope: !610)
!626 = !DILocation(line: 106, column: 7, scope: !610)
!627 = !DILocation(line: 110, column: 7, scope: !610)
!628 = !DILocation(line: 115, column: 7, scope: !610)
!629 = !DILocation(line: 120, column: 7, scope: !610)
!630 = !DILocation(line: 127, column: 7, scope: !610)
!631 = !DILocation(line: 131, column: 7, scope: !610)
!632 = !DILocation(line: 135, column: 7, scope: !610)
!633 = !DILocation(line: 140, column: 7, scope: !610)
!634 = !DILocation(line: 144, column: 7, scope: !610)
!635 = !DILocation(line: 145, column: 7, scope: !610)
!636 = !DILocation(line: 146, column: 7, scope: !610)
!637 = !DILocation(line: 147, column: 11, scope: !638)
!638 = distinct !DILexicalBlock(scope: !610, file: !3, line: 147, column: 11)
!639 = !DILocation(line: 147, column: 22, scope: !638)
!640 = !DILocation(line: 147, column: 11, scope: !610)
!641 = !DILocation(line: 148, column: 9, scope: !638)
!642 = !DILocation(line: 155, column: 11, scope: !643)
!643 = distinct !DILexicalBlock(scope: !610, file: !3, line: 155, column: 11)
!644 = !DILocation(line: 155, column: 22, scope: !643)
!645 = !DILocation(line: 155, column: 11, scope: !610)
!646 = !DILocation(line: 156, column: 17, scope: !643)
!647 = !DILocation(line: 163, column: 15, scope: !643)
!648 = !DILocation(line: 163, column: 29, scope: !643)
!649 = !DILocation(line: 163, column: 43, scope: !643)
!650 = !DILocation(line: 156, column: 9, scope: !643)
!651 = !DILocation(line: 165, column: 17, scope: !643)
!652 = !DILocation(line: 171, column: 15, scope: !643)
!653 = !DILocation(line: 171, column: 29, scope: !643)
!654 = !DILocation(line: 165, column: 9, scope: !643)
!655 = !DILocation(line: 172, column: 28, scope: !610)
!656 = !DILocation(line: 172, column: 7, scope: !610)
!657 = !DILocation(line: 174, column: 9, scope: !597)
!658 = !DILocation(line: 174, column: 3, scope: !597)
!659 = !DILocalVariable(name: "program", arg: 1, scope: !76, file: !77, line: 573, type: !80)
!660 = !DILocation(line: 573, column: 34, scope: !76)
!661 = !DILocalVariable(name: "option", arg: 2, scope: !76, file: !77, line: 573, type: !80)
!662 = !DILocation(line: 573, column: 55, scope: !76)
!663 = !DILocation(line: 581, column: 7, scope: !664)
!664 = distinct !DILexicalBlock(scope: !76, file: !77, line: 581, column: 7)
!665 = !DILocation(line: 581, column: 19, scope: !664)
!666 = !DILocation(line: 581, column: 7, scope: !76)
!667 = !DILocalVariable(name: "term", scope: !668, file: !77, line: 585, type: !80)
!668 = distinct !DILexicalBlock(scope: !664, file: !77, line: 582, column: 5)
!669 = !DILocation(line: 585, column: 19, scope: !668)
!670 = !DILocation(line: 585, column: 26, scope: !668)
!671 = !DILocation(line: 586, column: 23, scope: !668)
!672 = !DILocation(line: 586, column: 28, scope: !668)
!673 = !DILocation(line: 586, column: 33, scope: !668)
!674 = !DILocation(line: 586, column: 32, scope: !668)
!675 = !DILocation(line: 586, column: 38, scope: !668)
!676 = !DILocation(line: 586, column: 48, scope: !668)
!677 = !DILocation(line: 586, column: 41, scope: !668)
!678 = !DILocation(line: 586, column: 19, scope: !668)
!679 = !DILocation(line: 587, column: 5, scope: !668)
!680 = !DILocation(line: 588, column: 7, scope: !681)
!681 = distinct !DILexicalBlock(scope: !76, file: !77, line: 588, column: 7)
!682 = !DILocation(line: 588, column: 7, scope: !76)
!683 = !DILocation(line: 590, column: 7, scope: !684)
!684 = distinct !DILexicalBlock(scope: !681, file: !77, line: 589, column: 5)
!685 = !DILocation(line: 591, column: 7, scope: !684)
!686 = !DILocalVariable(name: "double_space", scope: !76, file: !77, line: 594, type: !112)
!687 = !DILocation(line: 594, column: 8, scope: !76)
!688 = !DILocalVariable(name: "first_word", scope: !76, file: !77, line: 595, type: !80)
!689 = !DILocation(line: 595, column: 15, scope: !76)
!690 = !DILocation(line: 595, column: 28, scope: !76)
!691 = !DILocation(line: 595, column: 45, scope: !76)
!692 = !DILocation(line: 595, column: 37, scope: !76)
!693 = !DILocation(line: 595, column: 35, scope: !76)
!694 = !DILocalVariable(name: "option_text", scope: !76, file: !77, line: 596, type: !80)
!695 = !DILocation(line: 596, column: 15, scope: !76)
!696 = !DILocation(line: 596, column: 37, scope: !76)
!697 = !DILocation(line: 596, column: 29, scope: !76)
!698 = !DILocation(line: 597, column: 8, scope: !699)
!699 = distinct !DILexicalBlock(scope: !76, file: !77, line: 597, column: 7)
!700 = !DILocation(line: 597, column: 7, scope: !76)
!701 = !DILocation(line: 599, column: 21, scope: !702)
!702 = distinct !DILexicalBlock(scope: !699, file: !77, line: 598, column: 5)
!703 = !DILocation(line: 599, column: 19, scope: !702)
!704 = !DILocation(line: 602, column: 20, scope: !702)
!705 = !DILocation(line: 603, column: 5, scope: !702)
!706 = !DILocation(line: 604, column: 12, scope: !707)
!707 = distinct !DILexicalBlock(scope: !699, file: !77, line: 604, column: 12)
!708 = !DILocation(line: 604, column: 27, scope: !707)
!709 = !DILocation(line: 604, column: 24, scope: !707)
!710 = !DILocation(line: 604, column: 12, scope: !699)
!711 = !DILocalVariable(name: "s", scope: !712, file: !77, line: 608, type: !80)
!712 = distinct !DILexicalBlock(scope: !707, file: !77, line: 605, column: 5)
!713 = !DILocation(line: 608, column: 19, scope: !712)
!714 = !DILocation(line: 608, column: 23, scope: !712)
!715 = !DILocalVariable(name: "spaces", scope: !712, file: !77, line: 609, type: !153)
!716 = !DILocation(line: 609, column: 14, scope: !712)
!717 = !DILocation(line: 610, column: 7, scope: !712)
!718 = !DILocation(line: 610, column: 14, scope: !712)
!719 = !DILocation(line: 610, column: 18, scope: !712)
!720 = !DILocation(line: 610, column: 16, scope: !712)
!721 = !DILocation(line: 610, column: 30, scope: !712)
!722 = !DILocation(line: 610, column: 33, scope: !712)
!723 = !DILocation(line: 610, column: 40, scope: !712)
!724 = !DILocation(line: 0, scope: !712)
!725 = !DILocation(line: 611, column: 21, scope: !712)
!726 = !DILocation(line: 611, column: 20, scope: !712)
!727 = !DILocation(line: 611, column: 19, scope: !712)
!728 = !DILocation(line: 611, column: 16, scope: !712)
!729 = distinct !{!729, !717, !725, !730}
!730 = !{!"llvm.loop.mustprogress"}
!731 = !DILocation(line: 612, column: 11, scope: !732)
!732 = distinct !DILexicalBlock(scope: !712, file: !77, line: 612, column: 11)
!733 = !DILocation(line: 612, column: 18, scope: !732)
!734 = !DILocation(line: 612, column: 11, scope: !712)
!735 = !DILocation(line: 615, column: 25, scope: !736)
!736 = distinct !DILexicalBlock(scope: !732, file: !77, line: 613, column: 9)
!737 = !DILocation(line: 615, column: 23, scope: !736)
!738 = !DILocation(line: 616, column: 24, scope: !736)
!739 = !DILocation(line: 617, column: 9, scope: !736)
!740 = !DILocation(line: 618, column: 5, scope: !712)
!741 = !DILocalVariable(name: "anchor_len", scope: !76, file: !77, line: 620, type: !153)
!742 = !DILocation(line: 620, column: 10, scope: !76)
!743 = !DILocation(line: 620, column: 32, scope: !76)
!744 = !DILocation(line: 620, column: 23, scope: !76)
!745 = !DILocalVariable(name: "desc_text", scope: !76, file: !77, line: 625, type: !80)
!746 = !DILocation(line: 625, column: 15, scope: !76)
!747 = !DILocation(line: 625, column: 27, scope: !76)
!748 = !DILocation(line: 625, column: 41, scope: !76)
!749 = !DILocation(line: 625, column: 39, scope: !76)
!750 = !DILocation(line: 626, column: 3, scope: !76)
!751 = !DILocation(line: 626, column: 11, scope: !76)
!752 = !DILocation(line: 626, column: 10, scope: !76)
!753 = !DILocation(line: 626, column: 21, scope: !76)
!754 = !DILocation(line: 626, column: 25, scope: !76)
!755 = !DILocation(line: 626, column: 24, scope: !76)
!756 = !DILocation(line: 626, column: 35, scope: !76)
!757 = !DILocation(line: 0, scope: !76)
!758 = !DILocation(line: 628, column: 12, scope: !759)
!759 = distinct !DILexicalBlock(scope: !760, file: !77, line: 628, column: 11)
!760 = distinct !DILexicalBlock(scope: !76, file: !77, line: 627, column: 5)
!761 = !DILocation(line: 628, column: 11, scope: !759)
!762 = !DILocation(line: 628, column: 22, scope: !759)
!763 = !DILocation(line: 628, column: 29, scope: !759)
!764 = !DILocation(line: 628, column: 34, scope: !759)
!765 = !DILocation(line: 628, column: 44, scope: !759)
!766 = !DILocation(line: 628, column: 32, scope: !759)
!767 = !DILocation(line: 628, column: 49, scope: !759)
!768 = !DILocation(line: 628, column: 11, scope: !760)
!769 = !DILocation(line: 629, column: 22, scope: !759)
!770 = !DILocation(line: 629, column: 9, scope: !759)
!771 = !DILocation(line: 630, column: 11, scope: !772)
!772 = distinct !DILexicalBlock(scope: !760, file: !77, line: 630, column: 11)
!773 = !DILocation(line: 630, column: 11, scope: !760)
!774 = !DILocation(line: 632, column: 16, scope: !775)
!775 = distinct !DILexicalBlock(scope: !776, file: !77, line: 632, column: 15)
!776 = distinct !DILexicalBlock(scope: !772, file: !77, line: 631, column: 9)
!777 = !DILocation(line: 632, column: 15, scope: !775)
!778 = !DILocation(line: 632, column: 26, scope: !775)
!779 = !DILocation(line: 632, column: 34, scope: !775)
!780 = !DILocation(line: 632, column: 37, scope: !775)
!781 = !DILocation(line: 632, column: 15, scope: !776)
!782 = !DILocation(line: 633, column: 13, scope: !775)
!783 = !DILocation(line: 636, column: 16, scope: !784)
!784 = distinct !DILexicalBlock(scope: !776, file: !77, line: 636, column: 15)
!785 = !DILocation(line: 636, column: 29, scope: !784)
!786 = !DILocation(line: 636, column: 34, scope: !784)
!787 = !DILocation(line: 636, column: 44, scope: !784)
!788 = !DILocation(line: 636, column: 32, scope: !784)
!789 = !DILocation(line: 636, column: 49, scope: !784)
!790 = !DILocation(line: 636, column: 15, scope: !776)
!791 = !DILocation(line: 637, column: 13, scope: !784)
!792 = !DILocation(line: 638, column: 9, scope: !776)
!793 = !DILocation(line: 640, column: 16, scope: !760)
!794 = distinct !{!794, !750, !795, !730}
!795 = !DILocation(line: 641, column: 5, scope: !76)
!796 = !DILocation(line: 644, column: 3, scope: !76)
!797 = !DILocalVariable(name: "url_program", scope: !76, file: !77, line: 648, type: !80)
!798 = !DILocation(line: 648, column: 15, scope: !76)
!799 = !DILocation(line: 648, column: 38, scope: !76)
!800 = !DILocation(line: 648, column: 31, scope: !76)
!801 = !DILocation(line: 649, column: 38, scope: !76)
!802 = !DILocation(line: 649, column: 31, scope: !76)
!803 = !DILocation(line: 650, column: 38, scope: !76)
!804 = !DILocation(line: 650, column: 31, scope: !76)
!805 = !DILocation(line: 651, column: 38, scope: !76)
!806 = !DILocation(line: 651, column: 31, scope: !76)
!807 = !DILocation(line: 652, column: 38, scope: !76)
!808 = !DILocation(line: 652, column: 31, scope: !76)
!809 = !DILocation(line: 653, column: 38, scope: !76)
!810 = !DILocation(line: 653, column: 31, scope: !76)
!811 = !DILocation(line: 654, column: 38, scope: !76)
!812 = !DILocation(line: 654, column: 31, scope: !76)
!813 = !DILocation(line: 655, column: 38, scope: !76)
!814 = !DILocation(line: 655, column: 31, scope: !76)
!815 = !DILocation(line: 656, column: 38, scope: !76)
!816 = !DILocation(line: 656, column: 31, scope: !76)
!817 = !DILocation(line: 657, column: 38, scope: !76)
!818 = !DILocation(line: 657, column: 31, scope: !76)
!819 = !DILocation(line: 658, column: 31, scope: !76)
!820 = !DILocation(line: 663, column: 7, scope: !821)
!821 = distinct !DILexicalBlock(scope: !76, file: !77, line: 663, column: 7)
!822 = !DILocation(line: 664, column: 7, scope: !821)
!823 = !DILocation(line: 664, column: 10, scope: !821)
!824 = !DILocation(line: 663, column: 7, scope: !76)
!825 = !DILocation(line: 670, column: 15, scope: !826)
!826 = distinct !DILexicalBlock(scope: !821, file: !77, line: 665, column: 5)
!827 = !DILocation(line: 670, column: 28, scope: !826)
!828 = !DILocation(line: 670, column: 47, scope: !826)
!829 = !DILocation(line: 670, column: 41, scope: !826)
!830 = !DILocation(line: 670, column: 59, scope: !826)
!831 = !DILocation(line: 669, column: 7, scope: !826)
!832 = !DILocation(line: 671, column: 5, scope: !826)
!833 = !DILocation(line: 676, column: 48, scope: !834)
!834 = distinct !DILexicalBlock(scope: !821, file: !77, line: 673, column: 5)
!835 = !DILocation(line: 677, column: 21, scope: !834)
!836 = !DILocation(line: 677, column: 15, scope: !834)
!837 = !DILocation(line: 677, column: 33, scope: !834)
!838 = !DILocation(line: 676, column: 7, scope: !834)
!839 = !DILocation(line: 679, column: 3, scope: !76)
!840 = !DILocation(line: 683, column: 3, scope: !76)
!841 = !DILocation(line: 686, column: 3, scope: !76)
!842 = !DILocation(line: 688, column: 3, scope: !76)
!843 = !DILocation(line: 691, column: 3, scope: !76)
!844 = !DILocation(line: 695, column: 3, scope: !76)
!845 = !DILocation(line: 696, column: 1, scope: !76)
!846 = distinct !DISubprogram(name: "emit_symlink_recurse_options_", scope: !77, file: !77, line: 799, type: !78, scopeLine: 800, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !59)
!847 = !DILocalVariable(name: "program", arg: 1, scope: !846, file: !77, line: 799, type: !80)
!848 = !DILocation(line: 799, column: 44, scope: !846)
!849 = !DILocalVariable(name: "default_opt", arg: 2, scope: !846, file: !77, line: 799, type: !80)
!850 = !DILocation(line: 799, column: 65, scope: !846)
!851 = !DILocation(line: 801, column: 15, scope: !846)
!852 = !DILocation(line: 807, column: 5, scope: !846)
!853 = !DILocation(line: 801, column: 7, scope: !846)
!854 = !DILocation(line: 808, column: 15, scope: !846)
!855 = !DILocation(line: 808, column: 24, scope: !846)
!856 = !DILocation(line: 808, column: 7, scope: !846)
!857 = !DILocation(line: 812, column: 15, scope: !846)
!858 = !DILocation(line: 812, column: 24, scope: !846)
!859 = !DILocation(line: 812, column: 7, scope: !846)
!860 = !DILocation(line: 816, column: 15, scope: !846)
!861 = !DILocation(line: 816, column: 24, scope: !846)
!862 = !DILocation(line: 816, column: 7, scope: !846)
!863 = !DILocation(line: 821, column: 1, scope: !846)
!864 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !77, file: !77, line: 836, type: !865, scopeLine: 837, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !59)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !80}
!867 = !DILocalVariable(name: "program", arg: 1, scope: !864, file: !77, line: 836, type: !80)
!868 = !DILocation(line: 836, column: 34, scope: !864)
!869 = !DILocalVariable(name: "infomap", scope: !864, file: !77, line: 838, type: !870)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !871, size: 896, elements: !876)
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !864, file: !77, line: 838, size: 128, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !872, file: !77, line: 838, baseType: !80, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !872, file: !77, line: 838, baseType: !80, size: 64, offset: 64)
!876 = !{!877}
!877 = !DISubrange(count: 7)
!878 = !DILocation(line: 838, column: 67, scope: !864)
!879 = !DILocalVariable(name: "node", scope: !864, file: !77, line: 848, type: !80)
!880 = !DILocation(line: 848, column: 15, scope: !864)
!881 = !DILocation(line: 848, column: 22, scope: !864)
!882 = !DILocalVariable(name: "map_prog", scope: !864, file: !77, line: 849, type: !883)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!884 = !DILocation(line: 849, column: 25, scope: !864)
!885 = !DILocation(line: 849, column: 36, scope: !864)
!886 = !DILocation(line: 851, column: 3, scope: !864)
!887 = !DILocation(line: 851, column: 10, scope: !864)
!888 = !DILocation(line: 851, column: 20, scope: !864)
!889 = !DILocation(line: 851, column: 28, scope: !864)
!890 = !DILocation(line: 851, column: 40, scope: !864)
!891 = !DILocation(line: 851, column: 49, scope: !864)
!892 = !DILocation(line: 851, column: 59, scope: !864)
!893 = !DILocation(line: 851, column: 33, scope: !864)
!894 = !DILocation(line: 851, column: 31, scope: !864)
!895 = !DILocation(line: 0, scope: !864)
!896 = !DILocation(line: 852, column: 13, scope: !864)
!897 = distinct !{!897, !886, !896, !730}
!898 = !DILocation(line: 854, column: 7, scope: !899)
!899 = distinct !DILexicalBlock(scope: !864, file: !77, line: 854, column: 7)
!900 = !DILocation(line: 854, column: 17, scope: !899)
!901 = !DILocation(line: 854, column: 7, scope: !864)
!902 = !DILocation(line: 855, column: 12, scope: !899)
!903 = !DILocation(line: 855, column: 22, scope: !899)
!904 = !DILocation(line: 855, column: 10, scope: !899)
!905 = !DILocation(line: 855, column: 5, scope: !899)
!906 = !DILocation(line: 857, column: 3, scope: !864)
!907 = !DILocalVariable(name: "lc_messages", scope: !864, file: !77, line: 861, type: !80)
!908 = !DILocation(line: 861, column: 15, scope: !864)
!909 = !DILocation(line: 861, column: 29, scope: !864)
!910 = !DILocation(line: 862, column: 7, scope: !911)
!911 = distinct !DILexicalBlock(scope: !864, file: !77, line: 862, column: 7)
!912 = !DILocation(line: 862, column: 19, scope: !911)
!913 = !DILocation(line: 862, column: 22, scope: !911)
!914 = !DILocation(line: 862, column: 7, scope: !864)
!915 = !DILocation(line: 868, column: 7, scope: !916)
!916 = distinct !DILexicalBlock(scope: !911, file: !77, line: 863, column: 5)
!917 = !DILocation(line: 870, column: 5, scope: !916)
!918 = !DILocalVariable(name: "url_program", scope: !864, file: !77, line: 874, type: !80)
!919 = !DILocation(line: 874, column: 15, scope: !864)
!920 = !DILocation(line: 874, column: 36, scope: !864)
!921 = !DILocation(line: 874, column: 29, scope: !864)
!922 = !DILocation(line: 874, column: 61, scope: !864)
!923 = !DILocation(line: 875, column: 11, scope: !864)
!924 = !DILocation(line: 876, column: 24, scope: !864)
!925 = !DILocation(line: 875, column: 3, scope: !864)
!926 = !DILocation(line: 877, column: 11, scope: !864)
!927 = !DILocation(line: 878, column: 11, scope: !864)
!928 = !DILocation(line: 878, column: 17, scope: !864)
!929 = !DILocation(line: 878, column: 25, scope: !864)
!930 = !DILocation(line: 878, column: 22, scope: !864)
!931 = !DILocation(line: 877, column: 3, scope: !864)
!932 = !DILocation(line: 879, column: 1, scope: !864)
!933 = !DILocalVariable(name: "argc", arg: 1, scope: !55, file: !3, line: 178, type: !50)
!934 = !DILocation(line: 178, column: 11, scope: !55)
!935 = !DILocalVariable(name: "argv", arg: 2, scope: !55, file: !3, line: 178, type: !58)
!936 = !DILocation(line: 178, column: 24, scope: !55)
!937 = !DILocalVariable(name: "preserve_root", scope: !55, file: !3, line: 180, type: !112)
!938 = !DILocation(line: 180, column: 8, scope: !55)
!939 = !DILocalVariable(name: "required_uid", scope: !55, file: !3, line: 184, type: !303)
!940 = !DILocation(line: 184, column: 9, scope: !55)
!941 = !DILocalVariable(name: "required_gid", scope: !55, file: !3, line: 185, type: !305)
!942 = !DILocation(line: 185, column: 9, scope: !55)
!943 = !DILocalVariable(name: "bit_flags", scope: !55, file: !3, line: 188, type: !50)
!944 = !DILocation(line: 188, column: 7, scope: !55)
!945 = !DILocalVariable(name: "dereference", scope: !55, file: !3, line: 192, type: !50)
!946 = !DILocation(line: 192, column: 7, scope: !55)
!947 = !DILocalVariable(name: "chopt", scope: !55, file: !3, line: 194, type: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chown_option", file: !12, line: 44, size: 320, elements: !949)
!949 = !{!950, !951, !952, !954, !955, !956, !957}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !948, file: !12, line: 47, baseType: !11, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "recurse", scope: !948, file: !12, line: 50, baseType: !112, size: 8, offset: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !948, file: !12, line: 54, baseType: !953, size: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "affect_symlink_referent", scope: !948, file: !12, line: 57, baseType: !112, size: 8, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "force_silent", scope: !948, file: !12, line: 60, baseType: !112, size: 8, offset: 136)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "user_name", scope: !948, file: !12, line: 63, baseType: !47, size: 64, offset: 192)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !948, file: !12, line: 66, baseType: !47, size: 64, offset: 256)
!958 = !DILocation(line: 194, column: 23, scope: !55)
!959 = !DILocation(line: 197, column: 21, scope: !55)
!960 = !DILocation(line: 197, column: 3, scope: !55)
!961 = !DILocation(line: 198, column: 3, scope: !55)
!962 = !DILocation(line: 199, column: 3, scope: !55)
!963 = !DILocation(line: 200, column: 3, scope: !55)
!964 = !DILocation(line: 202, column: 3, scope: !55)
!965 = !DILocation(line: 204, column: 3, scope: !55)
!966 = !DILocalVariable(name: "optc", scope: !55, file: !3, line: 206, type: !50)
!967 = !DILocation(line: 206, column: 7, scope: !55)
!968 = !DILocation(line: 207, column: 3, scope: !55)
!969 = !DILocation(line: 207, column: 31, scope: !55)
!970 = !DILocation(line: 207, column: 37, scope: !55)
!971 = !DILocation(line: 207, column: 18, scope: !55)
!972 = !DILocation(line: 207, column: 16, scope: !55)
!973 = !DILocation(line: 208, column: 10, scope: !55)
!974 = !DILocation(line: 210, column: 15, scope: !975)
!975 = distinct !DILexicalBlock(scope: !55, file: !3, line: 209, column: 5)
!976 = !DILocation(line: 210, column: 7, scope: !975)
!977 = !DILocation(line: 213, column: 21, scope: !978)
!978 = distinct !DILexicalBlock(scope: !975, file: !3, line: 211, column: 9)
!979 = !DILocation(line: 214, column: 11, scope: !978)
!980 = !DILocation(line: 217, column: 21, scope: !978)
!981 = !DILocation(line: 218, column: 11, scope: !978)
!982 = !DILocation(line: 221, column: 21, scope: !978)
!983 = !DILocation(line: 222, column: 11, scope: !978)
!984 = !DILocation(line: 225, column: 23, scope: !978)
!985 = !DILocation(line: 226, column: 11, scope: !978)
!986 = !DILocation(line: 230, column: 23, scope: !978)
!987 = !DILocation(line: 231, column: 11, scope: !978)
!988 = !DILocation(line: 234, column: 25, scope: !978)
!989 = !DILocation(line: 235, column: 11, scope: !978)
!990 = !DILocation(line: 238, column: 25, scope: !978)
!991 = !DILocation(line: 239, column: 11, scope: !978)
!992 = !DILocation(line: 242, column: 28, scope: !978)
!993 = !DILocation(line: 242, column: 26, scope: !978)
!994 = !DILocation(line: 243, column: 11, scope: !978)
!995 = !DILocalVariable(name: "warn", scope: !996, file: !3, line: 247, type: !112)
!996 = distinct !DILexicalBlock(scope: !978, file: !3, line: 246, column: 11)
!997 = !DILocation(line: 247, column: 18, scope: !996)
!998 = !DILocalVariable(name: "e", scope: !996, file: !3, line: 248, type: !80)
!999 = !DILocation(line: 248, column: 25, scope: !996)
!1000 = !DILocation(line: 248, column: 51, scope: !996)
!1001 = !DILocation(line: 248, column: 29, scope: !996)
!1002 = !DILocation(line: 251, column: 17, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !996, file: !3, line: 251, column: 17)
!1004 = !DILocation(line: 251, column: 17, scope: !996)
!1005 = !DILocation(line: 252, column: 15, scope: !1003)
!1006 = !DILocalVariable(name: "__errstatus", scope: !1007, file: !3, line: 252, type: !1008)
!1007 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 252, column: 15)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!1009 = !DILocation(line: 252, column: 15, scope: !1007)
!1010 = !DILocation(line: 253, column: 13, scope: !996)
!1011 = !DILocation(line: 257, column: 17, scope: !978)
!1012 = !DILocation(line: 257, column: 25, scope: !978)
!1013 = !DILocation(line: 258, column: 11, scope: !978)
!1014 = !DILocation(line: 261, column: 17, scope: !978)
!1015 = !DILocation(line: 261, column: 27, scope: !978)
!1016 = !DILocation(line: 262, column: 11, scope: !978)
!1017 = !DILocation(line: 265, column: 17, scope: !978)
!1018 = !DILocation(line: 265, column: 30, scope: !978)
!1019 = !DILocation(line: 266, column: 11, scope: !978)
!1020 = !DILocation(line: 269, column: 17, scope: !978)
!1021 = !DILocation(line: 269, column: 27, scope: !978)
!1022 = !DILocation(line: 270, column: 11, scope: !978)
!1023 = !DILocation(line: 272, column: 9, scope: !978)
!1024 = !DILocation(line: 273, column: 9, scope: !978)
!1025 = !DILocation(line: 275, column: 11, scope: !978)
!1026 = distinct !{!1026, !968, !1027, !730}
!1027 = !DILocation(line: 277, column: 5, scope: !55)
!1028 = !DILocation(line: 279, column: 13, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !55, file: !3, line: 279, column: 7)
!1030 = !DILocation(line: 279, column: 7, scope: !55)
!1031 = !DILocation(line: 281, column: 11, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 281, column: 11)
!1033 = distinct !DILexicalBlock(scope: !1029, file: !3, line: 280, column: 5)
!1034 = !DILocation(line: 281, column: 21, scope: !1032)
!1035 = !DILocation(line: 281, column: 11, scope: !1033)
!1036 = !DILocation(line: 283, column: 15, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !3, line: 283, column: 15)
!1038 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 282, column: 9)
!1039 = !DILocation(line: 283, column: 27, scope: !1037)
!1040 = !DILocation(line: 283, column: 15, scope: !1038)
!1041 = !DILocation(line: 284, column: 13, scope: !1037)
!1042 = !DILocation(line: 286, column: 23, scope: !1038)
!1043 = !DILocation(line: 287, column: 9, scope: !1038)
!1044 = !DILocation(line: 288, column: 5, scope: !1033)
!1045 = !DILocation(line: 291, column: 17, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1029, file: !3, line: 290, column: 5)
!1047 = !DILocation(line: 293, column: 36, scope: !55)
!1048 = !DILocation(line: 293, column: 48, scope: !55)
!1049 = !DILocation(line: 293, column: 9, scope: !55)
!1050 = !DILocation(line: 293, column: 33, scope: !55)
!1051 = !DILocation(line: 295, column: 7, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !55, file: !3, line: 295, column: 7)
!1053 = !DILocation(line: 295, column: 14, scope: !1052)
!1054 = !DILocation(line: 295, column: 12, scope: !1052)
!1055 = !DILocation(line: 295, column: 24, scope: !1052)
!1056 = !DILocation(line: 295, column: 21, scope: !1052)
!1057 = !DILocation(line: 295, column: 7, scope: !55)
!1058 = !DILocation(line: 297, column: 11, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 297, column: 11)
!1060 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 296, column: 5)
!1061 = !DILocation(line: 297, column: 19, scope: !1059)
!1062 = !DILocation(line: 297, column: 16, scope: !1059)
!1063 = !DILocation(line: 297, column: 11, scope: !1060)
!1064 = !DILocation(line: 298, column: 9, scope: !1059)
!1065 = !DILocation(line: 300, column: 9, scope: !1059)
!1066 = !DILocation(line: 301, column: 7, scope: !1060)
!1067 = !DILocalVariable(name: "uid", scope: !55, file: !3, line: 304, type: !303)
!1068 = !DILocation(line: 304, column: 9, scope: !55)
!1069 = !DILocalVariable(name: "gid", scope: !55, file: !3, line: 305, type: !305)
!1070 = !DILocation(line: 305, column: 9, scope: !55)
!1071 = !DILocation(line: 307, column: 7, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !55, file: !3, line: 307, column: 7)
!1073 = !DILocation(line: 307, column: 7, scope: !55)
!1074 = !DILocalVariable(name: "ref_stats", scope: !1075, file: !3, line: 309, type: !1076)
!1075 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 308, column: 5)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !356, line: 44, size: 1024, elements: !1077)
!1077 = !{!1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1095, !1096, !1097}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1076, file: !356, line: 46, baseType: !71, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1076, file: !356, line: 47, baseType: !66, size: 64, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1076, file: !356, line: 48, baseType: !361, size: 32, offset: 128)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1076, file: !356, line: 49, baseType: !363, size: 32, offset: 160)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1076, file: !356, line: 50, baseType: !304, size: 32, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1076, file: !356, line: 51, baseType: !306, size: 32, offset: 224)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1076, file: !356, line: 52, baseType: !71, size: 64, offset: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1076, file: !356, line: 53, baseType: !71, size: 64, offset: 320)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1076, file: !356, line: 54, baseType: !369, size: 64, offset: 384)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1076, file: !356, line: 55, baseType: !371, size: 32, offset: 448)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1076, file: !356, line: 56, baseType: !50, size: 32, offset: 480)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1076, file: !356, line: 57, baseType: !374, size: 64, offset: 512)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1076, file: !356, line: 65, baseType: !1091, size: 128, offset: 576)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !377, line: 11, size: 128, elements: !1092)
!1092 = !{!1093, !1094}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1091, file: !377, line: 16, baseType: !380, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1091, file: !377, line: 21, baseType: !382, size: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1076, file: !356, line: 66, baseType: !1091, size: 128, offset: 704)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1076, file: !356, line: 67, baseType: !1091, size: 128, offset: 832)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1076, file: !356, line: 79, baseType: !386, size: 64, offset: 960)
!1098 = !DILocation(line: 309, column: 19, scope: !1075)
!1099 = !DILocation(line: 310, column: 17, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1075, file: !3, line: 310, column: 11)
!1101 = !DILocation(line: 310, column: 11, scope: !1100)
!1102 = !DILocation(line: 310, column: 11, scope: !1075)
!1103 = !DILocation(line: 311, column: 9, scope: !1100)
!1104 = !DILocation(line: 314, column: 11, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1075, file: !3, line: 314, column: 11)
!1106 = !DILocation(line: 314, column: 22, scope: !1105)
!1107 = !DILocation(line: 314, column: 11, scope: !1075)
!1108 = !DILocation(line: 316, column: 27, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 315, column: 9)
!1110 = !DILocation(line: 316, column: 15, scope: !1109)
!1111 = !DILocation(line: 317, column: 52, scope: !1109)
!1112 = !DILocation(line: 317, column: 29, scope: !1109)
!1113 = !DILocation(line: 317, column: 17, scope: !1109)
!1114 = !DILocation(line: 317, column: 27, scope: !1109)
!1115 = !DILocation(line: 318, column: 9, scope: !1109)
!1116 = !DILocation(line: 319, column: 23, scope: !1075)
!1117 = !DILocation(line: 319, column: 11, scope: !1075)
!1118 = !DILocation(line: 320, column: 49, scope: !1075)
!1119 = !DILocation(line: 320, column: 26, scope: !1075)
!1120 = !DILocation(line: 320, column: 13, scope: !1075)
!1121 = !DILocation(line: 320, column: 24, scope: !1075)
!1122 = !DILocation(line: 321, column: 5, scope: !1075)
!1123 = !DILocalVariable(name: "ug", scope: !1124, file: !3, line: 324, type: !47)
!1124 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 323, column: 5)
!1125 = !DILocation(line: 324, column: 13, scope: !1124)
!1126 = !DILocation(line: 324, column: 18, scope: !1124)
!1127 = !DILocation(line: 324, column: 23, scope: !1124)
!1128 = !DILocation(line: 325, column: 11, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1124, file: !3, line: 325, column: 11)
!1130 = !DILocation(line: 325, column: 22, scope: !1129)
!1131 = !DILocation(line: 325, column: 11, scope: !1124)
!1132 = !DILocation(line: 327, column: 37, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1129, file: !3, line: 326, column: 9)
!1134 = !DILocation(line: 327, column: 42, scope: !1133)
!1135 = !DILocation(line: 327, column: 29, scope: !1133)
!1136 = !DILocation(line: 327, column: 27, scope: !1133)
!1137 = !DILocation(line: 327, column: 51, scope: !1133)
!1138 = !DILocation(line: 327, column: 16, scope: !1133)
!1139 = !DILocation(line: 327, column: 14, scope: !1133)
!1140 = !DILocation(line: 328, column: 27, scope: !1133)
!1141 = !DILocation(line: 328, column: 19, scope: !1133)
!1142 = !DILocation(line: 328, column: 37, scope: !1133)
!1143 = !DILocation(line: 328, column: 42, scope: !1133)
!1144 = !DILocation(line: 328, column: 11, scope: !1133)
!1145 = !DILocation(line: 329, column: 9, scope: !1133)
!1146 = !DILocalVariable(name: "warn", scope: !1124, file: !3, line: 331, type: !112)
!1147 = !DILocation(line: 331, column: 12, scope: !1124)
!1148 = !DILocalVariable(name: "e", scope: !1124, file: !3, line: 332, type: !80)
!1149 = !DILocation(line: 332, column: 19, scope: !1124)
!1150 = !DILocation(line: 332, column: 45, scope: !1124)
!1151 = !DILocation(line: 333, column: 52, scope: !1124)
!1152 = !DILocation(line: 334, column: 52, scope: !1124)
!1153 = !DILocation(line: 332, column: 23, scope: !1124)
!1154 = !DILocation(line: 336, column: 11, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1124, file: !3, line: 336, column: 11)
!1156 = !DILocation(line: 336, column: 17, scope: !1155)
!1157 = !DILocation(line: 336, column: 22, scope: !1155)
!1158 = !DILocation(line: 336, column: 14, scope: !1155)
!1159 = !DILocation(line: 336, column: 11, scope: !1124)
!1160 = !DILocation(line: 337, column: 15, scope: !1155)
!1161 = !DILocation(line: 337, column: 9, scope: !1155)
!1162 = !DILocation(line: 339, column: 11, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1124, file: !3, line: 339, column: 11)
!1164 = !DILocation(line: 339, column: 11, scope: !1124)
!1165 = !DILocation(line: 340, column: 9, scope: !1163)
!1166 = !DILocalVariable(name: "__errstatus", scope: !1167, file: !3, line: 340, type: !1008)
!1167 = distinct !DILexicalBlock(scope: !1163, file: !3, line: 340, column: 9)
!1168 = !DILocation(line: 340, column: 9, scope: !1167)
!1169 = !DILocation(line: 345, column: 11, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1124, file: !3, line: 345, column: 11)
!1171 = !DILocation(line: 345, column: 22, scope: !1170)
!1172 = !DILocation(line: 345, column: 37, scope: !1170)
!1173 = !DILocation(line: 345, column: 47, scope: !1170)
!1174 = !DILocation(line: 345, column: 41, scope: !1170)
!1175 = !DILocation(line: 345, column: 57, scope: !1170)
!1176 = !DILocation(line: 345, column: 66, scope: !1170)
!1177 = !DILocation(line: 345, column: 60, scope: !1170)
!1178 = !DILocation(line: 345, column: 11, scope: !1124)
!1179 = !DILocation(line: 346, column: 27, scope: !1170)
!1180 = !DILocation(line: 346, column: 15, scope: !1170)
!1181 = !DILocation(line: 346, column: 25, scope: !1170)
!1182 = !DILocation(line: 346, column: 9, scope: !1170)
!1183 = !DILocation(line: 348, column: 13, scope: !1124)
