; ModuleID = 'src/pwd.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [60 x i8] c"Print the full filename of the current working directory.\0A\0A\00", align 1

!9 = !DIEnumerator(name: "_ISupper", value: 256)
!10 = !DIEnumerator(name: "_ISlower", value: 512)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!14 = !DIEnumerator(name: "_ISspace", value: 8192)
!15 = !DIEnumerator(name: "_ISprint", value: 16384)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768)
!17 = !DIEnumerator(name: "_ISblank", value: 1)
!18 = !DIEnumerator(name: "_IScntrl", value: 2)
!19 = !DIEnumerator(name: "_ISpunct", value: 4)
!20 = !DIEnumerator(name: "_ISalnum", value: 8)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !22, line: 42, baseType: !7, size: 32, elements: !23)
!22 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!24 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!25 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!26 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!27 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!28 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!29 = !DIEnumerator(name: "c_quoting_style", value: 5)
!30 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!31 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!32 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!33 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!34 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 120, baseType: !7, size: 32, elements: !37)
!36 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!37 = !{!38}
!38 = !DIEnumerator(name: "NOT_AN_INODE_NUMBER", value: 0)
!39 = !{!40, !41, !43, !44, !45, !48, !50}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!44 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !46, line: 46, baseType: !47)
!46 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!47 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!50 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!51 = !{!52, !0}
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !54, file: !36, line: 575, type: !43, isLocal: true, isDefinition: true)
!54 = distinct !DISubprogram(name: "oputs_", scope: !36, file: !36, line: 573, type: !55, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !57)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !48, !48}
!57 = !{!58, !59, !60, !63, !65, !66, !67, !71, !72, !73, !74, !76, !132, !133, !134, !136, !137}
!58 = !DILocalVariable(name: "program", arg: 1, scope: !54, file: !36, line: 573, type: !48)
!59 = !DILocalVariable(name: "option", arg: 2, scope: !54, file: !36, line: 573, type: !48)
!60 = !DILocalVariable(name: "term", scope: !61, file: !36, line: 585, type: !48)
!61 = distinct !DILexicalBlock(scope: !62, file: !36, line: 582, column: 5)
!62 = distinct !DILexicalBlock(scope: !54, file: !36, line: 581, column: 7)
!63 = !DILocalVariable(name: "double_space", scope: !54, file: !36, line: 594, type: !64)
!64 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!65 = !DILocalVariable(name: "first_word", scope: !54, file: !36, line: 595, type: !48)
!66 = !DILocalVariable(name: "option_text", scope: !54, file: !36, line: 596, type: !48)
!67 = !DILocalVariable(name: "s", scope: !68, file: !36, line: 608, type: !48)
!68 = distinct !DILexicalBlock(scope: !69, file: !36, line: 605, column: 5)
!69 = distinct !DILexicalBlock(scope: !70, file: !36, line: 604, column: 12)
!70 = distinct !DILexicalBlock(scope: !54, file: !36, line: 597, column: 7)
!71 = !DILocalVariable(name: "spaces", scope: !68, file: !36, line: 609, type: !45)
!72 = !DILocalVariable(name: "anchor_len", scope: !54, file: !36, line: 620, type: !45)
!73 = !DILocalVariable(name: "desc_text", scope: !54, file: !36, line: 625, type: !48)
!74 = !DILocalVariable(name: "__ptr", scope: !75, file: !36, line: 644, type: !48)
!75 = distinct !DILexicalBlock(scope: !54, file: !36, line: 644, column: 3)
!76 = !DILocalVariable(name: "__stream", scope: !75, file: !36, line: 644, type: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !79, line: 7, baseType: !80)
!79 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !81, line: 49, size: 1728, elements: !82)
!81 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !98, !100, !101, !102, !106, !107, !109, !113, !116, !118, !121, !124, !125, !126, !127, !128}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !80, file: !81, line: 51, baseType: !43, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !80, file: !81, line: 54, baseType: !41, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !80, file: !81, line: 55, baseType: !41, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !80, file: !81, line: 56, baseType: !41, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !80, file: !81, line: 57, baseType: !41, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !80, file: !81, line: 58, baseType: !41, size: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !80, file: !81, line: 59, baseType: !41, size: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !80, file: !81, line: 60, baseType: !41, size: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !80, file: !81, line: 61, baseType: !41, size: 64, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !80, file: !81, line: 64, baseType: !41, size: 64, offset: 576)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !80, file: !81, line: 65, baseType: !41, size: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !80, file: !81, line: 66, baseType: !41, size: 64, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !80, file: !81, line: 68, baseType: !96, size: 64, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !81, line: 36, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !80, file: !81, line: 70, baseType: !99, size: 64, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !80, file: !81, line: 72, baseType: !43, size: 32, offset: 896)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !80, file: !81, line: 73, baseType: !43, size: 32, offset: 928)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !80, file: !81, line: 74, baseType: !103, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !104, line: 152, baseType: !105)
!104 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!105 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !80, file: !81, line: 77, baseType: !44, size: 16, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !80, file: !81, line: 78, baseType: !108, size: 8, offset: 1040)
!108 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !80, file: !81, line: 79, baseType: !110, size: 8, offset: 1048)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 1)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !80, file: !81, line: 81, baseType: !114, size: 64, offset: 1088)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !81, line: 43, baseType: null)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !80, file: !81, line: 89, baseType: !117, size: 64, offset: 1152)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !104, line: 153, baseType: !105)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !80, file: !81, line: 91, baseType: !119, size: 64, offset: 1216)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !81, line: 37, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !80, file: !81, line: 92, baseType: !122, size: 64, offset: 1280)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !81, line: 38, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !80, file: !81, line: 93, baseType: !99, size: 64, offset: 1344)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !80, file: !81, line: 94, baseType: !40, size: 64, offset: 1408)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !80, file: !81, line: 95, baseType: !45, size: 64, offset: 1472)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !80, file: !81, line: 96, baseType: !43, size: 32, offset: 1536)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !80, file: !81, line: 98, baseType: !129, size: 160, offset: 1568)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 160, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 20)
!132 = !DILocalVariable(name: "__cnt", scope: !75, file: !36, line: 644, type: !45)
!133 = !DILocalVariable(name: "url_program", scope: !54, file: !36, line: 648, type: !48)
!134 = !DILocalVariable(name: "__ptr", scope: !135, file: !36, line: 686, type: !48)
!135 = distinct !DILexicalBlock(scope: !54, file: !36, line: 686, column: 3)
!136 = !DILocalVariable(name: "__stream", scope: !135, file: !36, line: 686, type: !77)
!137 = !DILocalVariable(name: "__cnt", scope: !135, file: !36, line: 686, type: !45)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 1280, elements: !148)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !141, line: 50, size: 256, elements: !142)
!141 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!142 = !{!143, !144, !145, !147}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !141, line: 52, baseType: !48, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !140, file: !141, line: 55, baseType: !43, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !140, file: !141, line: 56, baseType: !146, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !140, file: !141, line: 57, baseType: !43, size: 32, offset: 192)
!148 = !{!149}
!149 = !DISubrange(count: 5)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "Version", scope: !152, file: !153, line: 3, type: !48, isLocal: false, isDefinition: true)
!152 = distinct !DICompileUnit(language: DW_LANG_C99, file: !153, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !154, splitDebugInlining: false, nameTableKind: None)
!153 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!154 = !{!150}
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "file_name", scope: !157, file: !158, line: 45, type: !48, isLocal: true, isDefinition: true)
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !159, splitDebugInlining: false, nameTableKind: None)
!158 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!159 = !{!155, !160}
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !157, file: !158, line: 55, type: !64, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !164, file: !165, line: 66, type: !200, isLocal: false, isDefinition: true)
!164 = distinct !DICompileUnit(language: DW_LANG_C99, file: !165, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !166, globals: !167, splitDebugInlining: false, nameTableKind: None)
!165 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!166 = !{!40, !50}
!167 = !{!168, !194, !162, !196, !198}
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "old_file_name", scope: !170, file: !165, line: 304, type: !48, isLocal: true, isDefinition: true)
!170 = distinct !DISubprogram(name: "verror_at_line", scope: !165, file: !165, line: 298, type: !171, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !164, retainedNodes: !187)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !43, !43, !48, !7, !48, !173}
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !174, line: 52, baseType: !175)
!174 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !176, line: 32, baseType: !177)
!176 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !178, baseType: !179)
!178 = !DIFile(filename: "lib/error.c", directory: "/src")
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !180, size: 256, elements: !181)
!180 = !DINamespace(name: "std", scope: null)
!181 = !{!182, !183, !184, !185, !186}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !179, file: !178, baseType: !40, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !179, file: !178, baseType: !40, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !179, file: !178, baseType: !40, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !179, file: !178, baseType: !43, size: 32, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !179, file: !178, baseType: !43, size: 32, offset: 224)
!187 = !{!188, !189, !190, !191, !192, !193}
!188 = !DILocalVariable(name: "status", arg: 1, scope: !170, file: !165, line: 298, type: !43)
!189 = !DILocalVariable(name: "errnum", arg: 2, scope: !170, file: !165, line: 298, type: !43)
!190 = !DILocalVariable(name: "file_name", arg: 3, scope: !170, file: !165, line: 298, type: !48)
!191 = !DILocalVariable(name: "line_number", arg: 4, scope: !170, file: !165, line: 298, type: !7)
!192 = !DILocalVariable(name: "message", arg: 5, scope: !170, file: !165, line: 298, type: !48)
!193 = !DILocalVariable(name: "args", arg: 6, scope: !170, file: !165, line: 298, type: !173)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "old_line_number", scope: !170, file: !165, line: 305, type: !7, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "error_message_count", scope: !164, file: !165, line: 69, type: !7, isLocal: false, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !164, file: !165, line: 295, type: !43, isLocal: false, isDefinition: true)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null}
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "program_name", scope: !205, file: !206, line: 31, type: !48, isLocal: false, isDefinition: true)
!205 = distinct !DICompileUnit(language: DW_LANG_C99, file: !206, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !207, globals: !208, splitDebugInlining: false, nameTableKind: None)
!206 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!207 = !{!41}
!208 = !{!203}
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "utf07FF", scope: !211, file: !212, line: 46, type: !242, isLocal: true, isDefinition: true)
!211 = distinct !DISubprogram(name: "proper_name_lite", scope: !212, file: !212, line: 38, type: !213, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !215, retainedNodes: !217)
!212 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!213 = !DISubroutineType(types: !214)
!214 = !{!48, !48, !48}
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !212, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !216, splitDebugInlining: false, nameTableKind: None)
!216 = !{!209}
!217 = !{!218, !219, !220, !221, !226}
!218 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !211, file: !212, line: 38, type: !48)
!219 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !211, file: !212, line: 38, type: !48)
!220 = !DILocalVariable(name: "translation", scope: !211, file: !212, line: 40, type: !48)
!221 = !DILocalVariable(name: "w", scope: !211, file: !212, line: 47, type: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !223, line: 37, baseType: !224)
!223 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !104, line: 57, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !104, line: 42, baseType: !7)
!226 = !DILocalVariable(name: "mbs", scope: !211, file: !212, line: 48, type: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !228, line: 6, baseType: !229)
!228 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !230, line: 21, baseType: !231)
!230 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !230, line: 13, size: 64, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !231, file: !230, line: 15, baseType: !43, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !231, file: !230, line: 20, baseType: !235, size: 32, offset: 32)
!235 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !231, file: !230, line: 16, size: 32, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !235, file: !230, line: 18, baseType: !7, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !235, file: !230, line: 19, baseType: !239, size: 32)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 32, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 4)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 16, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 2)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !247, file: !248, line: 76, type: !316, isLocal: false, isDefinition: true)
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !249, retainedTypes: !255, globals: !256, splitDebugInlining: false, nameTableKind: None)
!248 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!249 = !{!21, !250, !5}
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !22, line: 254, baseType: !7, size: 32, elements: !251)
!251 = !{!252, !253, !254}
!252 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!253 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!254 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!255 = !{!43, !44, !45}
!256 = !{!245, !257, !263, !275, !277, !282, !305, !312, !314}
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !247, file: !248, line: 92, type: !259, isLocal: false, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 320, elements: !261)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!261 = !{!262}
!262 = !DISubrange(count: 10)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !247, file: !248, line: 1040, type: !265, isLocal: false, isDefinition: true)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !248, line: 56, size: 448, elements: !266)
!266 = !{!267, !268, !269, !273, !274}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !265, file: !248, line: 59, baseType: !21, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !265, file: !248, line: 62, baseType: !43, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !265, file: !248, line: 66, baseType: !270, size: 256, offset: 64)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 8)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !265, file: !248, line: 69, baseType: !48, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !265, file: !248, line: 72, baseType: !48, size: 64, offset: 384)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !247, file: !248, line: 107, type: !265, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "slot0", scope: !247, file: !248, line: 831, type: !279, isLocal: true, isDefinition: true)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 2048, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 256)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "quote", scope: !284, file: !248, line: 228, type: !303, isLocal: true, isDefinition: true)
!284 = distinct !DISubprogram(name: "gettext_quote", scope: !248, file: !248, line: 197, type: !285, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !247, retainedNodes: !287)
!285 = !DISubroutineType(types: !286)
!286 = !{!48, !48, !21}
!287 = !{!288, !289, !290, !291, !292}
!288 = !DILocalVariable(name: "msgid", arg: 1, scope: !284, file: !248, line: 197, type: !48)
!289 = !DILocalVariable(name: "s", arg: 2, scope: !284, file: !248, line: 197, type: !21)
!290 = !DILocalVariable(name: "translation", scope: !284, file: !248, line: 199, type: !48)
!291 = !DILocalVariable(name: "w", scope: !284, file: !248, line: 229, type: !222)
!292 = !DILocalVariable(name: "mbs", scope: !284, file: !248, line: 230, type: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !228, line: 6, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !230, line: 21, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !230, line: 13, size: 64, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !295, file: !230, line: 15, baseType: !43, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !295, file: !230, line: 20, baseType: !299, size: 32, offset: 32)
!299 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !295, file: !230, line: 16, size: 32, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !299, file: !230, line: 18, baseType: !7, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !299, file: !230, line: 19, baseType: !239, size: 32)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 64, elements: !304)
!304 = !{!244, !241}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "slotvec", scope: !247, file: !248, line: 834, type: !307, isLocal: true, isDefinition: true)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !248, line: 823, size: 128, elements: !309)
!309 = !{!310, !311}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !308, file: !248, line: 825, baseType: !45, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !308, file: !248, line: 826, baseType: !41, size: 64, offset: 64)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "nslots", scope: !247, file: !248, line: 832, type: !43, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "slotvec0", scope: !247, file: !248, line: 833, type: !308, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 704, elements: !318)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!318 = !{!319}
!319 = !DISubrange(count: 11)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !322, file: !323, line: 26, type: !325, isLocal: false, isDefinition: true)
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !324, splitDebugInlining: false, nameTableKind: None)
!323 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!324 = !{!320}
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 376, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 47)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "exit_failure", scope: !330, file: !331, line: 24, type: !333, isLocal: false, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C99, file: !331, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !332, splitDebugInlining: false, nameTableKind: None)
!331 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!332 = !{!328}
!333 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !43)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "internal_state", scope: !336, file: !337, line: 97, type: !340, isLocal: true, isDefinition: true)
!336 = distinct !DICompileUnit(language: DW_LANG_C99, file: !337, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !338, globals: !339, splitDebugInlining: false, nameTableKind: None)
!337 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!338 = !{!40, !45, !50}
!339 = !{!334}
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !228, line: 6, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !230, line: 21, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !230, line: 13, size: 64, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !342, file: !230, line: 15, baseType: !43, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !342, file: !230, line: 20, baseType: !346, size: 32, offset: 32)
!346 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !342, file: !230, line: 16, size: 32, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !346, file: !230, line: 18, baseType: !7, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !346, file: !230, line: 19, baseType: !239, size: 32)
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!352 = distinct !DICompileUnit(language: DW_LANG_C99, file: !353, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!353 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b0632229108c1521929601778d55996f")
!354 = distinct !DICompileUnit(language: DW_LANG_C99, file: !355, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !356, retainedTypes: !360, splitDebugInlining: false, nameTableKind: None)
!355 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!356 = !{!357}
!357 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !355, line: 40, baseType: !7, size: 32, elements: !358)
!358 = !{!359}
!359 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!360 = !{!40}
!361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !362, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !363, retainedTypes: !394, splitDebugInlining: false, nameTableKind: None)
!362 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!363 = !{!364, !376}
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !365, file: !362, line: 188, baseType: !7, size: 32, elements: !374)
!365 = distinct !DISubprogram(name: "x2nrealloc", scope: !362, file: !362, line: 176, type: !366, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !361, retainedNodes: !369)
!366 = !DISubroutineType(types: !367)
!367 = !{!40, !40, !368, !45}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!369 = !{!370, !371, !372, !373}
!370 = !DILocalVariable(name: "p", arg: 1, scope: !365, file: !362, line: 176, type: !40)
!371 = !DILocalVariable(name: "pn", arg: 2, scope: !365, file: !362, line: 176, type: !368)
!372 = !DILocalVariable(name: "s", arg: 3, scope: !365, file: !362, line: 176, type: !45)
!373 = !DILocalVariable(name: "n", scope: !365, file: !362, line: 178, type: !45)
!374 = !{!375}
!375 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !377, file: !362, line: 228, baseType: !7, size: 32, elements: !374)
!377 = distinct !DISubprogram(name: "xpalloc", scope: !362, file: !362, line: 223, type: !378, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !361, retainedNodes: !384)
!378 = !DISubroutineType(types: !379)
!379 = !{!40, !40, !380, !381, !383, !381}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !382, line: 130, baseType: !383)
!382 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !46, line: 35, baseType: !105)
!384 = !{!385, !386, !387, !388, !389, !390, !391, !392, !393}
!385 = !DILocalVariable(name: "pa", arg: 1, scope: !377, file: !362, line: 223, type: !40)
!386 = !DILocalVariable(name: "pn", arg: 2, scope: !377, file: !362, line: 223, type: !380)
!387 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !377, file: !362, line: 223, type: !381)
!388 = !DILocalVariable(name: "n_max", arg: 4, scope: !377, file: !362, line: 223, type: !383)
!389 = !DILocalVariable(name: "s", arg: 5, scope: !377, file: !362, line: 223, type: !381)
!390 = !DILocalVariable(name: "n0", scope: !377, file: !362, line: 230, type: !381)
!391 = !DILocalVariable(name: "n", scope: !377, file: !362, line: 237, type: !381)
!392 = !DILocalVariable(name: "nbytes", scope: !377, file: !362, line: 248, type: !381)
!393 = !DILocalVariable(name: "adjusted_nbytes", scope: !377, file: !362, line: 252, type: !381)
!394 = !{!41, !40, !64, !105, !47}
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!396 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!398 = !DIFile(filename: "lib/xgetcwd.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3727157833d2e1ec9b24b353bc14eccb")
!399 = distinct !DICompileUnit(language: DW_LANG_C99, file: !400, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!400 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!402 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !360, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!405 = distinct !DICompileUnit(language: DW_LANG_C99, file: !406, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !360, splitDebugInlining: false, nameTableKind: None)
!406 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!407 = distinct !DICompileUnit(language: DW_LANG_C99, file: !408, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !409, splitDebugInlining: false, nameTableKind: None)
!408 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!409 = !{!64, !47, !40}
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!412 = distinct !DICompileUnit(language: DW_LANG_C99, file: !413, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!413 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !360, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!416 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!417 = !{i32 7, !"Dwarf Version", i32 5}
!418 = !{i32 2, !"Debug Info Version", i32 3}
!419 = !{i32 1, !"wchar_size", i32 4}
!420 = !{i32 1, !"branch-target-enforcement", i32 0}
!421 = !{i32 1, !"sign-return-address", i32 0}
!422 = !{i32 1, !"sign-return-address-all", i32 0}
!423 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!424 = !{i32 7, !"PIC Level", i32 2}
!425 = !{i32 7, !"PIE Level", i32 2}
!426 = !{i32 7, !"uwtable", i32 1}
!427 = !{i32 7, !"frame-pointer", i32 1}
!428 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 49, type: !429, scopeLine: 50, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !431)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !43}
!431 = !{!432}
!432 = !DILocalVariable(name: "status", arg: 1, scope: !428, file: !3, line: 49, type: !43)
!433 = !DILocation(line: 0, scope: !428)
!434 = !DILocation(line: 51, column: 14, scope: !435)
!435 = distinct !DILexicalBlock(scope: !428, file: !3, line: 51, column: 7)
!436 = !DILocation(line: 51, column: 7, scope: !428)
!437 = !DILocation(line: 52, column: 5, scope: !438)
!438 = distinct !DILexicalBlock(scope: !435, file: !3, line: 52, column: 5)
!439 = !{!440, !440, i64 0}
!440 = !{!"any pointer", !441, i64 0}
!441 = !{!"omnipotent char", !442, i64 0}
!442 = !{!"Simple C/C++ TBAA"}
!443 = !DILocation(line: 55, column: 7, scope: !444)
!444 = distinct !DILexicalBlock(scope: !435, file: !3, line: 54, column: 5)
!445 = !DILocation(line: 56, column: 7, scope: !444)
!446 = !DILocation(line: 60, column: 7, scope: !444)
!447 = !DILocation(line: 64, column: 7, scope: !444)
!448 = !DILocation(line: 68, column: 7, scope: !444)
!449 = !DILocation(line: 69, column: 7, scope: !444)
!450 = !DILocation(line: 70, column: 7, scope: !444)
!451 = !DILocation(line: 73, column: 7, scope: !444)
!452 = !DILocalVariable(name: "program", arg: 1, scope: !453, file: !36, line: 836, type: !48)
!453 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !36, file: !36, line: 836, type: !454, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !456)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !48}
!456 = !{!452, !457, !466, !467, !469, !470}
!457 = !DILocalVariable(name: "infomap", scope: !453, file: !36, line: 838, type: !458)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 896, elements: !464)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !453, file: !36, line: 838, size: 128, elements: !461)
!461 = !{!462, !463}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !460, file: !36, line: 838, baseType: !48, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !460, file: !36, line: 838, baseType: !48, size: 64, offset: 64)
!464 = !{!465}
!465 = !DISubrange(count: 7)
!466 = !DILocalVariable(name: "node", scope: !453, file: !36, line: 848, type: !48)
!467 = !DILocalVariable(name: "map_prog", scope: !453, file: !36, line: 849, type: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!469 = !DILocalVariable(name: "lc_messages", scope: !453, file: !36, line: 861, type: !48)
!470 = !DILocalVariable(name: "url_program", scope: !453, file: !36, line: 874, type: !48)
!471 = !DILocation(line: 0, scope: !453, inlinedAt: !472)
!472 = distinct !DILocation(line: 74, column: 7, scope: !444)
!473 = !DILocation(line: 838, column: 3, scope: !453, inlinedAt: !472)
!474 = !DILocation(line: 838, column: 67, scope: !453, inlinedAt: !472)
!475 = !DILocation(line: 849, column: 36, scope: !453, inlinedAt: !472)
!476 = !DILocation(line: 851, column: 3, scope: !453, inlinedAt: !472)
!477 = !DILocalVariable(name: "__s1", arg: 1, scope: !478, file: !479, line: 1359, type: !48)
!478 = distinct !DISubprogram(name: "streq", scope: !479, file: !479, line: 1359, type: !480, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !482)
!479 = !DIFile(filename: "./lib/string.h", directory: "/src")
!480 = !DISubroutineType(types: !481)
!481 = !{!64, !48, !48}
!482 = !{!477, !483}
!483 = !DILocalVariable(name: "__s2", arg: 2, scope: !478, file: !479, line: 1359, type: !48)
!484 = !DILocation(line: 0, scope: !478, inlinedAt: !485)
!485 = distinct !DILocation(line: 851, column: 33, scope: !453, inlinedAt: !472)
!486 = !DILocation(line: 1361, column: 11, scope: !478, inlinedAt: !485)
!487 = !DILocation(line: 1361, column: 10, scope: !478, inlinedAt: !485)
!488 = !DILocation(line: 852, column: 13, scope: !453, inlinedAt: !472)
!489 = !DILocation(line: 851, column: 20, scope: !453, inlinedAt: !472)
!490 = !{!491, !440, i64 0}
!491 = !{!"infomap", !440, i64 0, !440, i64 8}
!492 = !DILocation(line: 851, column: 10, scope: !453, inlinedAt: !472)
!493 = !DILocation(line: 851, column: 28, scope: !453, inlinedAt: !472)
!494 = distinct !{!494, !476, !488, !495}
!495 = !{!"llvm.loop.mustprogress"}
!496 = !DILocation(line: 854, column: 17, scope: !497, inlinedAt: !472)
!497 = distinct !DILexicalBlock(scope: !453, file: !36, line: 854, column: 7)
!498 = !{!491, !440, i64 8}
!499 = !DILocation(line: 854, column: 7, scope: !497, inlinedAt: !472)
!500 = !DILocation(line: 854, column: 7, scope: !453, inlinedAt: !472)
!501 = !DILocation(line: 857, column: 3, scope: !453, inlinedAt: !472)
!502 = !DILocation(line: 861, column: 29, scope: !453, inlinedAt: !472)
!503 = !DILocation(line: 862, column: 7, scope: !504, inlinedAt: !472)
!504 = distinct !DILexicalBlock(scope: !453, file: !36, line: 862, column: 7)
!505 = !DILocation(line: 862, column: 19, scope: !504, inlinedAt: !472)
!506 = !DILocation(line: 862, column: 22, scope: !504, inlinedAt: !472)
!507 = !DILocation(line: 862, column: 7, scope: !453, inlinedAt: !472)
!508 = !DILocation(line: 868, column: 7, scope: !509, inlinedAt: !472)
!509 = distinct !DILexicalBlock(scope: !504, file: !36, line: 863, column: 5)
!510 = !DILocation(line: 870, column: 5, scope: !509, inlinedAt: !472)
!511 = !DILocation(line: 0, scope: !478, inlinedAt: !512)
!512 = distinct !DILocation(line: 874, column: 29, scope: !453, inlinedAt: !472)
!513 = !DILocation(line: 875, column: 3, scope: !453, inlinedAt: !472)
!514 = !DILocation(line: 877, column: 3, scope: !453, inlinedAt: !472)
!515 = !DILocation(line: 879, column: 1, scope: !453, inlinedAt: !472)
!516 = !DILocation(line: 76, column: 3, scope: !428)
!517 = !DISubprogram(name: "dcgettext", scope: !518, file: !518, line: 51, type: !519, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !521)
!518 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!519 = !DISubroutineType(types: !520)
!520 = !{!41, !48, !48, !43}
!521 = !{}
!522 = !DISubprogram(name: "fputs_unlocked", scope: !174, file: !174, line: 691, type: !523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !521)
!523 = !DISubroutineType(types: !524)
!524 = !{!43, !525, !526}
!525 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !48)
!526 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !77)
!527 = !DILocation(line: 0, scope: !54)
!528 = !DILocation(line: 581, column: 7, scope: !62)
!529 = !{!530, !530, i64 0}
!530 = !{!"int", !441, i64 0}
!531 = !DILocation(line: 581, column: 19, scope: !62)
!532 = !DILocation(line: 581, column: 7, scope: !54)
!533 = !DILocation(line: 585, column: 26, scope: !61)
!534 = !DILocation(line: 0, scope: !61)
!535 = !DILocation(line: 586, column: 23, scope: !61)
!536 = !DILocation(line: 586, column: 28, scope: !61)
!537 = !DILocation(line: 586, column: 32, scope: !61)
!538 = !{!441, !441, i64 0}
!539 = !DILocation(line: 586, column: 38, scope: !61)
!540 = !DILocation(line: 0, scope: !478, inlinedAt: !541)
!541 = distinct !DILocation(line: 586, column: 41, scope: !61)
!542 = !DILocation(line: 1361, column: 11, scope: !478, inlinedAt: !541)
!543 = !DILocation(line: 1361, column: 10, scope: !478, inlinedAt: !541)
!544 = !DILocation(line: 586, column: 19, scope: !61)
!545 = !DILocation(line: 587, column: 5, scope: !61)
!546 = !DILocation(line: 588, column: 7, scope: !547)
!547 = distinct !DILexicalBlock(scope: !54, file: !36, line: 588, column: 7)
!548 = !DILocation(line: 588, column: 7, scope: !54)
!549 = !DILocation(line: 590, column: 7, scope: !550)
!550 = distinct !DILexicalBlock(scope: !547, file: !36, line: 589, column: 5)
!551 = !DILocation(line: 591, column: 7, scope: !550)
!552 = !DILocation(line: 595, column: 37, scope: !54)
!553 = !DILocation(line: 595, column: 35, scope: !54)
!554 = !DILocation(line: 596, column: 29, scope: !54)
!555 = !DILocation(line: 597, column: 8, scope: !70)
!556 = !DILocation(line: 597, column: 7, scope: !54)
!557 = !DILocation(line: 604, column: 24, scope: !69)
!558 = !DILocation(line: 604, column: 12, scope: !70)
!559 = !DILocation(line: 0, scope: !68)
!560 = !DILocation(line: 610, column: 16, scope: !68)
!561 = !DILocation(line: 610, column: 7, scope: !68)
!562 = !DILocation(line: 611, column: 21, scope: !68)
!563 = !{!564, !564, i64 0}
!564 = !{!"short", !441, i64 0}
!565 = !DILocation(line: 611, column: 19, scope: !68)
!566 = !DILocation(line: 611, column: 16, scope: !68)
!567 = !DILocation(line: 610, column: 30, scope: !68)
!568 = distinct !{!568, !561, !562, !495}
!569 = !DILocation(line: 612, column: 18, scope: !570)
!570 = distinct !DILexicalBlock(scope: !68, file: !36, line: 612, column: 11)
!571 = !DILocation(line: 612, column: 11, scope: !68)
!572 = !DILocation(line: 620, column: 23, scope: !54)
!573 = !DILocation(line: 625, column: 39, scope: !54)
!574 = !DILocation(line: 626, column: 3, scope: !54)
!575 = !DILocation(line: 626, column: 10, scope: !54)
!576 = !DILocation(line: 626, column: 21, scope: !54)
!577 = !DILocation(line: 628, column: 44, scope: !578)
!578 = distinct !DILexicalBlock(scope: !579, file: !36, line: 628, column: 11)
!579 = distinct !DILexicalBlock(scope: !54, file: !36, line: 627, column: 5)
!580 = !DILocation(line: 628, column: 32, scope: !578)
!581 = !DILocation(line: 628, column: 49, scope: !578)
!582 = !DILocation(line: 628, column: 11, scope: !579)
!583 = !DILocation(line: 630, column: 11, scope: !584)
!584 = distinct !DILexicalBlock(scope: !579, file: !36, line: 630, column: 11)
!585 = !DILocation(line: 630, column: 11, scope: !579)
!586 = !DILocation(line: 632, column: 26, scope: !587)
!587 = distinct !DILexicalBlock(scope: !588, file: !36, line: 632, column: 15)
!588 = distinct !DILexicalBlock(scope: !584, file: !36, line: 631, column: 9)
!589 = !DILocation(line: 632, column: 34, scope: !587)
!590 = !DILocation(line: 632, column: 37, scope: !587)
!591 = !DILocation(line: 632, column: 15, scope: !588)
!592 = !DILocation(line: 636, column: 29, scope: !593)
!593 = distinct !DILexicalBlock(scope: !588, file: !36, line: 636, column: 15)
!594 = !DILocation(line: 640, column: 16, scope: !579)
!595 = distinct !{!595, !574, !596, !495}
!596 = !DILocation(line: 641, column: 5, scope: !54)
!597 = !DILocation(line: 644, column: 3, scope: !54)
!598 = !DILocation(line: 0, scope: !478, inlinedAt: !599)
!599 = distinct !DILocation(line: 648, column: 31, scope: !54)
!600 = !DILocation(line: 0, scope: !478, inlinedAt: !601)
!601 = distinct !DILocation(line: 649, column: 31, scope: !54)
!602 = !DILocation(line: 0, scope: !478, inlinedAt: !603)
!603 = distinct !DILocation(line: 650, column: 31, scope: !54)
!604 = !DILocation(line: 0, scope: !478, inlinedAt: !605)
!605 = distinct !DILocation(line: 651, column: 31, scope: !54)
!606 = !DILocation(line: 0, scope: !478, inlinedAt: !607)
!607 = distinct !DILocation(line: 652, column: 31, scope: !54)
!608 = !DILocation(line: 0, scope: !478, inlinedAt: !609)
!609 = distinct !DILocation(line: 653, column: 31, scope: !54)
!610 = !DILocation(line: 0, scope: !478, inlinedAt: !611)
!611 = distinct !DILocation(line: 654, column: 31, scope: !54)
!612 = !DILocation(line: 0, scope: !478, inlinedAt: !613)
!613 = distinct !DILocation(line: 655, column: 31, scope: !54)
!614 = !DILocation(line: 0, scope: !478, inlinedAt: !615)
!615 = distinct !DILocation(line: 656, column: 31, scope: !54)
!616 = !DILocation(line: 0, scope: !478, inlinedAt: !617)
!617 = distinct !DILocation(line: 657, column: 31, scope: !54)
!618 = !DILocation(line: 663, column: 7, scope: !619)
!619 = distinct !DILexicalBlock(scope: !54, file: !36, line: 663, column: 7)
!620 = !DILocation(line: 664, column: 7, scope: !619)
!621 = !DILocation(line: 664, column: 10, scope: !619)
!622 = !DILocation(line: 663, column: 7, scope: !54)
!623 = !DILocation(line: 669, column: 7, scope: !624)
!624 = distinct !DILexicalBlock(scope: !619, file: !36, line: 665, column: 5)
!625 = !DILocation(line: 671, column: 5, scope: !624)
!626 = !DILocation(line: 676, column: 7, scope: !627)
!627 = distinct !DILexicalBlock(scope: !619, file: !36, line: 673, column: 5)
!628 = !DILocation(line: 679, column: 3, scope: !54)
!629 = !DILocation(line: 683, column: 3, scope: !54)
!630 = !DILocation(line: 686, column: 3, scope: !54)
!631 = !DILocation(line: 688, column: 3, scope: !54)
!632 = !DILocation(line: 691, column: 3, scope: !54)
!633 = !DILocation(line: 695, column: 3, scope: !54)
!634 = !DILocation(line: 696, column: 1, scope: !54)
!635 = !DISubprogram(name: "setlocale", scope: !636, file: !636, line: 122, type: !637, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !521)
!636 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!637 = !DISubroutineType(types: !638)
!638 = !{!41, !43, !48}
!639 = !DISubprogram(name: "getenv", scope: !640, file: !640, line: 641, type: !641, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !521)
!640 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!641 = !DISubroutineType(types: !642)
!642 = !{!41, !48}
!643 = !DISubprogram(name: "fwrite_unlocked", scope: !174, file: !174, line: 704, type: !644, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !521)
!644 = !DISubroutineType(types: !645)
!645 = !{!45, !646, !45, !45, !526}
!646 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!649 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 320, type: !650, scopeLine: 321, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !653)
!650 = !DISubroutineType(types: !651)
!651 = !{!43, !43, !652}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!653 = !{!654, !655, !656, !657, !659, !662, !663}
!654 = !DILocalVariable(name: "argc", arg: 1, scope: !649, file: !3, line: 320, type: !43)
!655 = !DILocalVariable(name: "argv", arg: 2, scope: !649, file: !3, line: 320, type: !652)
!656 = !DILocalVariable(name: "logical", scope: !649, file: !3, line: 325, type: !64)
!657 = !DILocalVariable(name: "c", scope: !658, file: !3, line: 337, type: !43)
!658 = distinct !DILexicalBlock(scope: !649, file: !3, line: 336, column: 5)
!659 = !DILocalVariable(name: "wd", scope: !660, file: !3, line: 363, type: !48)
!660 = distinct !DILexicalBlock(scope: !661, file: !3, line: 362, column: 5)
!661 = distinct !DILexicalBlock(scope: !649, file: !3, line: 361, column: 7)
!662 = !DILocalVariable(name: "wd", scope: !649, file: !3, line: 371, type: !41)
!663 = !DILocalVariable(name: "file_name", scope: !664, file: !3, line: 379, type: !666)
!664 = distinct !DILexicalBlock(scope: !665, file: !3, line: 378, column: 5)
!665 = distinct !DILexicalBlock(scope: !649, file: !3, line: 372, column: 7)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 32, size: 192, elements: !668)
!668 = !{!669, !670, !671}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !667, file: !3, line: 34, baseType: !41, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !667, file: !3, line: 35, baseType: !381, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !667, file: !3, line: 36, baseType: !41, size: 64, offset: 128)
!672 = !DILocation(line: 0, scope: !649)
!673 = !DILocation(line: 325, column: 19, scope: !649)
!674 = !DILocation(line: 325, column: 46, scope: !649)
!675 = !DILocation(line: 328, column: 21, scope: !649)
!676 = !DILocation(line: 328, column: 3, scope: !649)
!677 = !DILocation(line: 329, column: 3, scope: !649)
!678 = !DILocation(line: 330, column: 3, scope: !649)
!679 = !DILocation(line: 331, column: 3, scope: !649)
!680 = !DILocation(line: 333, column: 3, scope: !649)
!681 = !DILocation(line: 335, column: 3, scope: !649)
!682 = !DILocation(line: 337, column: 15, scope: !658)
!683 = !DILocation(line: 0, scope: !658)
!684 = !DILocation(line: 338, column: 11, scope: !658)
!685 = !DILocation(line: 347, column: 11, scope: !686)
!686 = distinct !DILexicalBlock(scope: !658, file: !3, line: 341, column: 9)
!687 = !DILocation(line: 349, column: 9, scope: !686)
!688 = !DILocation(line: 351, column: 9, scope: !686)
!689 = !DILocation(line: 354, column: 11, scope: !686)
!690 = !DILocation(line: 358, column: 7, scope: !691)
!691 = distinct !DILexicalBlock(scope: !649, file: !3, line: 358, column: 7)
!692 = !DILocation(line: 358, column: 14, scope: !691)
!693 = !DILocation(line: 358, column: 7, scope: !649)
!694 = !DILocation(line: 359, column: 5, scope: !691)
!695 = !DILocation(line: 361, column: 7, scope: !649)
!696 = !DILocation(line: 296, column: 20, scope: !697, inlinedAt: !740)
!697 = distinct !DISubprogram(name: "logical_getcwd", scope: !3, file: !3, line: 294, type: !698, scopeLine: 295, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !700)
!698 = !DISubroutineType(types: !699)
!699 = !{!48}
!700 = !{!701, !702, !703, !739}
!701 = !DILocalVariable(name: "wd", scope: !697, file: !3, line: 296, type: !48)
!702 = !DILocalVariable(name: "p", scope: !697, file: !3, line: 301, type: !48)
!703 = !DILocalVariable(name: "st1", scope: !697, file: !3, line: 311, type: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !705, line: 44, size: 1024, elements: !706)
!705 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!706 = !{!707, !709, !711, !713, !715, !717, !719, !720, !721, !722, !724, !725, !727, !735, !736, !737}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !704, file: !705, line: 46, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !104, line: 145, baseType: !47)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !704, file: !705, line: 47, baseType: !710, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !104, line: 148, baseType: !47)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !704, file: !705, line: 48, baseType: !712, size: 32, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !104, line: 150, baseType: !7)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !704, file: !705, line: 49, baseType: !714, size: 32, offset: 160)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !104, line: 151, baseType: !7)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !704, file: !705, line: 50, baseType: !716, size: 32, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !104, line: 146, baseType: !7)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !704, file: !705, line: 51, baseType: !718, size: 32, offset: 224)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !104, line: 147, baseType: !7)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !704, file: !705, line: 52, baseType: !708, size: 64, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !704, file: !705, line: 53, baseType: !708, size: 64, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !704, file: !705, line: 54, baseType: !103, size: 64, offset: 384)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !704, file: !705, line: 55, baseType: !723, size: 32, offset: 448)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !104, line: 175, baseType: !43)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !704, file: !705, line: 56, baseType: !43, size: 32, offset: 480)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !704, file: !705, line: 57, baseType: !726, size: 64, offset: 512)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !104, line: 180, baseType: !105)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !704, file: !705, line: 65, baseType: !728, size: 128, offset: 576)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !729, line: 11, size: 128, elements: !730)
!729 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!730 = !{!731, !733}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !728, file: !729, line: 16, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !104, line: 160, baseType: !105)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !728, file: !729, line: 21, baseType: !734, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !104, line: 197, baseType: !105)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !704, file: !705, line: 66, baseType: !728, size: 128, offset: 704)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !704, file: !705, line: 67, baseType: !728, size: 128, offset: 832)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !704, file: !705, line: 79, baseType: !738, size: 64, offset: 960)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 64, elements: !243)
!739 = !DILocalVariable(name: "st2", scope: !697, file: !3, line: 312, type: !704)
!740 = distinct !DILocation(line: 363, column: 24, scope: !660)
!741 = !DILocation(line: 0, scope: !697, inlinedAt: !740)
!742 = !DILocation(line: 299, column: 8, scope: !743, inlinedAt: !740)
!743 = distinct !DILexicalBlock(scope: !697, file: !3, line: 299, column: 7)
!744 = !DILocation(line: 299, column: 11, scope: !743, inlinedAt: !740)
!745 = !DILocation(line: 299, column: 14, scope: !743, inlinedAt: !740)
!746 = !DILocation(line: 299, column: 20, scope: !743, inlinedAt: !740)
!747 = !DILocation(line: 299, column: 7, scope: !697, inlinedAt: !740)
!748 = !DILocation(line: 302, column: 15, scope: !697, inlinedAt: !740)
!749 = !DILocation(line: 302, column: 3, scope: !697, inlinedAt: !740)
!750 = !DILocation(line: 304, column: 12, scope: !751, inlinedAt: !740)
!751 = distinct !DILexicalBlock(scope: !752, file: !3, line: 304, column: 11)
!752 = distinct !DILexicalBlock(scope: !697, file: !3, line: 303, column: 5)
!753 = !DILocation(line: 304, column: 17, scope: !751, inlinedAt: !740)
!754 = !DILocation(line: 305, column: 32, scope: !751, inlinedAt: !740)
!755 = !DILocation(line: 305, column: 37, scope: !751, inlinedAt: !740)
!756 = !DILocation(line: 307, column: 8, scope: !752, inlinedAt: !740)
!757 = distinct !{!757, !749, !758, !495}
!758 = !DILocation(line: 308, column: 5, scope: !697, inlinedAt: !740)
!759 = !DILocation(line: 311, column: 3, scope: !697, inlinedAt: !740)
!760 = !DILocation(line: 311, column: 15, scope: !697, inlinedAt: !740)
!761 = !DILocation(line: 312, column: 3, scope: !697, inlinedAt: !740)
!762 = !DILocation(line: 312, column: 15, scope: !697, inlinedAt: !740)
!763 = !DILocation(line: 313, column: 7, scope: !764, inlinedAt: !740)
!764 = distinct !DILexicalBlock(scope: !697, file: !3, line: 313, column: 7)
!765 = !DILocation(line: 313, column: 23, scope: !764, inlinedAt: !740)
!766 = !DILocation(line: 313, column: 28, scope: !764, inlinedAt: !740)
!767 = !DILocation(line: 313, column: 31, scope: !764, inlinedAt: !740)
!768 = !DILocation(line: 313, column: 48, scope: !764, inlinedAt: !740)
!769 = !DILocation(line: 313, column: 53, scope: !764, inlinedAt: !740)
!770 = !DILocalVariable(name: "a", arg: 1, scope: !771, file: !772, line: 86, type: !775)
!771 = distinct !DISubprogram(name: "psame_inode", scope: !772, file: !772, line: 86, type: !773, scopeLine: 87, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !777)
!772 = !DIFile(filename: "./lib/same-inode.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6a49db1c884e7bc93549038e7fb28788")
!773 = !DISubroutineType(types: !774)
!774 = !{!64, !775, !775}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !704)
!777 = !{!770, !778}
!778 = !DILocalVariable(name: "b", arg: 2, scope: !771, file: !772, line: 86, type: !775)
!779 = !DILocation(line: 0, scope: !771, inlinedAt: !780)
!780 = distinct !DILocation(line: 313, column: 56, scope: !764, inlinedAt: !740)
!781 = !DILocation(line: 90, column: 14, scope: !771, inlinedAt: !780)
!782 = !{!783, !784, i64 0}
!783 = !{!"stat", !784, i64 0, !784, i64 8, !530, i64 16, !530, i64 20, !530, i64 24, !530, i64 28, !784, i64 32, !784, i64 40, !784, i64 48, !530, i64 56, !530, i64 60, !784, i64 64, !785, i64 72, !785, i64 88, !785, i64 104, !441, i64 120}
!784 = !{!"long", !441, i64 0}
!785 = !{!"timespec", !784, i64 0, !784, i64 8}
!786 = !{!783, !784, i64 8}
!787 = !DILocation(line: 313, column: 7, scope: !697, inlinedAt: !740)
!788 = !DILocation(line: 316, column: 1, scope: !697, inlinedAt: !740)
!789 = !DILocation(line: 0, scope: !660)
!790 = !DILocation(line: 364, column: 11, scope: !660)
!791 = !DILocation(line: 366, column: 11, scope: !792)
!792 = distinct !DILexicalBlock(scope: !793, file: !3, line: 365, column: 9)
!793 = distinct !DILexicalBlock(scope: !660, file: !3, line: 364, column: 11)
!794 = !DILocation(line: 371, column: 14, scope: !649)
!795 = !DILocation(line: 372, column: 10, scope: !665)
!796 = !DILocation(line: 372, column: 7, scope: !649)
!797 = !DILocation(line: 374, column: 7, scope: !798)
!798 = distinct !DILexicalBlock(scope: !665, file: !3, line: 373, column: 5)
!799 = !DILocation(line: 375, column: 7, scope: !798)
!800 = !DILocation(line: 376, column: 5, scope: !798)
!801 = !DILocation(line: 89, column: 25, scope: !802, inlinedAt: !808)
!802 = distinct !DISubprogram(name: "file_name_init", scope: !3, file: !3, line: 87, type: !803, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !805)
!803 = !DISubroutineType(types: !804)
!804 = !{!666}
!805 = !{!806, !807}
!806 = !DILocalVariable(name: "p", scope: !802, file: !3, line: 89, type: !666)
!807 = !DILocalVariable(name: "init_alloc", scope: !802, file: !3, line: 93, type: !43)
!808 = distinct !DILocation(line: 379, column: 37, scope: !664)
!809 = !DILocation(line: 0, scope: !802, inlinedAt: !808)
!810 = !DILocation(line: 94, column: 6, scope: !802, inlinedAt: !808)
!811 = !DILocation(line: 94, column: 14, scope: !802, inlinedAt: !808)
!812 = !{!813, !784, i64 8}
!813 = !{!"file_name", !440, i64 0, !784, i64 8, !440, i64 16}
!814 = !DILocation(line: 96, column: 12, scope: !802, inlinedAt: !808)
!815 = !DILocation(line: 96, column: 6, scope: !802, inlinedAt: !808)
!816 = !DILocation(line: 96, column: 10, scope: !802, inlinedAt: !808)
!817 = !{!813, !440, i64 0}
!818 = !DILocation(line: 97, column: 34, scope: !802, inlinedAt: !808)
!819 = !DILocation(line: 97, column: 6, scope: !802, inlinedAt: !808)
!820 = !DILocation(line: 97, column: 12, scope: !802, inlinedAt: !808)
!821 = !{!813, !440, i64 16}
!822 = !DILocation(line: 98, column: 15, scope: !802, inlinedAt: !808)
!823 = !DILocation(line: 0, scope: !664)
!824 = !DILocalVariable(name: "file_name", arg: 1, scope: !825, file: !3, line: 262, type: !666)
!825 = distinct !DISubprogram(name: "robust_getcwd", scope: !3, file: !3, line: 262, type: !826, scopeLine: 263, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !828)
!826 = !DISubroutineType(types: !827)
!827 = !{null, !666}
!828 = !{!824, !829, !830, !839, !841}
!829 = !DILocalVariable(name: "height", scope: !825, file: !3, line: 264, type: !45)
!830 = !DILocalVariable(name: "dev_ino_buf", scope: !825, file: !3, line: 265, type: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !832, line: 30, size: 128, elements: !833)
!832 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!833 = !{!834, !837}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !831, file: !832, line: 32, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !836, line: 47, baseType: !710)
!836 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!837 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !831, file: !832, line: 33, baseType: !838, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !836, line: 59, baseType: !708)
!839 = !DILocalVariable(name: "root_dev_ino", scope: !825, file: !3, line: 266, type: !840)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!841 = !DILocalVariable(name: "dot_sb", scope: !825, file: !3, line: 272, type: !704)
!842 = !DILocation(line: 0, scope: !825, inlinedAt: !843)
!843 = distinct !DILocation(line: 380, column: 7, scope: !664)
!844 = !DILocation(line: 265, column: 3, scope: !825, inlinedAt: !843)
!845 = !DILocation(line: 265, column: 18, scope: !825, inlinedAt: !843)
!846 = !DILocation(line: 266, column: 34, scope: !825, inlinedAt: !843)
!847 = !DILocation(line: 268, column: 20, scope: !848, inlinedAt: !843)
!848 = distinct !DILexicalBlock(scope: !825, file: !3, line: 268, column: 7)
!849 = !DILocation(line: 268, column: 7, scope: !825, inlinedAt: !843)
!850 = !DILocation(line: 269, column: 5, scope: !848, inlinedAt: !843)
!851 = !DILocation(line: 272, column: 3, scope: !825, inlinedAt: !843)
!852 = !DILocation(line: 272, column: 15, scope: !825, inlinedAt: !843)
!853 = !DILocation(line: 273, column: 7, scope: !854, inlinedAt: !843)
!854 = distinct !DILexicalBlock(scope: !825, file: !3, line: 273, column: 7)
!855 = !DILocation(line: 273, column: 27, scope: !854, inlinedAt: !843)
!856 = !DILocation(line: 273, column: 7, scope: !825, inlinedAt: !843)
!857 = !DILocation(line: 279, column: 11, scope: !858, inlinedAt: !843)
!858 = distinct !DILexicalBlock(scope: !859, file: !3, line: 279, column: 11)
!859 = distinct !DILexicalBlock(scope: !825, file: !3, line: 277, column: 5)
!860 = !{!861, !784, i64 8}
!861 = !{!"dev_ino", !784, i64 0, !784, i64 8}
!862 = !{!861, !784, i64 0}
!863 = !DILocation(line: 279, column: 11, scope: !859, inlinedAt: !843)
!864 = !DILocation(line: 274, column: 5, scope: !854, inlinedAt: !843)
!865 = !DILocation(line: 282, column: 49, scope: !859, inlinedAt: !843)
!866 = !DILocalVariable(name: "dot_sb", arg: 1, scope: !867, file: !3, line: 153, type: !870)
!867 = distinct !DISubprogram(name: "find_dir_entry", scope: !3, file: !3, line: 153, type: !868, scopeLine: 155, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !871)
!868 = !DISubroutineType(types: !869)
!869 = !{null, !870, !666, !45}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!871 = !{!866, !872, !873, !874, !879, !880, !881, !882, !883, !895, !900, !901}
!872 = !DILocalVariable(name: "file_name", arg: 2, scope: !867, file: !3, line: 153, type: !666)
!873 = !DILocalVariable(name: "parent_height", arg: 3, scope: !867, file: !3, line: 154, type: !45)
!874 = !DILocalVariable(name: "dirp", scope: !867, file: !3, line: 156, type: !875)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !877, line: 127, baseType: !878)
!877 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!878 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !877, line: 127, flags: DIFlagFwdDecl)
!879 = !DILocalVariable(name: "fd", scope: !867, file: !3, line: 161, type: !43)
!880 = !DILocalVariable(name: "parent_sb", scope: !867, file: !3, line: 166, type: !704)
!881 = !DILocalVariable(name: "use_lstat", scope: !867, file: !3, line: 173, type: !64)
!882 = !DILocalVariable(name: "found", scope: !867, file: !3, line: 175, type: !64)
!883 = !DILocalVariable(name: "dp", scope: !884, file: !3, line: 178, type: !885)
!884 = distinct !DILexicalBlock(scope: !867, file: !3, line: 177, column: 5)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !888, line: 22, size: 2240, elements: !889)
!888 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "bc8b10a1ddd2747862e3ae7b91dbf464")
!889 = !{!890, !891, !892, !893, !894}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !887, file: !888, line: 25, baseType: !710, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !887, file: !888, line: 26, baseType: !103, size: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !887, file: !888, line: 31, baseType: !44, size: 16, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !887, file: !888, line: 32, baseType: !50, size: 8, offset: 144)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !887, file: !888, line: 33, baseType: !279, size: 2048, offset: 152)
!895 = !DILocalVariable(name: "e", scope: !896, file: !3, line: 186, type: !43)
!896 = distinct !DILexicalBlock(scope: !897, file: !3, line: 184, column: 13)
!897 = distinct !DILexicalBlock(scope: !898, file: !3, line: 183, column: 15)
!898 = distinct !DILexicalBlock(scope: !899, file: !3, line: 182, column: 9)
!899 = distinct !DILexicalBlock(scope: !884, file: !3, line: 181, column: 11)
!900 = !DILocalVariable(name: "ino", scope: !884, file: !3, line: 196, type: !835)
!901 = !DILocalVariable(name: "ent_sb", scope: !884, file: !3, line: 198, type: !704)
!902 = !DILocation(line: 0, scope: !867, inlinedAt: !903)
!903 = distinct !DILocation(line: 282, column: 7, scope: !859, inlinedAt: !843)
!904 = !DILocation(line: 156, column: 15, scope: !867, inlinedAt: !903)
!905 = !DILocation(line: 157, column: 12, scope: !906, inlinedAt: !903)
!906 = distinct !DILexicalBlock(scope: !867, file: !3, line: 157, column: 7)
!907 = !DILocation(line: 157, column: 7, scope: !867, inlinedAt: !903)
!908 = !DILocation(line: 158, column: 5, scope: !906, inlinedAt: !903)
!909 = !DILocation(line: 161, column: 12, scope: !867, inlinedAt: !903)
!910 = !DILocation(line: 162, column: 10, scope: !911, inlinedAt: !903)
!911 = distinct !DILexicalBlock(scope: !867, file: !3, line: 162, column: 7)
!912 = !DILocation(line: 162, column: 8, scope: !911, inlinedAt: !903)
!913 = !DILocation(line: 162, column: 18, scope: !911, inlinedAt: !903)
!914 = !DILocation(line: 162, column: 46, scope: !911, inlinedAt: !903)
!915 = !DILocation(line: 162, column: 7, scope: !867, inlinedAt: !903)
!916 = !DILocation(line: 162, column: 32, scope: !911, inlinedAt: !903)
!917 = !DILocation(line: 163, column: 5, scope: !911, inlinedAt: !903)
!918 = !DILocation(line: 166, column: 3, scope: !867, inlinedAt: !903)
!919 = !DILocation(line: 166, column: 15, scope: !867, inlinedAt: !903)
!920 = !DILocation(line: 167, column: 18, scope: !921, inlinedAt: !903)
!921 = distinct !DILexicalBlock(scope: !867, file: !3, line: 167, column: 7)
!922 = !DILocation(line: 167, column: 8, scope: !921, inlinedAt: !903)
!923 = !DILocation(line: 167, column: 43, scope: !921, inlinedAt: !903)
!924 = !DILocation(line: 167, column: 67, scope: !921, inlinedAt: !903)
!925 = !DILocation(line: 167, column: 7, scope: !867, inlinedAt: !903)
!926 = !DILocation(line: 168, column: 5, scope: !921, inlinedAt: !903)
!927 = !DILocation(line: 173, column: 31, scope: !867, inlinedAt: !903)
!928 = !DILocation(line: 180, column: 13, scope: !884, inlinedAt: !903)
!929 = !DILocalVariable(name: "dirp", arg: 1, scope: !930, file: !36, line: 285, type: !875)
!930 = distinct !DISubprogram(name: "readdir_ignoring_dot_and_dotdot", scope: !36, file: !36, line: 285, type: !931, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !933)
!931 = !DISubroutineType(types: !932)
!932 = !{!885, !875}
!933 = !{!929, !934}
!934 = !DILocalVariable(name: "dp", scope: !935, file: !36, line: 289, type: !885)
!935 = distinct !DILexicalBlock(scope: !930, file: !36, line: 288, column: 5)
!936 = !DILocation(line: 0, scope: !930, inlinedAt: !937)
!937 = distinct !DILocation(line: 181, column: 17, scope: !899, inlinedAt: !903)
!938 = !DILocation(line: 289, column: 33, scope: !935, inlinedAt: !937)
!939 = !DILocation(line: 0, scope: !935, inlinedAt: !937)
!940 = !DILocation(line: 290, column: 14, scope: !941, inlinedAt: !937)
!941 = distinct !DILexicalBlock(scope: !935, file: !36, line: 290, column: 11)
!942 = !DILocation(line: 290, column: 22, scope: !941, inlinedAt: !937)
!943 = !DILocation(line: 173, column: 38, scope: !867, inlinedAt: !903)
!944 = !DILocation(line: 214, column: 24, scope: !945, inlinedAt: !903)
!945 = distinct !DILexicalBlock(scope: !884, file: !3, line: 214, column: 12)
!946 = !DILocation(line: 290, column: 42, scope: !941, inlinedAt: !937)
!947 = !DILocalVariable(name: "file_name", arg: 1, scope: !948, file: !36, line: 272, type: !48)
!948 = distinct !DISubprogram(name: "dot_or_dotdot", scope: !36, file: !36, line: 272, type: !949, scopeLine: 273, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !951)
!949 = !DISubroutineType(types: !950)
!950 = !{!64, !48}
!951 = !{!947, !952}
!952 = !DILocalVariable(name: "sep", scope: !953, file: !36, line: 276, type: !42)
!953 = distinct !DILexicalBlock(scope: !954, file: !36, line: 275, column: 5)
!954 = distinct !DILexicalBlock(scope: !948, file: !36, line: 274, column: 7)
!955 = !DILocation(line: 0, scope: !948, inlinedAt: !956)
!956 = distinct !DILocation(line: 290, column: 27, scope: !941, inlinedAt: !937)
!957 = !DILocation(line: 274, column: 7, scope: !954, inlinedAt: !956)
!958 = !DILocation(line: 274, column: 20, scope: !954, inlinedAt: !956)
!959 = !DILocation(line: 274, column: 7, scope: !948, inlinedAt: !956)
!960 = !DILocation(line: 276, column: 29, scope: !953, inlinedAt: !956)
!961 = !DILocation(line: 276, column: 42, scope: !953, inlinedAt: !956)
!962 = !DILocation(line: 276, column: 50, scope: !953, inlinedAt: !956)
!963 = !DILocation(line: 276, column: 18, scope: !953, inlinedAt: !956)
!964 = !DILocation(line: 0, scope: !953, inlinedAt: !956)
!965 = !DILocation(line: 290, column: 11, scope: !935, inlinedAt: !937)
!966 = !DILocation(line: 0, scope: !884, inlinedAt: !903)
!967 = !DILocation(line: 196, column: 19, scope: !884, inlinedAt: !903)
!968 = !{!969, !784, i64 0}
!969 = !{!"dirent", !784, i64 0, !784, i64 8, !564, i64 16, !441, i64 18, !441, i64 19}
!970 = !DILocation(line: 198, column: 7, scope: !884, inlinedAt: !903)
!971 = !DILocation(line: 198, column: 19, scope: !884, inlinedAt: !903)
!972 = !DILocation(line: 199, column: 15, scope: !973, inlinedAt: !903)
!973 = distinct !DILexicalBlock(scope: !884, file: !3, line: 199, column: 11)
!974 = !DILocation(line: 199, column: 38, scope: !973, inlinedAt: !903)
!975 = !DILocation(line: 201, column: 15, scope: !976, inlinedAt: !903)
!976 = distinct !DILexicalBlock(scope: !977, file: !3, line: 201, column: 15)
!977 = distinct !DILexicalBlock(scope: !973, file: !3, line: 200, column: 9)
!978 = !DILocation(line: 201, column: 43, scope: !976, inlinedAt: !903)
!979 = !DILocation(line: 201, column: 15, scope: !977, inlinedAt: !903)
!980 = distinct !{!980, !981, !982}
!981 = !DILocation(line: 176, column: 3, scope: !867, inlinedAt: !903)
!982 = !DILocation(line: 220, column: 5, scope: !867, inlinedAt: !903)
!983 = !DILocation(line: 206, column: 24, scope: !977, inlinedAt: !903)
!984 = !DILocation(line: 207, column: 9, scope: !977, inlinedAt: !903)
!985 = !DILocation(line: 209, column: 15, scope: !986, inlinedAt: !903)
!986 = distinct !DILexicalBlock(scope: !884, file: !3, line: 209, column: 11)
!987 = !DILocation(line: 209, column: 11, scope: !884, inlinedAt: !903)
!988 = distinct !{!988, !981, !982}
!989 = distinct !{!989, !981, !982}
!990 = !DILocation(line: 183, column: 15, scope: !897, inlinedAt: !903)
!991 = !DILocation(line: 183, column: 15, scope: !898, inlinedAt: !903)
!992 = !DILocation(line: 0, scope: !896, inlinedAt: !903)
!993 = !DILocation(line: 188, column: 21, scope: !896, inlinedAt: !903)
!994 = !DILocation(line: 222, column: 20, scope: !995, inlinedAt: !903)
!995 = distinct !DILexicalBlock(scope: !867, file: !3, line: 222, column: 7)
!996 = !DILocation(line: 216, column: 41, scope: !997, inlinedAt: !903)
!997 = distinct !DILexicalBlock(scope: !945, file: !3, line: 215, column: 9)
!998 = !DILocation(line: 216, column: 53, scope: !997, inlinedAt: !903)
!999 = !DILocalVariable(name: "p", arg: 1, scope: !1000, file: !3, line: 104, type: !666)
!1000 = distinct !DISubprogram(name: "file_name_prepend", scope: !3, file: !3, line: 104, type: !1001, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1003)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{null, !666, !48, !45}
!1003 = !{!999, !1004, !1005, !1006, !1007, !1010}
!1004 = !DILocalVariable(name: "s", arg: 2, scope: !1000, file: !3, line: 104, type: !48)
!1005 = !DILocalVariable(name: "s_len", arg: 3, scope: !1000, file: !3, line: 104, type: !45)
!1006 = !DILocalVariable(name: "n_free", scope: !1000, file: !3, line: 106, type: !381)
!1007 = !DILocalVariable(name: "n_used", scope: !1008, file: !3, line: 113, type: !381)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 108, column: 5)
!1009 = distinct !DILexicalBlock(scope: !1000, file: !3, line: 107, column: 7)
!1010 = !DILocalVariable(name: "buf", scope: !1008, file: !3, line: 114, type: !41)
!1011 = !DILocation(line: 0, scope: !1000, inlinedAt: !1012)
!1012 = distinct !DILocation(line: 216, column: 11, scope: !997, inlinedAt: !903)
!1013 = !DILocation(line: 106, column: 21, scope: !1000, inlinedAt: !1012)
!1014 = !DILocation(line: 106, column: 32, scope: !1000, inlinedAt: !1012)
!1015 = !DILocation(line: 106, column: 27, scope: !1000, inlinedAt: !1012)
!1016 = !DILocation(line: 107, column: 18, scope: !1009, inlinedAt: !1012)
!1017 = !DILocation(line: 107, column: 14, scope: !1009, inlinedAt: !1012)
!1018 = !DILocation(line: 107, column: 7, scope: !1000, inlinedAt: !1012)
!1019 = !DILocation(line: 113, column: 25, scope: !1008, inlinedAt: !1012)
!1020 = !DILocation(line: 113, column: 33, scope: !1008, inlinedAt: !1012)
!1021 = !DILocation(line: 0, scope: !1008, inlinedAt: !1012)
!1022 = !DILocation(line: 114, column: 57, scope: !1008, inlinedAt: !1012)
!1023 = !DILocation(line: 114, column: 19, scope: !1008, inlinedAt: !1012)
!1024 = !DILocation(line: 115, column: 35, scope: !1008, inlinedAt: !1012)
!1025 = !DILocation(line: 115, column: 30, scope: !1008, inlinedAt: !1012)
!1026 = !DILocation(line: 115, column: 43, scope: !1008, inlinedAt: !1012)
!1027 = !DILocation(line: 115, column: 56, scope: !1008, inlinedAt: !1012)
!1028 = !DILocalVariable(name: "__dest", arg: 1, scope: !1029, file: !1030, line: 26, type: !1033)
!1029 = distinct !DISubprogram(name: "memcpy", scope: !1030, file: !1030, line: 26, type: !1031, scopeLine: 28, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1034)
!1030 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!40, !1033, !646, !45}
!1033 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !40)
!1034 = !{!1028, !1035, !1036}
!1035 = !DILocalVariable(name: "__src", arg: 2, scope: !1029, file: !1030, line: 26, type: !646)
!1036 = !DILocalVariable(name: "__len", arg: 3, scope: !1029, file: !1030, line: 26, type: !45)
!1037 = !DILocation(line: 0, scope: !1029, inlinedAt: !1038)
!1038 = distinct !DILocation(line: 115, column: 18, scope: !1008, inlinedAt: !1012)
!1039 = !DILocation(line: 29, column: 10, scope: !1029, inlinedAt: !1038)
!1040 = !DILocation(line: 115, column: 16, scope: !1008, inlinedAt: !1012)
!1041 = !DILocation(line: 116, column: 16, scope: !1008, inlinedAt: !1012)
!1042 = !DILocation(line: 116, column: 7, scope: !1008, inlinedAt: !1012)
!1043 = !DILocation(line: 117, column: 14, scope: !1008, inlinedAt: !1012)
!1044 = !DILocation(line: 120, column: 12, scope: !1000, inlinedAt: !1012)
!1045 = !DILocation(line: 118, column: 5, scope: !1008, inlinedAt: !1012)
!1046 = !DILocation(line: 121, column: 15, scope: !1000, inlinedAt: !1012)
!1047 = !DILocation(line: 122, column: 14, scope: !1000, inlinedAt: !1012)
!1048 = !DILocation(line: 122, column: 20, scope: !1000, inlinedAt: !1012)
!1049 = !DILocation(line: 0, scope: !1029, inlinedAt: !1050)
!1050 = distinct !DILocation(line: 122, column: 3, scope: !1000, inlinedAt: !1012)
!1051 = !DILocation(line: 29, column: 10, scope: !1029, inlinedAt: !1050)
!1052 = !DILocation(line: 222, column: 23, scope: !995, inlinedAt: !903)
!1053 = !DILocation(line: 222, column: 39, scope: !995, inlinedAt: !903)
!1054 = !DILocation(line: 222, column: 7, scope: !867, inlinedAt: !903)
!1055 = !DILocation(line: 226, column: 7, scope: !1056, inlinedAt: !903)
!1056 = distinct !DILexicalBlock(scope: !995, file: !3, line: 223, column: 5)
!1057 = !DILocation(line: 231, column: 5, scope: !1058, inlinedAt: !903)
!1058 = distinct !DILexicalBlock(scope: !867, file: !3, line: 230, column: 8)
!1059 = !DILocation(line: 235, column: 13, scope: !867, inlinedAt: !903)
!1060 = !{i64 0, i64 8, !1061, i64 8, i64 8, !1061, i64 16, i64 4, !529, i64 20, i64 4, !529, i64 24, i64 4, !529, i64 28, i64 4, !529, i64 32, i64 8, !1061, i64 40, i64 8, !1061, i64 48, i64 8, !1061, i64 56, i64 4, !529, i64 60, i64 4, !529, i64 64, i64 8, !1061, i64 72, i64 8, !1061, i64 80, i64 8, !1061, i64 88, i64 8, !1061, i64 96, i64 8, !1061, i64 104, i64 8, !1061, i64 112, i64 8, !1061, i64 120, i64 8, !538}
!1061 = !{!784, !784, i64 0}
!1062 = !DILocation(line: 236, column: 1, scope: !867, inlinedAt: !903)
!1063 = distinct !{!1063, !1064, !1065}
!1064 = !DILocation(line: 276, column: 3, scope: !825, inlinedAt: !843)
!1065 = !DILocation(line: 283, column: 5, scope: !825, inlinedAt: !843)
!1066 = !DILocation(line: 286, column: 18, scope: !1067, inlinedAt: !843)
!1067 = distinct !DILexicalBlock(scope: !825, file: !3, line: 286, column: 7)
!1068 = !DILocation(line: 286, column: 7, scope: !1067, inlinedAt: !843)
!1069 = !DILocation(line: 286, column: 27, scope: !1067, inlinedAt: !843)
!1070 = !DILocation(line: 286, column: 7, scope: !825, inlinedAt: !843)
!1071 = !DILocation(line: 0, scope: !1000, inlinedAt: !1072)
!1072 = distinct !DILocation(line: 287, column: 5, scope: !1067, inlinedAt: !843)
!1073 = !DILocation(line: 106, column: 32, scope: !1000, inlinedAt: !1072)
!1074 = !DILocation(line: 107, column: 14, scope: !1009, inlinedAt: !1072)
!1075 = !DILocation(line: 107, column: 7, scope: !1000, inlinedAt: !1072)
!1076 = !DILocation(line: 113, column: 25, scope: !1008, inlinedAt: !1072)
!1077 = !DILocation(line: 0, scope: !1008, inlinedAt: !1072)
!1078 = !DILocation(line: 114, column: 19, scope: !1008, inlinedAt: !1072)
!1079 = !DILocation(line: 115, column: 35, scope: !1008, inlinedAt: !1072)
!1080 = !DILocation(line: 115, column: 30, scope: !1008, inlinedAt: !1072)
!1081 = !DILocation(line: 115, column: 43, scope: !1008, inlinedAt: !1072)
!1082 = !DILocation(line: 115, column: 56, scope: !1008, inlinedAt: !1072)
!1083 = !DILocation(line: 0, scope: !1029, inlinedAt: !1084)
!1084 = distinct !DILocation(line: 115, column: 18, scope: !1008, inlinedAt: !1072)
!1085 = !DILocation(line: 29, column: 10, scope: !1029, inlinedAt: !1084)
!1086 = !DILocation(line: 115, column: 16, scope: !1008, inlinedAt: !1072)
!1087 = !DILocation(line: 116, column: 16, scope: !1008, inlinedAt: !1072)
!1088 = !DILocation(line: 116, column: 7, scope: !1008, inlinedAt: !1072)
!1089 = !DILocation(line: 117, column: 14, scope: !1008, inlinedAt: !1072)
!1090 = !DILocation(line: 120, column: 12, scope: !1000, inlinedAt: !1072)
!1091 = !DILocation(line: 118, column: 5, scope: !1008, inlinedAt: !1072)
!1092 = !DILocation(line: 121, column: 15, scope: !1000, inlinedAt: !1072)
!1093 = !DILocation(line: 0, scope: !1029, inlinedAt: !1094)
!1094 = distinct !DILocation(line: 122, column: 3, scope: !1000, inlinedAt: !1072)
!1095 = !DILocation(line: 381, column: 24, scope: !664)
!1096 = !DILocation(line: 287, column: 5, scope: !1067, inlinedAt: !843)
!1097 = !DILocation(line: 288, column: 1, scope: !825, inlinedAt: !843)
!1098 = !DILocation(line: 381, column: 7, scope: !664)
!1099 = !DILocalVariable(name: "p", arg: 1, scope: !1100, file: !3, line: 80, type: !666)
!1100 = distinct !DISubprogram(name: "file_name_free", scope: !3, file: !3, line: 80, type: !826, scopeLine: 81, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1101)
!1101 = !{!1099}
!1102 = !DILocation(line: 0, scope: !1100, inlinedAt: !1103)
!1103 = distinct !DILocation(line: 382, column: 7, scope: !664)
!1104 = !DILocation(line: 82, column: 12, scope: !1100, inlinedAt: !1103)
!1105 = !DILocation(line: 82, column: 3, scope: !1100, inlinedAt: !1103)
!1106 = !DILocation(line: 83, column: 3, scope: !1100, inlinedAt: !1103)
!1107 = !DILocation(line: 386, column: 1, scope: !649)
!1108 = !DISubprogram(name: "bindtextdomain", scope: !518, file: !518, line: 86, type: !1109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !521)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!41, !48, !48}
!1111 = !DISubprogram(name: "textdomain", scope: !518, file: !518, line: 82, type: !641, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !521)
!1112 = !DISubprogram(name: "atexit", scope: !640, file: !640, line: 602, type: !1113, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !521)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!43, !200}
!1115 = !DISubprogram(name: "getopt_long", scope: !141, file: !141, line: 66, type: !1116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !521)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!43, !43, !1118, !48, !1120, !146}
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!1121 = !DISubprogram(name: "stat", scope: !1122, file: !1122, line: 205, type: !1123, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !521)
!1122 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "1e5cd132abb12ea0c79aeae3bfa4573e")
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!43, !525, !1125}
!1125 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !870)
!1126 = !DISubprogram(name: "puts", scope: !174, file: !174, line: 661, type: !1127, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !521)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!43, !48}
!1129 = !DISubprogram(name: "opendir", scope: !877, file: !877, line: 134, type: !1130, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !521)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!875, !48}
!1132 = distinct !DISubprogram(name: "nth_parent", scope: !3, file: !3, line: 127, type: !1133, scopeLine: 128, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1135)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!41, !45}
!1135 = !{!1136, !1137, !1138, !1139}
!1136 = !DILocalVariable(name: "n", arg: 1, scope: !1132, file: !3, line: 127, type: !45)
!1137 = !DILocalVariable(name: "buf", scope: !1132, file: !3, line: 129, type: !41)
!1138 = !DILocalVariable(name: "p", scope: !1132, file: !3, line: 130, type: !41)
!1139 = !DILocalVariable(name: "i", scope: !1140, file: !3, line: 132, type: !45)
!1140 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 132, column: 3)
!1141 = !DILocation(line: 0, scope: !1132)
!1142 = !DILocation(line: 129, column: 15, scope: !1132)
!1143 = !DILocation(line: 0, scope: !1140)
!1144 = !DILocation(line: 132, column: 24, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 132, column: 3)
!1146 = !DILocation(line: 132, column: 3, scope: !1140)
!1147 = !DILocation(line: 137, column: 3, scope: !1132)
!1148 = !DILocation(line: 137, column: 9, scope: !1132)
!1149 = !DILocation(line: 138, column: 3, scope: !1132)
!1150 = !DILocation(line: 0, scope: !1029, inlinedAt: !1151)
!1151 = distinct !DILocation(line: 134, column: 7, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 133, column: 5)
!1153 = !DILocation(line: 29, column: 10, scope: !1029, inlinedAt: !1151)
!1154 = !DILocation(line: 135, column: 9, scope: !1152)
!1155 = !DILocation(line: 132, column: 30, scope: !1145)
!1156 = distinct !{!1156, !1146, !1157, !495}
!1157 = !DILocation(line: 136, column: 5, scope: !1140)
!1158 = !DISubprogram(name: "dirfd", scope: !877, file: !877, line: 224, type: !1159, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !521)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!43, !875}
!1161 = !DISubprogram(name: "fchdir", scope: !1162, file: !1162, line: 521, type: !1163, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !521)
!1162 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!43, !43}
!1165 = !DISubprogram(name: "chdir", scope: !1162, file: !1162, line: 517, type: !1127, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !521)
!1166 = !DISubprogram(name: "fstat", scope: !1122, file: !1122, line: 210, type: !1167, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !521)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!43, !43, !870}
!1169 = !DISubprogram(name: "readdir", scope: !877, file: !877, line: 162, type: !1170, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !521)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!1172, !875}
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!1173 = !DISubprogram(name: "lstat", scope: !1122, file: !1122, line: 313, type: !1123, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !521)
!1174 = !DISubprogram(name: "closedir", scope: !877, file: !877, line: 149, type: !1159, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !521)
!1175 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !158, file: !158, line: 50, type: !454, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !157, retainedNodes: !1176)
!1176 = !{!1177}
!1177 = !DILocalVariable(name: "file", arg: 1, scope: !1175, file: !158, line: 50, type: !48)
!1178 = !DILocation(line: 0, scope: !1175)
!1179 = !DILocation(line: 52, column: 13, scope: !1175)
!1180 = !DILocation(line: 53, column: 1, scope: !1175)
!1181 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !158, file: !158, line: 87, type: !1182, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !157, retainedNodes: !1184)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{null, !64}
!1184 = !{!1185}
!1185 = !DILocalVariable(name: "ignore", arg: 1, scope: !1181, file: !158, line: 87, type: !64)
!1186 = !DILocation(line: 0, scope: !1181)
!1187 = !DILocation(line: 89, column: 16, scope: !1181)
!1188 = !{!1189, !1189, i64 0}
!1189 = !{!"_Bool", !441, i64 0}
!1190 = !DILocation(line: 90, column: 1, scope: !1181)
!1191 = distinct !DISubprogram(name: "close_stdout", scope: !158, file: !158, line: 116, type: !201, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !157, retainedNodes: !1192)
