; ModuleID = 'src/groups.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [37 x i8] c"Usage: %s [OPTION]... [USERNAME]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [155 x i8] c"Print group memberships for each USERNAME or, if no USERNAME is specified, for\0Athe current process (which may differ if the groups database has changed).\0A\00", align 1
@.str.3 = private unnamed_addr constant [7 x i8] c"groups\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 39, type: !121, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !33, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/groups.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d48dc102a9c02fb59e67fc9e395fa6a9")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256)
!10 = !DIEnumerator(name: "_ISlower", value: 512)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!14 = !DIEnumerator(name: "_ISspace", value: 8192)
!15 = !DIEnumerator(name: "_ISprint", value: 16384)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768)
!17 = !DIEnumerator(name: "_ISblank", value: 1)
!18 = !DIEnumerator(name: "_IScntrl", value: 2)
!19 = !DIEnumerator(name: "_ISpunct", value: 4)
!20 = !DIEnumerator(name: "_ISalnum", value: 8)
!21 = !{!22, !24, !25, !26, !27, !30, !32}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !28, line: 46, baseType: !29)
!28 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!29 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !{!34, !0}
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !36, file: !37, line: 575, type: !25, isLocal: true, isDefinition: true)
!36 = distinct !DISubprogram(name: "oputs_", scope: !37, file: !37, line: 573, type: !38, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !40)
!37 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!38 = !DISubroutineType(types: !39)
!39 = !{null, !30, !30}
!40 = !{!41, !42, !43, !46, !48, !49, !50, !54, !55, !56, !57, !59, !115, !116, !117, !119, !120}
!41 = !DILocalVariable(name: "program", arg: 1, scope: !36, file: !37, line: 573, type: !30)
!42 = !DILocalVariable(name: "option", arg: 2, scope: !36, file: !37, line: 573, type: !30)
!43 = !DILocalVariable(name: "term", scope: !44, file: !37, line: 585, type: !30)
!44 = distinct !DILexicalBlock(scope: !45, file: !37, line: 582, column: 5)
!45 = distinct !DILexicalBlock(scope: !36, file: !37, line: 581, column: 7)
!46 = !DILocalVariable(name: "double_space", scope: !36, file: !37, line: 594, type: !47)
!47 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!48 = !DILocalVariable(name: "first_word", scope: !36, file: !37, line: 595, type: !30)
!49 = !DILocalVariable(name: "option_text", scope: !36, file: !37, line: 596, type: !30)
!50 = !DILocalVariable(name: "s", scope: !51, file: !37, line: 608, type: !30)
!51 = distinct !DILexicalBlock(scope: !52, file: !37, line: 605, column: 5)
!52 = distinct !DILexicalBlock(scope: !53, file: !37, line: 604, column: 12)
!53 = distinct !DILexicalBlock(scope: !36, file: !37, line: 597, column: 7)
!54 = !DILocalVariable(name: "spaces", scope: !51, file: !37, line: 609, type: !27)
!55 = !DILocalVariable(name: "anchor_len", scope: !36, file: !37, line: 620, type: !27)
!56 = !DILocalVariable(name: "desc_text", scope: !36, file: !37, line: 625, type: !30)
!57 = !DILocalVariable(name: "__ptr", scope: !58, file: !37, line: 644, type: !30)
!58 = distinct !DILexicalBlock(scope: !36, file: !37, line: 644, column: 3)
!59 = !DILocalVariable(name: "__stream", scope: !58, file: !37, line: 644, type: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !62, line: 7, baseType: !63)
!62 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !64, line: 49, size: 1728, elements: !65)
!64 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !81, !83, !84, !85, !89, !90, !92, !96, !99, !101, !104, !107, !108, !109, !110, !111}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !63, file: !64, line: 51, baseType: !25, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !63, file: !64, line: 54, baseType: !22, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !63, file: !64, line: 55, baseType: !22, size: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !63, file: !64, line: 56, baseType: !22, size: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !63, file: !64, line: 57, baseType: !22, size: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !63, file: !64, line: 58, baseType: !22, size: 64, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !63, file: !64, line: 59, baseType: !22, size: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !63, file: !64, line: 60, baseType: !22, size: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !63, file: !64, line: 61, baseType: !22, size: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !63, file: !64, line: 64, baseType: !22, size: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !63, file: !64, line: 65, baseType: !22, size: 64, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !63, file: !64, line: 66, baseType: !22, size: 64, offset: 704)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !63, file: !64, line: 68, baseType: !79, size: 64, offset: 768)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !64, line: 36, flags: DIFlagFwdDecl)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !63, file: !64, line: 70, baseType: !82, size: 64, offset: 832)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !63, file: !64, line: 72, baseType: !25, size: 32, offset: 896)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !63, file: !64, line: 73, baseType: !25, size: 32, offset: 928)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !63, file: !64, line: 74, baseType: !86, size: 64, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !87, line: 152, baseType: !88)
!87 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!88 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !63, file: !64, line: 77, baseType: !26, size: 16, offset: 1024)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !63, file: !64, line: 78, baseType: !91, size: 8, offset: 1040)
!91 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !63, file: !64, line: 79, baseType: !93, size: 8, offset: 1048)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 1)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !63, file: !64, line: 81, baseType: !97, size: 64, offset: 1088)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !64, line: 43, baseType: null)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !63, file: !64, line: 89, baseType: !100, size: 64, offset: 1152)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !87, line: 153, baseType: !88)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !63, file: !64, line: 91, baseType: !102, size: 64, offset: 1216)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !64, line: 37, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !63, file: !64, line: 92, baseType: !105, size: 64, offset: 1280)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !64, line: 38, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !63, file: !64, line: 93, baseType: !82, size: 64, offset: 1344)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !63, file: !64, line: 94, baseType: !24, size: 64, offset: 1408)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !63, file: !64, line: 95, baseType: !27, size: 64, offset: 1472)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !63, file: !64, line: 96, baseType: !25, size: 32, offset: 1536)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !63, file: !64, line: 98, baseType: !112, size: 160, offset: 1568)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 160, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 20)
!115 = !DILocalVariable(name: "__cnt", scope: !58, file: !37, line: 644, type: !27)
!116 = !DILocalVariable(name: "url_program", scope: !36, file: !37, line: 648, type: !30)
!117 = !DILocalVariable(name: "__ptr", scope: !118, file: !37, line: 686, type: !30)
!118 = distinct !DILexicalBlock(scope: !36, file: !37, line: 686, column: 3)
!119 = !DILocalVariable(name: "__stream", scope: !118, file: !37, line: 686, type: !60)
!120 = !DILocalVariable(name: "__cnt", scope: !118, file: !37, line: 686, type: !27)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 768, elements: !131)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !124, line: 50, size: 256, elements: !125)
!124 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!125 = !{!126, !127, !128, !130}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !123, file: !124, line: 52, baseType: !30, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !123, file: !124, line: 55, baseType: !25, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !123, file: !124, line: 56, baseType: !129, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !123, file: !124, line: 57, baseType: !25, size: 32, offset: 192)
!131 = !{!132}
!132 = !DISubrange(count: 3)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "Version", scope: !135, file: !136, line: 3, type: !30, isLocal: false, isDefinition: true)
!135 = distinct !DICompileUnit(language: DW_LANG_C99, file: !136, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !137, splitDebugInlining: false, nameTableKind: None)
!136 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!137 = !{!133}
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "file_name", scope: !140, file: !141, line: 45, type: !30, isLocal: true, isDefinition: true)
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !142, splitDebugInlining: false, nameTableKind: None)
!141 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!142 = !{!138, !143}
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !140, file: !141, line: 55, type: !47, isLocal: true, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !147, file: !148, line: 66, type: !183, isLocal: false, isDefinition: true)
!147 = distinct !DICompileUnit(language: DW_LANG_C99, file: !148, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !149, globals: !150, splitDebugInlining: false, nameTableKind: None)
!148 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!149 = !{!24, !32}
!150 = !{!151, !177, !145, !179, !181}
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "old_file_name", scope: !153, file: !148, line: 304, type: !30, isLocal: true, isDefinition: true)
!153 = distinct !DISubprogram(name: "verror_at_line", scope: !148, file: !148, line: 298, type: !154, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !170)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !25, !25, !30, !7, !30, !156}
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !157, line: 52, baseType: !158)
!157 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !159, line: 32, baseType: !160)
!159 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !161, baseType: !162)
!161 = !DIFile(filename: "lib/error.c", directory: "/src")
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !163, size: 256, elements: !164)
!163 = !DINamespace(name: "std", scope: null)
!164 = !{!165, !166, !167, !168, !169}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !162, file: !161, baseType: !24, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !162, file: !161, baseType: !24, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !162, file: !161, baseType: !24, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !162, file: !161, baseType: !25, size: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !162, file: !161, baseType: !25, size: 32, offset: 224)
!170 = !{!171, !172, !173, !174, !175, !176}
!171 = !DILocalVariable(name: "status", arg: 1, scope: !153, file: !148, line: 298, type: !25)
!172 = !DILocalVariable(name: "errnum", arg: 2, scope: !153, file: !148, line: 298, type: !25)
!173 = !DILocalVariable(name: "file_name", arg: 3, scope: !153, file: !148, line: 298, type: !30)
!174 = !DILocalVariable(name: "line_number", arg: 4, scope: !153, file: !148, line: 298, type: !7)
!175 = !DILocalVariable(name: "message", arg: 5, scope: !153, file: !148, line: 298, type: !30)
!176 = !DILocalVariable(name: "args", arg: 6, scope: !153, file: !148, line: 298, type: !156)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "old_line_number", scope: !153, file: !148, line: 305, type: !7, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "error_message_count", scope: !147, file: !148, line: 69, type: !7, isLocal: false, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !147, file: !148, line: 295, type: !25, isLocal: false, isDefinition: true)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{null}
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "program_name", scope: !188, file: !189, line: 31, type: !30, isLocal: false, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C99, file: !189, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !190, globals: !191, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!190 = !{!22}
!191 = !{!186}
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "utf07FF", scope: !194, file: !195, line: 46, type: !225, isLocal: true, isDefinition: true)
!194 = distinct !DISubprogram(name: "proper_name_lite", scope: !195, file: !195, line: 38, type: !196, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !198, retainedNodes: !200)
!195 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!196 = !DISubroutineType(types: !197)
!197 = !{!30, !30, !30}
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !195, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !199, splitDebugInlining: false, nameTableKind: None)
!199 = !{!192}
!200 = !{!201, !202, !203, !204, !209}
!201 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !194, file: !195, line: 38, type: !30)
!202 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !194, file: !195, line: 38, type: !30)
!203 = !DILocalVariable(name: "translation", scope: !194, file: !195, line: 40, type: !30)
!204 = !DILocalVariable(name: "w", scope: !194, file: !195, line: 47, type: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !206, line: 37, baseType: !207)
!206 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !87, line: 57, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !87, line: 42, baseType: !7)
!209 = !DILocalVariable(name: "mbs", scope: !194, file: !195, line: 48, type: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !211, line: 6, baseType: !212)
!211 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !213, line: 21, baseType: !214)
!213 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !213, line: 13, size: 64, elements: !215)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !214, file: !213, line: 15, baseType: !25, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !214, file: !213, line: 20, baseType: !218, size: 32, offset: 32)
!218 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !213, line: 16, size: 32, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !218, file: !213, line: 18, baseType: !7, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !218, file: !213, line: 19, baseType: !222, size: 32)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 32, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 4)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 16, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 2)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !230, file: !231, line: 76, type: !313, isLocal: false, isDefinition: true)
!230 = distinct !DICompileUnit(language: DW_LANG_C99, file: !231, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232, retainedTypes: !252, globals: !253, splitDebugInlining: false, nameTableKind: None)
!231 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!232 = !{!233, !247, !5}
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !234, line: 42, baseType: !7, size: 32, elements: !235)
!234 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246}
!236 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!237 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!238 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!239 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!240 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!241 = !DIEnumerator(name: "c_quoting_style", value: 5)
!242 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!243 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!244 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!245 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!246 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!247 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !234, line: 254, baseType: !7, size: 32, elements: !248)
!248 = !{!249, !250, !251}
!249 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!250 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!251 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!252 = !{!25, !26, !27}
!253 = !{!228, !254, !260, !272, !274, !279, !302, !309, !311}
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !230, file: !231, line: 92, type: !256, isLocal: false, isDefinition: true)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 320, elements: !258)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!258 = !{!259}
!259 = !DISubrange(count: 10)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !230, file: !231, line: 1040, type: !262, isLocal: false, isDefinition: true)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !231, line: 56, size: 448, elements: !263)
!263 = !{!264, !265, !266, !270, !271}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !262, file: !231, line: 59, baseType: !233, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !262, file: !231, line: 62, baseType: !25, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !262, file: !231, line: 66, baseType: !267, size: 256, offset: 64)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 8)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !262, file: !231, line: 69, baseType: !30, size: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !262, file: !231, line: 72, baseType: !30, size: 64, offset: 384)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !230, file: !231, line: 107, type: !262, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "slot0", scope: !230, file: !231, line: 831, type: !276, isLocal: true, isDefinition: true)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2048, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 256)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "quote", scope: !281, file: !231, line: 228, type: !300, isLocal: true, isDefinition: true)
!281 = distinct !DISubprogram(name: "gettext_quote", scope: !231, file: !231, line: 197, type: !282, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !230, retainedNodes: !284)
!282 = !DISubroutineType(types: !283)
!283 = !{!30, !30, !233}
!284 = !{!285, !286, !287, !288, !289}
!285 = !DILocalVariable(name: "msgid", arg: 1, scope: !281, file: !231, line: 197, type: !30)
!286 = !DILocalVariable(name: "s", arg: 2, scope: !281, file: !231, line: 197, type: !233)
!287 = !DILocalVariable(name: "translation", scope: !281, file: !231, line: 199, type: !30)
!288 = !DILocalVariable(name: "w", scope: !281, file: !231, line: 229, type: !205)
!289 = !DILocalVariable(name: "mbs", scope: !281, file: !231, line: 230, type: !290)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !211, line: 6, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !213, line: 21, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !213, line: 13, size: 64, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !292, file: !213, line: 15, baseType: !25, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !292, file: !213, line: 20, baseType: !296, size: 32, offset: 32)
!296 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !292, file: !213, line: 16, size: 32, elements: !297)
!297 = !{!298, !299}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !296, file: !213, line: 18, baseType: !7, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !296, file: !213, line: 19, baseType: !222, size: 32)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 64, elements: !301)
!301 = !{!227, !224}
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "slotvec", scope: !230, file: !231, line: 834, type: !304, isLocal: true, isDefinition: true)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !231, line: 823, size: 128, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !305, file: !231, line: 825, baseType: !27, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !305, file: !231, line: 826, baseType: !22, size: 64, offset: 64)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "nslots", scope: !230, file: !231, line: 832, type: !25, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "slotvec0", scope: !230, file: !231, line: 833, type: !305, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 704, elements: !315)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!315 = !{!316}
!316 = !DISubrange(count: 11)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !319, file: !320, line: 26, type: !322, isLocal: false, isDefinition: true)
!319 = distinct !DICompileUnit(language: DW_LANG_C99, file: !320, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !321, splitDebugInlining: false, nameTableKind: None)
!320 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!321 = !{!317}
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 376, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 47)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "exit_failure", scope: !327, file: !328, line: 24, type: !330, isLocal: false, isDefinition: true)
!327 = distinct !DICompileUnit(language: DW_LANG_C99, file: !328, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !329, splitDebugInlining: false, nameTableKind: None)
!328 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!329 = !{!325}
!330 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !25)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "internal_state", scope: !333, file: !334, line: 97, type: !337, isLocal: true, isDefinition: true)
!333 = distinct !DICompileUnit(language: DW_LANG_C99, file: !334, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !335, globals: !336, splitDebugInlining: false, nameTableKind: None)
!334 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!335 = !{!24, !27, !32}
!336 = !{!331}
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !211, line: 6, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !213, line: 21, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !213, line: 13, size: 64, elements: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !339, file: !213, line: 15, baseType: !25, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !339, file: !213, line: 20, baseType: !343, size: 32, offset: 32)
!343 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !339, file: !213, line: 16, size: 32, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !343, file: !213, line: 18, baseType: !7, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !343, file: !213, line: 19, baseType: !222, size: 32)
!347 = distinct !DICompileUnit(language: DW_LANG_C99, file: !348, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !349, splitDebugInlining: false, nameTableKind: None)
!348 = !DIFile(filename: "src/group-list.c", directory: "/src", checksumkind: CSK_MD5, checksum: "86bc740edd29a2e1277335d35d8d331e")
!349 = !{!24, !350, !32}
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !351, line: 102, baseType: !352)
!351 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !87, line: 73, baseType: !29)
!353 = distinct !DICompileUnit(language: DW_LANG_C99, file: !354, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!354 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!355 = distinct !DICompileUnit(language: DW_LANG_C99, file: !356, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!356 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!357 = distinct !DICompileUnit(language: DW_LANG_C99, file: !358, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !359, retainedTypes: !363, splitDebugInlining: false, nameTableKind: None)
!358 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!359 = !{!360}
!360 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !358, line: 40, baseType: !7, size: 32, elements: !361)
!361 = !{!362}
!362 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!363 = !{!24}
!364 = distinct !DICompileUnit(language: DW_LANG_C99, file: !365, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !366, retainedTypes: !397, splitDebugInlining: false, nameTableKind: None)
!365 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!366 = !{!367, !379}
!367 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !368, file: !365, line: 188, baseType: !7, size: 32, elements: !377)
!368 = distinct !DISubprogram(name: "x2nrealloc", scope: !365, file: !365, line: 176, type: !369, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !364, retainedNodes: !372)
!369 = !DISubroutineType(types: !370)
!370 = !{!24, !24, !371, !27}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!372 = !{!373, !374, !375, !376}
!373 = !DILocalVariable(name: "p", arg: 1, scope: !368, file: !365, line: 176, type: !24)
!374 = !DILocalVariable(name: "pn", arg: 2, scope: !368, file: !365, line: 176, type: !371)
!375 = !DILocalVariable(name: "s", arg: 3, scope: !368, file: !365, line: 176, type: !27)
!376 = !DILocalVariable(name: "n", scope: !368, file: !365, line: 178, type: !27)
!377 = !{!378}
!378 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!379 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !380, file: !365, line: 228, baseType: !7, size: 32, elements: !377)
!380 = distinct !DISubprogram(name: "xpalloc", scope: !365, file: !365, line: 223, type: !381, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !364, retainedNodes: !387)
!381 = !DISubroutineType(types: !382)
!382 = !{!24, !24, !383, !384, !386, !384}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !385, line: 130, baseType: !386)
!385 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !28, line: 35, baseType: !88)
!387 = !{!388, !389, !390, !391, !392, !393, !394, !395, !396}
!388 = !DILocalVariable(name: "pa", arg: 1, scope: !380, file: !365, line: 223, type: !24)
!389 = !DILocalVariable(name: "pn", arg: 2, scope: !380, file: !365, line: 223, type: !383)
!390 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !380, file: !365, line: 223, type: !384)
!391 = !DILocalVariable(name: "n_max", arg: 4, scope: !380, file: !365, line: 223, type: !386)
!392 = !DILocalVariable(name: "s", arg: 5, scope: !380, file: !365, line: 223, type: !384)
!393 = !DILocalVariable(name: "n0", scope: !380, file: !365, line: 230, type: !384)
!394 = !DILocalVariable(name: "n", scope: !380, file: !365, line: 237, type: !384)
!395 = !DILocalVariable(name: "nbytes", scope: !380, file: !365, line: 248, type: !384)
!396 = !DILocalVariable(name: "adjusted_nbytes", scope: !380, file: !365, line: 252, type: !384)
!397 = !{!22, !24, !47, !88, !29}
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!399 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "lib/xgetgroups.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b5210c3f5d54a118d66836a8f2f46b25")
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!403 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!404 = distinct !DICompileUnit(language: DW_LANG_C99, file: !405, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!405 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !363, splitDebugInlining: false, nameTableKind: None)
!407 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!408 = distinct !DICompileUnit(language: DW_LANG_C99, file: !409, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !363, splitDebugInlining: false, nameTableKind: None)
!409 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !412, retainedTypes: !450, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "lib/mgetgroups.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c6d0df677a26dbd2695c193e3d6de3d1")
!412 = !{!413}
!413 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !414, file: !411, line: 79, baseType: !7, size: 32, elements: !448)
!414 = distinct !DISubprogram(name: "mgetgroups", scope: !411, file: !411, line: 66, type: !415, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !410, retainedNodes: !422)
!415 = !DISubroutineType(types: !416)
!416 = !{!25, !30, !417, !420}
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !418, line: 64, baseType: !419)
!418 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !87, line: 147, baseType: !7)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!422 = !{!423, !424, !425, !426, !429, !430, !432, !433, !434, !435, !440, !441, !442, !445, !446}
!423 = !DILocalVariable(name: "username", arg: 1, scope: !414, file: !411, line: 66, type: !30)
!424 = !DILocalVariable(name: "gid", arg: 2, scope: !414, file: !411, line: 66, type: !417)
!425 = !DILocalVariable(name: "groups", arg: 3, scope: !414, file: !411, line: 66, type: !420)
!426 = !DILocalVariable(name: "max_n_groups", scope: !427, file: !411, line: 80, type: !25)
!427 = distinct !DILexicalBlock(scope: !428, file: !411, line: 78, column: 5)
!428 = distinct !DILexicalBlock(scope: !414, file: !411, line: 77, column: 7)
!429 = !DILocalVariable(name: "g", scope: !427, file: !411, line: 82, type: !421)
!430 = !DILocalVariable(name: "last_n_groups", scope: !431, file: !411, line: 88, type: !25)
!431 = distinct !DILexicalBlock(scope: !427, file: !411, line: 87, column: 9)
!432 = !DILocalVariable(name: "ng", scope: !431, file: !411, line: 91, type: !25)
!433 = !DILocalVariable(name: "h", scope: !431, file: !411, line: 98, type: !421)
!434 = !DILocalVariable(name: "max_n_groups", scope: !414, file: !411, line: 118, type: !25)
!435 = !DILocalVariable(name: "g", scope: !436, file: !411, line: 129, type: !421)
!436 = distinct !DILexicalBlock(scope: !437, file: !411, line: 128, column: 9)
!437 = distinct !DILexicalBlock(scope: !438, file: !411, line: 127, column: 11)
!438 = distinct !DILexicalBlock(scope: !439, file: !411, line: 126, column: 5)
!439 = distinct !DILexicalBlock(scope: !414, file: !411, line: 125, column: 7)
!440 = !DILocalVariable(name: "g", scope: !414, file: !411, line: 142, type: !421)
!441 = !DILocalVariable(name: "ng", scope: !414, file: !411, line: 146, type: !25)
!442 = !DILocalVariable(name: "first", scope: !443, file: !411, line: 183, type: !417)
!443 = distinct !DILexicalBlock(scope: !444, file: !411, line: 182, column: 5)
!444 = distinct !DILexicalBlock(scope: !414, file: !411, line: 181, column: 7)
!445 = !DILocalVariable(name: "groups_end", scope: !443, file: !411, line: 184, type: !421)
!446 = !DILocalVariable(name: "next", scope: !447, file: !411, line: 186, type: !421)
!447 = distinct !DILexicalBlock(scope: !443, file: !411, line: 186, column: 7)
!448 = !{!449}
!449 = !DIEnumerator(name: "N_GROUPS_INIT", value: 10)
!450 = !{!24, !417}
!451 = distinct !DICompileUnit(language: DW_LANG_C99, file: !452, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !453, splitDebugInlining: false, nameTableKind: None)
!452 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!453 = !{!47, !29, !24}
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!455 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!458 = distinct !DICompileUnit(language: DW_LANG_C99, file: !459, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !363, splitDebugInlining: false, nameTableKind: None)
!459 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!460 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!461 = !{i32 7, !"Dwarf Version", i32 5}
!462 = !{i32 2, !"Debug Info Version", i32 3}
!463 = !{i32 1, !"wchar_size", i32 4}
!464 = !{i32 1, !"branch-target-enforcement", i32 0}
!465 = !{i32 1, !"sign-return-address", i32 0}
!466 = !{i32 1, !"sign-return-address-all", i32 0}
!467 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!468 = !{i32 7, !"PIC Level", i32 2}
!469 = !{i32 7, !"PIE Level", i32 2}
!470 = !{i32 7, !"uwtable", i32 1}
!471 = !{i32 7, !"frame-pointer", i32 1}
!472 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 47, type: !473, scopeLine: 48, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !475)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !25}
!475 = !{!476}
!476 = !DILocalVariable(name: "status", arg: 1, scope: !472, file: !3, line: 47, type: !25)
!477 = !DILocation(line: 0, scope: !472)
!478 = !DILocation(line: 49, column: 14, scope: !479)
!479 = distinct !DILexicalBlock(scope: !472, file: !3, line: 49, column: 7)
!480 = !DILocation(line: 49, column: 7, scope: !472)
!481 = !DILocation(line: 50, column: 5, scope: !482)
!482 = distinct !DILexicalBlock(scope: !479, file: !3, line: 50, column: 5)
!483 = !{!484, !484, i64 0}
!484 = !{!"any pointer", !485, i64 0}
!485 = !{!"omnipotent char", !486, i64 0}
!486 = !{!"Simple C/C++ TBAA"}
!487 = !DILocation(line: 53, column: 7, scope: !488)
!488 = distinct !DILexicalBlock(scope: !479, file: !3, line: 52, column: 5)
!489 = !DILocation(line: 54, column: 7, scope: !488)
!490 = !DILocation(line: 59, column: 7, scope: !488)
!491 = !DILocation(line: 60, column: 7, scope: !488)
!492 = !DILocalVariable(name: "program", arg: 1, scope: !493, file: !37, line: 836, type: !30)
!493 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !37, file: !37, line: 836, type: !494, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !496)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !30}
!496 = !{!492, !497, !506, !507, !509, !510}
!497 = !DILocalVariable(name: "infomap", scope: !493, file: !37, line: 838, type: !498)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 896, elements: !504)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !493, file: !37, line: 838, size: 128, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !500, file: !37, line: 838, baseType: !30, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !500, file: !37, line: 838, baseType: !30, size: 64, offset: 64)
!504 = !{!505}
!505 = !DISubrange(count: 7)
!506 = !DILocalVariable(name: "node", scope: !493, file: !37, line: 848, type: !30)
!507 = !DILocalVariable(name: "map_prog", scope: !493, file: !37, line: 849, type: !508)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!509 = !DILocalVariable(name: "lc_messages", scope: !493, file: !37, line: 861, type: !30)
!510 = !DILocalVariable(name: "url_program", scope: !493, file: !37, line: 874, type: !30)
!511 = !DILocation(line: 0, scope: !493, inlinedAt: !512)
!512 = distinct !DILocation(line: 61, column: 7, scope: !488)
!513 = !DILocation(line: 838, column: 3, scope: !493, inlinedAt: !512)
!514 = !DILocation(line: 838, column: 67, scope: !493, inlinedAt: !512)
!515 = !DILocation(line: 849, column: 36, scope: !493, inlinedAt: !512)
!516 = !DILocation(line: 851, column: 3, scope: !493, inlinedAt: !512)
!517 = !DILocalVariable(name: "__s1", arg: 1, scope: !518, file: !519, line: 1359, type: !30)
!518 = distinct !DISubprogram(name: "streq", scope: !519, file: !519, line: 1359, type: !520, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !522)
!519 = !DIFile(filename: "./lib/string.h", directory: "/src")
!520 = !DISubroutineType(types: !521)
!521 = !{!47, !30, !30}
!522 = !{!517, !523}
!523 = !DILocalVariable(name: "__s2", arg: 2, scope: !518, file: !519, line: 1359, type: !30)
!524 = !DILocation(line: 0, scope: !518, inlinedAt: !525)
!525 = distinct !DILocation(line: 851, column: 33, scope: !493, inlinedAt: !512)
!526 = !DILocation(line: 1361, column: 11, scope: !518, inlinedAt: !525)
!527 = !DILocation(line: 1361, column: 10, scope: !518, inlinedAt: !525)
!528 = !DILocation(line: 852, column: 13, scope: !493, inlinedAt: !512)
!529 = !DILocation(line: 851, column: 20, scope: !493, inlinedAt: !512)
!530 = !{!531, !484, i64 0}
!531 = !{!"infomap", !484, i64 0, !484, i64 8}
!532 = !DILocation(line: 851, column: 10, scope: !493, inlinedAt: !512)
!533 = !DILocation(line: 851, column: 28, scope: !493, inlinedAt: !512)
!534 = distinct !{!534, !516, !528, !535}
!535 = !{!"llvm.loop.mustprogress"}
!536 = !DILocation(line: 854, column: 17, scope: !537, inlinedAt: !512)
!537 = distinct !DILexicalBlock(scope: !493, file: !37, line: 854, column: 7)
!538 = !{!531, !484, i64 8}
!539 = !DILocation(line: 854, column: 7, scope: !537, inlinedAt: !512)
!540 = !DILocation(line: 854, column: 7, scope: !493, inlinedAt: !512)
!541 = !DILocation(line: 857, column: 3, scope: !493, inlinedAt: !512)
!542 = !DILocation(line: 861, column: 29, scope: !493, inlinedAt: !512)
!543 = !DILocation(line: 862, column: 7, scope: !544, inlinedAt: !512)
!544 = distinct !DILexicalBlock(scope: !493, file: !37, line: 862, column: 7)
!545 = !DILocation(line: 862, column: 19, scope: !544, inlinedAt: !512)
!546 = !DILocation(line: 862, column: 22, scope: !544, inlinedAt: !512)
!547 = !DILocation(line: 862, column: 7, scope: !493, inlinedAt: !512)
!548 = !DILocation(line: 868, column: 7, scope: !549, inlinedAt: !512)
!549 = distinct !DILexicalBlock(scope: !544, file: !37, line: 863, column: 5)
!550 = !DILocation(line: 870, column: 5, scope: !549, inlinedAt: !512)
!551 = !DILocation(line: 0, scope: !518, inlinedAt: !552)
!552 = distinct !DILocation(line: 874, column: 29, scope: !493, inlinedAt: !512)
!553 = !DILocation(line: 875, column: 3, scope: !493, inlinedAt: !512)
!554 = !DILocation(line: 877, column: 3, scope: !493, inlinedAt: !512)
!555 = !DILocation(line: 879, column: 1, scope: !493, inlinedAt: !512)
!556 = !DILocation(line: 63, column: 3, scope: !472)
!557 = !DISubprogram(name: "dcgettext", scope: !558, file: !558, line: 51, type: !559, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!558 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!559 = !DISubroutineType(types: !560)
!560 = !{!22, !30, !30, !25}
!561 = !{}
!562 = !DISubprogram(name: "fputs_unlocked", scope: !157, file: !157, line: 691, type: !563, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!563 = !DISubroutineType(types: !564)
!564 = !{!25, !565, !566}
!565 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !30)
!566 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !60)
!567 = !DILocation(line: 0, scope: !36)
!568 = !DILocation(line: 581, column: 7, scope: !45)
!569 = !{!570, !570, i64 0}
!570 = !{!"int", !485, i64 0}
!571 = !DILocation(line: 581, column: 19, scope: !45)
!572 = !DILocation(line: 581, column: 7, scope: !36)
!573 = !DILocation(line: 585, column: 26, scope: !44)
!574 = !DILocation(line: 0, scope: !44)
!575 = !DILocation(line: 586, column: 23, scope: !44)
!576 = !DILocation(line: 586, column: 28, scope: !44)
!577 = !DILocation(line: 586, column: 32, scope: !44)
!578 = !{!485, !485, i64 0}
!579 = !DILocation(line: 586, column: 38, scope: !44)
!580 = !DILocation(line: 0, scope: !518, inlinedAt: !581)
!581 = distinct !DILocation(line: 586, column: 41, scope: !44)
!582 = !DILocation(line: 1361, column: 11, scope: !518, inlinedAt: !581)
!583 = !DILocation(line: 1361, column: 10, scope: !518, inlinedAt: !581)
!584 = !DILocation(line: 586, column: 19, scope: !44)
!585 = !DILocation(line: 587, column: 5, scope: !44)
!586 = !DILocation(line: 588, column: 7, scope: !587)
!587 = distinct !DILexicalBlock(scope: !36, file: !37, line: 588, column: 7)
!588 = !DILocation(line: 588, column: 7, scope: !36)
!589 = !DILocation(line: 590, column: 7, scope: !590)
!590 = distinct !DILexicalBlock(scope: !587, file: !37, line: 589, column: 5)
!591 = !DILocation(line: 591, column: 7, scope: !590)
!592 = !DILocation(line: 595, column: 37, scope: !36)
!593 = !DILocation(line: 595, column: 35, scope: !36)
!594 = !DILocation(line: 596, column: 29, scope: !36)
!595 = !DILocation(line: 597, column: 8, scope: !53)
!596 = !DILocation(line: 597, column: 7, scope: !36)
!597 = !DILocation(line: 604, column: 24, scope: !52)
!598 = !DILocation(line: 604, column: 12, scope: !53)
!599 = !DILocation(line: 0, scope: !51)
!600 = !DILocation(line: 610, column: 16, scope: !51)
!601 = !DILocation(line: 610, column: 7, scope: !51)
!602 = !DILocation(line: 611, column: 21, scope: !51)
!603 = !{!604, !604, i64 0}
!604 = !{!"short", !485, i64 0}
!605 = !DILocation(line: 611, column: 19, scope: !51)
!606 = !DILocation(line: 611, column: 16, scope: !51)
!607 = !DILocation(line: 610, column: 30, scope: !51)
!608 = distinct !{!608, !601, !602, !535}
!609 = !DILocation(line: 612, column: 18, scope: !610)
!610 = distinct !DILexicalBlock(scope: !51, file: !37, line: 612, column: 11)
!611 = !DILocation(line: 612, column: 11, scope: !51)
!612 = !DILocation(line: 620, column: 23, scope: !36)
!613 = !DILocation(line: 625, column: 39, scope: !36)
!614 = !DILocation(line: 626, column: 3, scope: !36)
!615 = !DILocation(line: 626, column: 10, scope: !36)
!616 = !DILocation(line: 626, column: 21, scope: !36)
!617 = !DILocation(line: 628, column: 44, scope: !618)
!618 = distinct !DILexicalBlock(scope: !619, file: !37, line: 628, column: 11)
!619 = distinct !DILexicalBlock(scope: !36, file: !37, line: 627, column: 5)
!620 = !DILocation(line: 628, column: 32, scope: !618)
!621 = !DILocation(line: 628, column: 49, scope: !618)
!622 = !DILocation(line: 628, column: 11, scope: !619)
!623 = !DILocation(line: 630, column: 11, scope: !624)
!624 = distinct !DILexicalBlock(scope: !619, file: !37, line: 630, column: 11)
!625 = !DILocation(line: 630, column: 11, scope: !619)
!626 = !DILocation(line: 632, column: 26, scope: !627)
!627 = distinct !DILexicalBlock(scope: !628, file: !37, line: 632, column: 15)
!628 = distinct !DILexicalBlock(scope: !624, file: !37, line: 631, column: 9)
!629 = !DILocation(line: 632, column: 34, scope: !627)
!630 = !DILocation(line: 632, column: 37, scope: !627)
!631 = !DILocation(line: 632, column: 15, scope: !628)
!632 = !DILocation(line: 636, column: 29, scope: !633)
!633 = distinct !DILexicalBlock(scope: !628, file: !37, line: 636, column: 15)
!634 = !DILocation(line: 640, column: 16, scope: !619)
!635 = distinct !{!635, !614, !636, !535}
!636 = !DILocation(line: 641, column: 5, scope: !36)
!637 = !DILocation(line: 644, column: 3, scope: !36)
!638 = !DILocation(line: 0, scope: !518, inlinedAt: !639)
!639 = distinct !DILocation(line: 648, column: 31, scope: !36)
!640 = !DILocation(line: 0, scope: !518, inlinedAt: !641)
!641 = distinct !DILocation(line: 649, column: 31, scope: !36)
!642 = !DILocation(line: 0, scope: !518, inlinedAt: !643)
!643 = distinct !DILocation(line: 650, column: 31, scope: !36)
!644 = !DILocation(line: 0, scope: !518, inlinedAt: !645)
!645 = distinct !DILocation(line: 651, column: 31, scope: !36)
!646 = !DILocation(line: 0, scope: !518, inlinedAt: !647)
!647 = distinct !DILocation(line: 652, column: 31, scope: !36)
!648 = !DILocation(line: 0, scope: !518, inlinedAt: !649)
!649 = distinct !DILocation(line: 653, column: 31, scope: !36)
!650 = !DILocation(line: 0, scope: !518, inlinedAt: !651)
!651 = distinct !DILocation(line: 654, column: 31, scope: !36)
!652 = !DILocation(line: 0, scope: !518, inlinedAt: !653)
!653 = distinct !DILocation(line: 655, column: 31, scope: !36)
!654 = !DILocation(line: 0, scope: !518, inlinedAt: !655)
!655 = distinct !DILocation(line: 656, column: 31, scope: !36)
!656 = !DILocation(line: 0, scope: !518, inlinedAt: !657)
!657 = distinct !DILocation(line: 657, column: 31, scope: !36)
!658 = !DILocation(line: 663, column: 7, scope: !659)
!659 = distinct !DILexicalBlock(scope: !36, file: !37, line: 663, column: 7)
!660 = !DILocation(line: 664, column: 7, scope: !659)
!661 = !DILocation(line: 664, column: 10, scope: !659)
!662 = !DILocation(line: 663, column: 7, scope: !36)
!663 = !DILocation(line: 669, column: 7, scope: !664)
!664 = distinct !DILexicalBlock(scope: !659, file: !37, line: 665, column: 5)
!665 = !DILocation(line: 671, column: 5, scope: !664)
!666 = !DILocation(line: 676, column: 7, scope: !667)
!667 = distinct !DILexicalBlock(scope: !659, file: !37, line: 673, column: 5)
!668 = !DILocation(line: 679, column: 3, scope: !36)
!669 = !DILocation(line: 683, column: 3, scope: !36)
!670 = !DILocation(line: 686, column: 3, scope: !36)
!671 = !DILocation(line: 688, column: 3, scope: !36)
!672 = !DILocation(line: 691, column: 3, scope: !36)
!673 = !DILocation(line: 695, column: 3, scope: !36)
!674 = !DILocation(line: 696, column: 1, scope: !36)
!675 = !DISubprogram(name: "setlocale", scope: !676, file: !676, line: 122, type: !677, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!676 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!677 = !DISubroutineType(types: !678)
!678 = !{!22, !25, !30}
!679 = !DISubprogram(name: "getenv", scope: !680, file: !680, line: 641, type: !681, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!680 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!681 = !DISubroutineType(types: !682)
!682 = !{!22, !30}
!683 = !DISubprogram(name: "fwrite_unlocked", scope: !157, file: !157, line: 704, type: !684, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!684 = !DISubroutineType(types: !685)
!685 = !{!27, !686, !27, !27, !566}
!686 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!689 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 67, type: !690, scopeLine: 68, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !693)
!690 = !DISubroutineType(types: !691)
!691 = !{!25, !25, !692}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!693 = !{!694, !695, !696, !697, !698, !703, !704, !705, !706, !707, !723, !724, !725}
!694 = !DILocalVariable(name: "argc", arg: 1, scope: !689, file: !3, line: 67, type: !25)
!695 = !DILocalVariable(name: "argv", arg: 2, scope: !689, file: !3, line: 67, type: !692)
!696 = !DILocalVariable(name: "optc", scope: !689, file: !3, line: 79, type: !25)
!697 = !DILocalVariable(name: "ok", scope: !689, file: !3, line: 91, type: !47)
!698 = !DILocalVariable(name: "NO_UID", scope: !699, file: !3, line: 95, type: !701)
!699 = distinct !DILexicalBlock(scope: !700, file: !3, line: 93, column: 5)
!700 = distinct !DILexicalBlock(scope: !689, file: !3, line: 92, column: 7)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !418, line: 79, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !87, line: 146, baseType: !7)
!703 = !DILocalVariable(name: "NO_GID", scope: !699, file: !3, line: 96, type: !417)
!704 = !DILocalVariable(name: "ruid", scope: !699, file: !3, line: 99, type: !701)
!705 = !DILocalVariable(name: "egid", scope: !699, file: !3, line: 104, type: !417)
!706 = !DILocalVariable(name: "rgid", scope: !699, file: !3, line: 109, type: !417)
!707 = !DILocalVariable(name: "pwd", scope: !708, file: !3, line: 122, type: !712)
!708 = distinct !DILexicalBlock(scope: !709, file: !3, line: 121, column: 9)
!709 = distinct !DILexicalBlock(scope: !710, file: !3, line: 120, column: 7)
!710 = distinct !DILexicalBlock(scope: !711, file: !3, line: 120, column: 7)
!711 = distinct !DILexicalBlock(scope: !700, file: !3, line: 118, column: 5)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !714, line: 49, size: 384, elements: !715)
!714 = !DIFile(filename: "/usr/include/pwd.h", directory: "", checksumkind: CSK_MD5, checksum: "6682d47abdfe13134f841d46e0eadc7b")
!715 = !{!716, !717, !718, !719, !720, !721, !722}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !713, file: !714, line: 51, baseType: !22, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !713, file: !714, line: 52, baseType: !22, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !713, file: !714, line: 54, baseType: !702, size: 32, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !713, file: !714, line: 55, baseType: !419, size: 32, offset: 160)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !713, file: !714, line: 56, baseType: !22, size: 64, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !713, file: !714, line: 57, baseType: !22, size: 64, offset: 256)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !713, file: !714, line: 58, baseType: !22, size: 64, offset: 320)
!723 = !DILocalVariable(name: "ruid", scope: !708, file: !3, line: 129, type: !701)
!724 = !DILocalVariable(name: "rgid", scope: !708, file: !3, line: 130, type: !417)
!725 = !DILocalVariable(name: "egid", scope: !708, file: !3, line: 131, type: !417)
!726 = !DILocation(line: 0, scope: !689)
!727 = !DILocation(line: 70, column: 21, scope: !689)
!728 = !DILocation(line: 70, column: 3, scope: !689)
!729 = !DILocation(line: 71, column: 3, scope: !689)
!730 = !DILocation(line: 72, column: 3, scope: !689)
!731 = !DILocation(line: 73, column: 3, scope: !689)
!732 = !DILocation(line: 75, column: 3, scope: !689)
!733 = !DILocation(line: 80, column: 18, scope: !689)
!734 = !DILocation(line: 80, column: 3, scope: !689)
!735 = !DILocation(line: 84, column: 9, scope: !736)
!736 = distinct !DILexicalBlock(scope: !737, file: !3, line: 83, column: 9)
!737 = distinct !DILexicalBlock(scope: !689, file: !3, line: 81, column: 5)
!738 = !DILocation(line: 85, column: 9, scope: !736)
!739 = !DILocation(line: 87, column: 11, scope: !736)
!740 = !DILocation(line: 92, column: 7, scope: !700)
!741 = !DILocation(line: 92, column: 14, scope: !700)
!742 = !DILocation(line: 92, column: 7, scope: !689)
!743 = !DILocation(line: 120, column: 22, scope: !709)
!744 = !DILocation(line: 120, column: 7, scope: !710)
!745 = !DILocation(line: 0, scope: !699)
!746 = !DILocation(line: 98, column: 7, scope: !699)
!747 = !DILocation(line: 98, column: 13, scope: !699)
!748 = !DILocation(line: 99, column: 20, scope: !699)
!749 = !DILocation(line: 100, column: 16, scope: !750)
!750 = distinct !DILexicalBlock(scope: !699, file: !3, line: 100, column: 11)
!751 = !DILocation(line: 100, column: 26, scope: !750)
!752 = !DILocation(line: 100, column: 29, scope: !750)
!753 = !DILocation(line: 100, column: 11, scope: !699)
!754 = !DILocation(line: 101, column: 9, scope: !750)
!755 = !DILocation(line: 103, column: 13, scope: !699)
!756 = !DILocation(line: 104, column: 20, scope: !699)
!757 = !DILocation(line: 105, column: 16, scope: !758)
!758 = distinct !DILexicalBlock(scope: !699, file: !3, line: 105, column: 11)
!759 = !DILocation(line: 105, column: 26, scope: !758)
!760 = !DILocation(line: 105, column: 29, scope: !758)
!761 = !DILocation(line: 105, column: 11, scope: !699)
!762 = !DILocation(line: 106, column: 9, scope: !758)
!763 = !DILocation(line: 108, column: 13, scope: !699)
!764 = !DILocation(line: 109, column: 20, scope: !699)
!765 = !DILocation(line: 110, column: 16, scope: !766)
!766 = distinct !DILexicalBlock(scope: !699, file: !3, line: 110, column: 11)
!767 = !DILocation(line: 110, column: 26, scope: !766)
!768 = !DILocation(line: 110, column: 29, scope: !766)
!769 = !DILocation(line: 110, column: 11, scope: !699)
!770 = !DILocation(line: 111, column: 9, scope: !766)
!771 = !DILocation(line: 113, column: 12, scope: !772)
!772 = distinct !DILexicalBlock(scope: !699, file: !3, line: 113, column: 11)
!773 = !DILocalVariable(name: "__c", arg: 1, scope: !774, file: !775, line: 108, type: !25)
!774 = distinct !DISubprogram(name: "putchar_unlocked", scope: !775, file: !775, line: 108, type: !776, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !778)
!775 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!776 = !DISubroutineType(types: !777)
!777 = !{!25, !25}
!778 = !{!773}
!779 = !DILocation(line: 0, scope: !774, inlinedAt: !780)
!780 = distinct !DILocation(line: 115, column: 7, scope: !699)
!781 = !DILocation(line: 110, column: 10, scope: !774, inlinedAt: !780)
!782 = !{!783, !484, i64 40}
!783 = !{!"_IO_FILE", !570, i64 0, !484, i64 8, !484, i64 16, !484, i64 24, !484, i64 32, !484, i64 40, !484, i64 48, !484, i64 56, !484, i64 64, !484, i64 72, !484, i64 80, !484, i64 88, !484, i64 96, !484, i64 104, !570, i64 112, !570, i64 116, !784, i64 120, !604, i64 128, !485, i64 130, !485, i64 131, !484, i64 136, !784, i64 144, !484, i64 152, !484, i64 160, !484, i64 168, !484, i64 176, !784, i64 184, !570, i64 192, !485, i64 196}
!784 = !{!"long", !485, i64 0}
!785 = !{!783, !484, i64 48}
!786 = !{!"branch_weights", i32 2000, i32 1}
!787 = !DILocation(line: 122, column: 42, scope: !708)
!788 = !DILocation(line: 122, column: 32, scope: !708)
!789 = !DILocation(line: 0, scope: !708)
!790 = !DILocation(line: 123, column: 19, scope: !791)
!791 = distinct !DILexicalBlock(scope: !708, file: !3, line: 123, column: 15)
!792 = !DILocation(line: 123, column: 15, scope: !708)
!793 = !DILocation(line: 125, column: 15, scope: !794)
!794 = distinct !DILexicalBlock(scope: !791, file: !3, line: 124, column: 13)
!795 = !DILocation(line: 127, column: 15, scope: !794)
!796 = !DILocation(line: 129, column: 29, scope: !708)
!797 = !{!798, !570, i64 16}
!798 = !{!"passwd", !484, i64 0, !484, i64 8, !570, i64 16, !570, i64 20, !484, i64 24, !484, i64 32, !484, i64 40}
!799 = !DILocation(line: 130, column: 29, scope: !708)
!800 = !{!798, !570, i64 20}
!801 = !DILocation(line: 133, column: 11, scope: !708)
!802 = !DILocation(line: 134, column: 39, scope: !803)
!803 = distinct !DILexicalBlock(scope: !708, file: !3, line: 134, column: 15)
!804 = !DILocation(line: 134, column: 34, scope: !803)
!805 = !DILocation(line: 134, column: 16, scope: !803)
!806 = !DILocation(line: 134, column: 15, scope: !708)
!807 = !DILocation(line: 0, scope: !774, inlinedAt: !808)
!808 = distinct !DILocation(line: 136, column: 11, scope: !708)
!809 = !DILocation(line: 110, column: 10, scope: !774, inlinedAt: !808)
!810 = !DILocation(line: 138, column: 15, scope: !811)
!811 = distinct !DILexicalBlock(scope: !708, file: !3, line: 138, column: 15)
!812 = !DILocalVariable(name: "__stream", arg: 1, scope: !813, file: !775, line: 135, type: !60)
!813 = distinct !DISubprogram(name: "ferror_unlocked", scope: !775, file: !775, line: 135, type: !814, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !816)
!814 = !DISubroutineType(types: !815)
!815 = !{!25, !60}
!816 = !{!812}
!817 = !DILocation(line: 0, scope: !813, inlinedAt: !818)
!818 = distinct !DILocation(line: 138, column: 15, scope: !811)
!819 = !DILocation(line: 137, column: 10, scope: !813, inlinedAt: !818)
!820 = !{!783, !570, i64 0}
!821 = !DILocation(line: 138, column: 15, scope: !708)
!822 = !DILocation(line: 948, column: 21, scope: !823, inlinedAt: !826)
!823 = distinct !DISubprogram(name: "write_error", scope: !37, file: !37, line: 946, type: !184, scopeLine: 947, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !824)
!824 = !{!825}
!825 = !DILocalVariable(name: "saved_errno", scope: !823, file: !37, line: 948, type: !25)
!826 = distinct !DILocation(line: 139, column: 13, scope: !811)
!827 = !DILocation(line: 0, scope: !823, inlinedAt: !826)
!828 = !DILocation(line: 949, column: 3, scope: !823, inlinedAt: !826)
!829 = !DILocation(line: 950, column: 11, scope: !823, inlinedAt: !826)
!830 = !DILocation(line: 950, column: 3, scope: !823, inlinedAt: !826)
!831 = !DILocation(line: 951, column: 3, scope: !823, inlinedAt: !826)
!832 = !DILocation(line: 952, column: 3, scope: !823, inlinedAt: !826)
!833 = !DILocation(line: 120, column: 36, scope: !709)
!834 = distinct !{!834, !744, !835, !535}
!835 = !DILocation(line: 140, column: 9, scope: !710)
!836 = !DILocation(line: 143, column: 10, scope: !689)
!837 = !DILocation(line: 144, column: 1, scope: !689)
!838 = !DISubprogram(name: "bindtextdomain", scope: !558, file: !558, line: 86, type: !839, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!839 = !DISubroutineType(types: !840)
!840 = !{!22, !30, !30}
!841 = !DISubprogram(name: "textdomain", scope: !558, file: !558, line: 82, type: !681, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!842 = !DISubprogram(name: "atexit", scope: !680, file: !680, line: 602, type: !843, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!843 = !DISubroutineType(types: !844)
!844 = !{!25, !183}
!845 = !DISubprogram(name: "getopt_long", scope: !124, file: !124, line: 66, type: !846, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!846 = !DISubroutineType(types: !847)
!847 = !{!25, !25, !848, !30, !850, !129}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!851 = !DISubprogram(name: "getuid", scope: !852, file: !852, line: 697, type: !853, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!852 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!853 = !DISubroutineType(types: !854)
!854 = !{!702}
!855 = !DISubprogram(name: "getegid", scope: !852, file: !852, line: 706, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!856 = !DISubroutineType(types: !857)
!857 = !{!419}
!858 = !DISubprogram(name: "getgid", scope: !852, file: !852, line: 703, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!859 = !DISubprogram(name: "getpwnam", scope: !714, file: !714, line: 116, type: !860, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!860 = !DISubroutineType(types: !861)
!861 = !{!712, !30}
!862 = !DISubprogram(name: "fflush_unlocked", scope: !157, file: !157, line: 239, type: !814, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!863 = !DISubprogram(name: "clearerr_unlocked", scope: !157, file: !157, line: 794, type: !864, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!864 = !DISubroutineType(types: !865)
!865 = !{null, !60}
!866 = distinct !DISubprogram(name: "print_group_list", scope: !348, file: !348, line: 35, type: !867, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !347, retainedNodes: !869)
!867 = !DISubroutineType(types: !868)
!868 = !{!47, !30, !701, !417, !417, !47, !23}
!869 = !{!870, !871, !872, !873, !874, !875, !876, !877, !888, !890, !891}
!870 = !DILocalVariable(name: "username", arg: 1, scope: !866, file: !348, line: 35, type: !30)
!871 = !DILocalVariable(name: "ruid", arg: 2, scope: !866, file: !348, line: 36, type: !701)
!872 = !DILocalVariable(name: "rgid", arg: 3, scope: !866, file: !348, line: 36, type: !417)
!873 = !DILocalVariable(name: "egid", arg: 4, scope: !866, file: !348, line: 36, type: !417)
!874 = !DILocalVariable(name: "use_names", arg: 5, scope: !866, file: !348, line: 37, type: !47)
!875 = !DILocalVariable(name: "delim", arg: 6, scope: !866, file: !348, line: 37, type: !23)
!876 = !DILocalVariable(name: "ok", scope: !866, file: !348, line: 39, type: !47)
!877 = !DILocalVariable(name: "pwd", scope: !866, file: !348, line: 40, type: !878)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !714, line: 49, size: 384, elements: !880)
!880 = !{!881, !882, !883, !884, !885, !886, !887}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !879, file: !714, line: 51, baseType: !22, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !879, file: !714, line: 52, baseType: !22, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !879, file: !714, line: 54, baseType: !702, size: 32, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !879, file: !714, line: 55, baseType: !419, size: 32, offset: 160)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !879, file: !714, line: 56, baseType: !22, size: 64, offset: 192)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !879, file: !714, line: 57, baseType: !22, size: 64, offset: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !879, file: !714, line: 58, baseType: !22, size: 64, offset: 320)
!888 = !DILocalVariable(name: "groups", scope: !889, file: !348, line: 60, type: !421)
!889 = distinct !DILexicalBlock(scope: !866, file: !348, line: 59, column: 3)
!890 = !DILocalVariable(name: "n_groups", scope: !889, file: !348, line: 62, type: !25)
!891 = !DILocalVariable(name: "i", scope: !892, file: !348, line: 77, type: !25)
!892 = distinct !DILexicalBlock(scope: !889, file: !348, line: 77, column: 5)
!893 = !DILocation(line: 0, scope: !866)
!894 = !DILocation(line: 42, column: 7, scope: !895)
!895 = distinct !DILexicalBlock(scope: !866, file: !348, line: 42, column: 7)
!896 = !DILocation(line: 42, column: 7, scope: !866)
!897 = !DILocation(line: 44, column: 13, scope: !898)
!898 = distinct !DILexicalBlock(scope: !895, file: !348, line: 43, column: 5)
!899 = !DILocation(line: 45, column: 15, scope: !900)
!900 = distinct !DILexicalBlock(scope: !898, file: !348, line: 45, column: 11)
!901 = !DILocation(line: 45, column: 11, scope: !898)
!902 = !DILocalVariable(name: "gid", arg: 1, scope: !903, file: !348, line: 91, type: !417)
!903 = distinct !DISubprogram(name: "print_group", scope: !348, file: !348, line: 91, type: !904, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !347, retainedNodes: !906)
!904 = !DISubroutineType(types: !905)
!905 = !{!47, !417, !47}
!906 = !{!902, !907, !908, !917, !918}
!907 = !DILocalVariable(name: "use_name", arg: 2, scope: !903, file: !348, line: 91, type: !47)
!908 = !DILocalVariable(name: "grp", scope: !903, file: !348, line: 93, type: !909)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !911, line: 42, size: 256, elements: !912)
!911 = !DIFile(filename: "/usr/include/grp.h", directory: "", checksumkind: CSK_MD5, checksum: "17838c4acd24e08e5bed6821e9e2c084")
!912 = !{!913, !914, !915, !916}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !910, file: !911, line: 44, baseType: !22, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !910, file: !911, line: 45, baseType: !22, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !910, file: !911, line: 46, baseType: !419, size: 32, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !910, file: !911, line: 47, baseType: !692, size: 64, offset: 192)
!917 = !DILocalVariable(name: "ok", scope: !903, file: !348, line: 94, type: !47)
!918 = !DILocalVariable(name: "g", scope: !919, file: !348, line: 108, type: !350)
!919 = distinct !DILexicalBlock(scope: !920, file: !348, line: 107, column: 13)
!920 = distinct !DILexicalBlock(scope: !921, file: !348, line: 101, column: 15)
!921 = distinct !DILexicalBlock(scope: !922, file: !348, line: 100, column: 9)
!922 = distinct !DILexicalBlock(scope: !923, file: !348, line: 99, column: 11)
!923 = distinct !DILexicalBlock(scope: !924, file: !348, line: 97, column: 5)
!924 = distinct !DILexicalBlock(scope: !903, file: !348, line: 96, column: 7)
!925 = !DILocation(line: 0, scope: !903, inlinedAt: !926)
!926 = distinct !DILocation(line: 49, column: 8, scope: !927)
!927 = distinct !DILexicalBlock(scope: !866, file: !348, line: 49, column: 7)
!928 = !DILocation(line: 96, column: 7, scope: !903, inlinedAt: !926)
!929 = !DILocation(line: 118, column: 5, scope: !930, inlinedAt: !926)
!930 = distinct !DILexicalBlock(scope: !903, file: !348, line: 115, column: 7)
!931 = !DILocation(line: 98, column: 13, scope: !923, inlinedAt: !926)
!932 = !DILocation(line: 99, column: 15, scope: !922, inlinedAt: !926)
!933 = !DILocation(line: 99, column: 11, scope: !923, inlinedAt: !926)
!934 = !DILocation(line: 108, column: 29, scope: !919, inlinedAt: !926)
!935 = !DILocation(line: 0, scope: !919, inlinedAt: !926)
!936 = !DILocation(line: 109, column: 15, scope: !919, inlinedAt: !926)
!937 = !DILocation(line: 112, column: 9, scope: !921, inlinedAt: !926)
!938 = !DILocation(line: 116, column: 5, scope: !930, inlinedAt: !926)
!939 = !{!940, !484, i64 0}
!940 = !{!"group", !484, i64 0, !484, i64 8, !570, i64 16, !484, i64 24}
!941 = !DILocation(line: 52, column: 12, scope: !942)
!942 = distinct !DILexicalBlock(scope: !866, file: !348, line: 52, column: 7)
!943 = !DILocation(line: 52, column: 7, scope: !866)
!944 = !DILocalVariable(name: "__c", arg: 1, scope: !945, file: !775, line: 108, type: !25)
!945 = distinct !DISubprogram(name: "putchar_unlocked", scope: !775, file: !775, line: 108, type: !776, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !347, retainedNodes: !946)
!946 = !{!944}
!947 = !DILocation(line: 0, scope: !945, inlinedAt: !948)
!948 = distinct !DILocation(line: 54, column: 7, scope: !949)
!949 = distinct !DILexicalBlock(scope: !942, file: !348, line: 53, column: 5)
!950 = !DILocation(line: 110, column: 10, scope: !945, inlinedAt: !948)
!951 = !DILocation(line: 54, column: 7, scope: !949)
!952 = !DILocation(line: 0, scope: !903, inlinedAt: !953)
!953 = distinct !DILocation(line: 55, column: 12, scope: !954)
!954 = distinct !DILexicalBlock(scope: !949, file: !348, line: 55, column: 11)
!955 = !DILocation(line: 96, column: 7, scope: !903, inlinedAt: !953)
!956 = !DILocation(line: 118, column: 5, scope: !930, inlinedAt: !953)
!957 = !DILocation(line: 98, column: 13, scope: !923, inlinedAt: !953)
!958 = !DILocation(line: 99, column: 15, scope: !922, inlinedAt: !953)
!959 = !DILocation(line: 99, column: 11, scope: !923, inlinedAt: !953)
!960 = !DILocation(line: 108, column: 29, scope: !919, inlinedAt: !953)
!961 = !DILocation(line: 0, scope: !919, inlinedAt: !953)
!962 = !DILocation(line: 109, column: 15, scope: !919, inlinedAt: !953)
!963 = !DILocation(line: 112, column: 9, scope: !921, inlinedAt: !953)
!964 = !DILocation(line: 116, column: 5, scope: !930, inlinedAt: !953)
!965 = !DILocation(line: 60, column: 5, scope: !889)
!966 = !DILocation(line: 62, column: 43, scope: !889)
!967 = !DILocation(line: 62, column: 54, scope: !889)
!968 = !DILocation(line: 0, scope: !889)
!969 = !DILocation(line: 62, column: 20, scope: !889)
!970 = !DILocation(line: 63, column: 18, scope: !971)
!971 = distinct !DILexicalBlock(scope: !889, file: !348, line: 63, column: 9)
!972 = !DILocation(line: 63, column: 9, scope: !889)
!973 = !DILocation(line: 0, scope: !892)
!974 = !DILocation(line: 77, column: 23, scope: !975)
!975 = distinct !DILexicalBlock(scope: !892, file: !348, line: 77, column: 5)
!976 = !DILocation(line: 77, column: 5, scope: !892)
!977 = !DILocation(line: 96, column: 7, scope: !903, inlinedAt: !978)
!978 = distinct !DILocation(line: 81, column: 16, scope: !979)
!979 = distinct !DILexicalBlock(scope: !980, file: !348, line: 81, column: 15)
!980 = distinct !DILexicalBlock(scope: !981, file: !348, line: 79, column: 9)
!981 = distinct !DILexicalBlock(scope: !975, file: !348, line: 78, column: 11)
!982 = !DILocation(line: 78, column: 11, scope: !981)
!983 = !DILocation(line: 78, column: 21, scope: !981)
!984 = !DILocation(line: 78, column: 29, scope: !981)
!985 = !DILocation(line: 0, scope: !945, inlinedAt: !986)
!986 = distinct !DILocation(line: 80, column: 11, scope: !980)
!987 = !DILocation(line: 110, column: 10, scope: !945, inlinedAt: !986)
!988 = !DILocation(line: 81, column: 29, scope: !979)
!989 = !DILocation(line: 0, scope: !903, inlinedAt: !978)
!990 = !DILocation(line: 98, column: 13, scope: !923, inlinedAt: !978)
!991 = !DILocation(line: 99, column: 15, scope: !922, inlinedAt: !978)
!992 = !DILocation(line: 99, column: 11, scope: !923, inlinedAt: !978)
!993 = !DILocation(line: 116, column: 5, scope: !930, inlinedAt: !978)
!994 = !DILocation(line: 108, column: 29, scope: !919, inlinedAt: !978)
!995 = !DILocation(line: 0, scope: !919, inlinedAt: !978)
!996 = !DILocation(line: 109, column: 15, scope: !919, inlinedAt: !978)
!997 = !DILocation(line: 118, column: 5, scope: !930, inlinedAt: !978)
!998 = !DILocation(line: 81, column: 15, scope: !980)
!999 = !DILocation(line: 77, column: 36, scope: !975)
!1000 = distinct !{!1000, !976, !1001, !535}
!1001 = !DILocation(line: 83, column: 9, scope: !892)
!1002 = !DILocation(line: 0, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !1004, file: !348, line: 65, column: 13)
!1004 = distinct !DILexicalBlock(scope: !971, file: !348, line: 64, column: 7)
!1005 = !DILocation(line: 65, column: 13, scope: !1004)
!1006 = !DILocation(line: 67, column: 13, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1003, file: !348, line: 66, column: 11)
!1008 = !DILocation(line: 69, column: 11, scope: !1007)
!1009 = !DILocation(line: 72, column: 13, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1003, file: !348, line: 71, column: 11)
!1011 = !DILocation(line: 84, column: 11, scope: !889)
!1012 = !DILocation(line: 84, column: 5, scope: !889)
!1013 = !DILocation(line: 85, column: 3, scope: !866)
!1014 = !DILocation(line: 87, column: 1, scope: !866)
!1015 = !DISubprogram(name: "getpwuid", scope: !714, file: !714, line: 110, type: !1016, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!878, !702}
!1018 = !DISubprogram(name: "getgrgid", scope: !911, file: !911, line: 101, type: !1019, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!909, !419}
!1021 = !DILocation(line: 0, scope: !903)
!1022 = !DILocation(line: 96, column: 7, scope: !903)
!1023 = !DILocation(line: 118, column: 5, scope: !930)
!1024 = !DILocation(line: 98, column: 13, scope: !923)
!1025 = !DILocation(line: 99, column: 15, scope: !922)
!1026 = !DILocation(line: 99, column: 11, scope: !923)
!1027 = !DILocation(line: 108, column: 29, scope: !919)
!1028 = !DILocation(line: 0, scope: !919)
!1029 = !DILocation(line: 109, column: 15, scope: !919)
!1030 = !DILocation(line: 112, column: 9, scope: !921)
!1031 = !DILocation(line: 116, column: 5, scope: !930)
!1032 = !DILocation(line: 119, column: 3, scope: !903)
!1033 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !141, file: !141, line: 50, type: !494, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !140, retainedNodes: !1034)
!1034 = !{!1035}
!1035 = !DILocalVariable(name: "file", arg: 1, scope: !1033, file: !141, line: 50, type: !30)
!1036 = !DILocation(line: 0, scope: !1033)
!1037 = !DILocation(line: 52, column: 13, scope: !1033)
!1038 = !DILocation(line: 53, column: 1, scope: !1033)
!1039 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !141, file: !141, line: 87, type: !1040, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !140, retainedNodes: !1042)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{null, !47}
!1042 = !{!1043}
!1043 = !DILocalVariable(name: "ignore", arg: 1, scope: !1039, file: !141, line: 87, type: !47)
!1044 = !DILocation(line: 0, scope: !1039)
!1045 = !DILocation(line: 89, column: 16, scope: !1039)
!1046 = !{!1047, !1047, i64 0}
!1047 = !{!"_Bool", !485, i64 0}
!1048 = !DILocation(line: 90, column: 1, scope: !1039)
!1049 = distinct !DISubprogram(name: "close_stdout", scope: !141, file: !141, line: 116, type: !184, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !140, retainedNodes: !1050)
!1050 = !{!1051}
!1051 = !DILocalVariable(name: "write_error", scope: !1052, file: !141, line: 121, type: !30)
!1052 = distinct !DILexicalBlock(scope: !1053, file: !141, line: 120, column: 5)
!1053 = distinct !DILexicalBlock(scope: !1049, file: !141, line: 118, column: 7)
!1054 = !DILocation(line: 118, column: 21, scope: !1053)
!1055 = !DILocation(line: 118, column: 7, scope: !1053)
!1056 = !DILocation(line: 118, column: 29, scope: !1053)
!1057 = !DILocation(line: 119, column: 7, scope: !1053)
!1058 = !DILocation(line: 119, column: 12, scope: !1053)
!1059 = !{i8 0, i8 2}
!1060 = !DILocation(line: 119, column: 25, scope: !1053)
!1061 = !DILocation(line: 119, column: 28, scope: !1053)
!1062 = !DILocation(line: 119, column: 34, scope: !1053)
!1063 = !DILocation(line: 118, column: 7, scope: !1049)
!1064 = !DILocation(line: 121, column: 33, scope: !1052)
!1065 = !DILocation(line: 0, scope: !1052)
!1066 = !DILocation(line: 122, column: 11, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1052, file: !141, line: 122, column: 11)
!1068 = !DILocation(line: 0, scope: !1067)
!1069 = !DILocation(line: 122, column: 11, scope: !1052)
!1070 = !DILocation(line: 123, column: 9, scope: !1067)
!1071 = !DILocation(line: 126, column: 9, scope: !1067)
!1072 = !DILocation(line: 128, column: 14, scope: !1052)
!1073 = !DILocation(line: 128, column: 7, scope: !1052)
!1074 = !DILocation(line: 133, column: 42, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1049, file: !141, line: 133, column: 7)
!1076 = !DILocation(line: 133, column: 28, scope: !1075)
!1077 = !DILocation(line: 133, column: 50, scope: !1075)
!1078 = !DILocation(line: 133, column: 7, scope: !1049)
!1079 = !DILocation(line: 134, column: 12, scope: !1075)
!1080 = !DILocation(line: 134, column: 5, scope: !1075)
!1081 = !DILocation(line: 135, column: 1, scope: !1049)
!1082 = distinct !DISubprogram(name: "verror", scope: !148, file: !148, line: 251, type: !1083, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !1085)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{null, !25, !25, !30, !156}
!1085 = !{!1086, !1087, !1088, !1089}
!1086 = !DILocalVariable(name: "status", arg: 1, scope: !1082, file: !148, line: 251, type: !25)
!1087 = !DILocalVariable(name: "errnum", arg: 2, scope: !1082, file: !148, line: 251, type: !25)
!1088 = !DILocalVariable(name: "message", arg: 3, scope: !1082, file: !148, line: 251, type: !30)
!1089 = !DILocalVariable(name: "args", arg: 4, scope: !1082, file: !148, line: 251, type: !156)
!1090 = !DILocation(line: 0, scope: !1082)
!1091 = !DILocation(line: 251, column: 1, scope: !1082)
!1092 = !DILocation(line: 261, column: 3, scope: !1082)
!1093 = !DILocation(line: 265, column: 7, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1082, file: !148, line: 265, column: 7)
!1095 = !DILocation(line: 265, column: 7, scope: !1082)
!1096 = !DILocation(line: 266, column: 5, scope: !1094)
!1097 = !DILocation(line: 272, column: 7, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1094, file: !148, line: 268, column: 5)
!1099 = !DILocation(line: 276, column: 3, scope: !1082)
!1100 = !{i64 0, i64 8, !483, i64 8, i64 8, !483, i64 16, i64 8, !483, i64 24, i64 4, !569, i64 28, i64 4, !569}
!1101 = !DILocation(line: 282, column: 1, scope: !1082)
!1102 = distinct !DISubprogram(name: "flush_stdout", scope: !148, file: !148, line: 163, type: !184, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !1103)
!1103 = !{!1104}
!1104 = !DILocalVariable(name: "stdout_fd", scope: !1102, file: !148, line: 166, type: !25)
!1105 = !DILocation(line: 0, scope: !1102)
!1106 = !DILocalVariable(name: "fd", arg: 1, scope: !1107, file: !148, line: 145, type: !25)
!1107 = distinct !DISubprogram(name: "is_open", scope: !148, file: !148, line: 145, type: !776, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !1108)
!1108 = !{!1106}
!1109 = !DILocation(line: 0, scope: !1107, inlinedAt: !1110)
!1110 = distinct !DILocation(line: 182, column: 25, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1102, file: !148, line: 182, column: 7)
!1112 = !DILocation(line: 157, column: 15, scope: !1107, inlinedAt: !1110)
!1113 = !DILocation(line: 182, column: 25, scope: !1111)
!1114 = !DILocation(line: 182, column: 7, scope: !1102)
!1115 = !DILocation(line: 184, column: 5, scope: !1111)
!1116 = !DILocation(line: 185, column: 1, scope: !1102)
!1117 = distinct !DISubprogram(name: "error_tail", scope: !148, file: !148, line: 219, type: !1083, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !1118)
!1118 = !{!1119, !1120, !1121, !1122}
!1119 = !DILocalVariable(name: "status", arg: 1, scope: !1117, file: !148, line: 219, type: !25)
!1120 = !DILocalVariable(name: "errnum", arg: 2, scope: !1117, file: !148, line: 219, type: !25)
!1121 = !DILocalVariable(name: "message", arg: 3, scope: !1117, file: !148, line: 219, type: !30)
!1122 = !DILocalVariable(name: "args", arg: 4, scope: !1117, file: !148, line: 219, type: !156)
!1123 = !DILocation(line: 0, scope: !1117)
!1124 = !DILocation(line: 219, column: 1, scope: !1117)
!1125 = !DILocation(line: 229, column: 13, scope: !1117)
!1126 = !DILocation(line: 229, column: 3, scope: !1117)
!1127 = !DILocalVariable(name: "__stream", arg: 1, scope: !1128, file: !1129, line: 132, type: !1132)
!1128 = distinct !DISubprogram(name: "vfprintf", scope: !1129, file: !1129, line: 132, type: !1130, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !1167)
!1129 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!25, !1132, !565, !158}
!1132 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1133)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !62, line: 7, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !64, line: 49, size: 1728, elements: !1136)
!1136 = !{!1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1135, file: !64, line: 51, baseType: !25, size: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1135, file: !64, line: 54, baseType: !22, size: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1135, file: !64, line: 55, baseType: !22, size: 64, offset: 128)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1135, file: !64, line: 56, baseType: !22, size: 64, offset: 192)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1135, file: !64, line: 57, baseType: !22, size: 64, offset: 256)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1135, file: !64, line: 58, baseType: !22, size: 64, offset: 320)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1135, file: !64, line: 59, baseType: !22, size: 64, offset: 384)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1135, file: !64, line: 60, baseType: !22, size: 64, offset: 448)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1135, file: !64, line: 61, baseType: !22, size: 64, offset: 512)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1135, file: !64, line: 64, baseType: !22, size: 64, offset: 576)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1135, file: !64, line: 65, baseType: !22, size: 64, offset: 640)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1135, file: !64, line: 66, baseType: !22, size: 64, offset: 704)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1135, file: !64, line: 68, baseType: !79, size: 64, offset: 768)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1135, file: !64, line: 70, baseType: !1151, size: 64, offset: 832)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1135, file: !64, line: 72, baseType: !25, size: 32, offset: 896)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1135, file: !64, line: 73, baseType: !25, size: 32, offset: 928)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1135, file: !64, line: 74, baseType: !86, size: 64, offset: 960)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1135, file: !64, line: 77, baseType: !26, size: 16, offset: 1024)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1135, file: !64, line: 78, baseType: !91, size: 8, offset: 1040)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1135, file: !64, line: 79, baseType: !93, size: 8, offset: 1048)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1135, file: !64, line: 81, baseType: !97, size: 64, offset: 1088)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1135, file: !64, line: 89, baseType: !100, size: 64, offset: 1152)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1135, file: !64, line: 91, baseType: !102, size: 64, offset: 1216)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1135, file: !64, line: 92, baseType: !105, size: 64, offset: 1280)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1135, file: !64, line: 93, baseType: !1151, size: 64, offset: 1344)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1135, file: !64, line: 94, baseType: !24, size: 64, offset: 1408)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1135, file: !64, line: 95, baseType: !27, size: 64, offset: 1472)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1135, file: !64, line: 96, baseType: !25, size: 32, offset: 1536)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1135, file: !64, line: 98, baseType: !112, size: 160, offset: 1568)
!1167 = !{!1127, !1168, !1169}
!1168 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1128, file: !1129, line: 133, type: !565)
!1169 = !DILocalVariable(name: "__ap", arg: 3, scope: !1128, file: !1129, line: 133, type: !158)
!1170 = !DILocation(line: 0, scope: !1128, inlinedAt: !1171)
!1171 = distinct !DILocation(line: 229, column: 3, scope: !1117)
!1172 = !DILocation(line: 135, column: 10, scope: !1128, inlinedAt: !1171)
!1173 = !{!1174, !1176}
!1174 = distinct !{!1174, !1175, !"vfprintf.inline: argument 0"}
!1175 = distinct !{!1175, !"vfprintf.inline"}
!1176 = distinct !{!1176, !1175, !"vfprintf.inline: argument 1"}
!1177 = !DILocation(line: 232, column: 3, scope: !1117)
