; ModuleID = 'src/tee.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.pollfd = type { i32, i16, i16 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [65 x i8] c"Copy standard input to each FILE, and also to standard output.\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"tee\00", align 1

!40 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!41 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!42 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!43 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!44 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!45 = !DIEnumerator(name: "c_quoting_style", value: 5)
!46 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!47 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!48 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!49 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!50 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!51 = !{!52, !54, !56, !57, !62, !63, !64, !67, !69}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !58, line: 72, baseType: !59)
!58 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "331e107bf774bb600ec675d0db0b92ce")
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62}
!62 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!63 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !65, line: 46, baseType: !66)
!65 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!66 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!69 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!70 = !{!71, !74, !76, !78, !0, !164, !170}
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "append", scope: !2, file: !3, line: 43, type: !73, isLocal: true, isDefinition: true)
!73 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "ignore_interrupts", scope: !2, file: !3, line: 46, type: !73, isLocal: true, isDefinition: true)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "output_error", scope: !2, file: !3, line: 57, type: !5, isLocal: true, isDefinition: true)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !80, file: !81, line: 575, type: !62, isLocal: true, isDefinition: true)
!80 = distinct !DISubprogram(name: "oputs_", scope: !81, file: !81, line: 573, type: !82, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !84)
!81 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!82 = !DISubroutineType(types: !83)
!83 = !{null, !67, !67}
!84 = !{!85, !86, !87, !90, !91, !92, !93, !97, !98, !99, !100, !102, !158, !159, !160, !162, !163}
!85 = !DILocalVariable(name: "program", arg: 1, scope: !80, file: !81, line: 573, type: !67)
!86 = !DILocalVariable(name: "option", arg: 2, scope: !80, file: !81, line: 573, type: !67)
!87 = !DILocalVariable(name: "term", scope: !88, file: !81, line: 585, type: !67)
!88 = distinct !DILexicalBlock(scope: !89, file: !81, line: 582, column: 5)
!89 = distinct !DILexicalBlock(scope: !80, file: !81, line: 581, column: 7)
!90 = !DILocalVariable(name: "double_space", scope: !80, file: !81, line: 594, type: !73)
!91 = !DILocalVariable(name: "first_word", scope: !80, file: !81, line: 595, type: !67)
!92 = !DILocalVariable(name: "option_text", scope: !80, file: !81, line: 596, type: !67)
!93 = !DILocalVariable(name: "s", scope: !94, file: !81, line: 608, type: !67)
!94 = distinct !DILexicalBlock(scope: !95, file: !81, line: 605, column: 5)
!95 = distinct !DILexicalBlock(scope: !96, file: !81, line: 604, column: 12)
!96 = distinct !DILexicalBlock(scope: !80, file: !81, line: 597, column: 7)
!97 = !DILocalVariable(name: "spaces", scope: !94, file: !81, line: 609, type: !64)
!98 = !DILocalVariable(name: "anchor_len", scope: !80, file: !81, line: 620, type: !64)
!99 = !DILocalVariable(name: "desc_text", scope: !80, file: !81, line: 625, type: !67)
!100 = !DILocalVariable(name: "__ptr", scope: !101, file: !81, line: 644, type: !67)
!101 = distinct !DILexicalBlock(scope: !80, file: !81, line: 644, column: 3)
!102 = !DILocalVariable(name: "__stream", scope: !101, file: !81, line: 644, type: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !105, line: 7, baseType: !106)
!105 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !107, line: 49, size: 1728, elements: !108)
!107 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!108 = !{!109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !124, !126, !127, !128, !132, !133, !135, !139, !142, !144, !147, !150, !151, !152, !153, !154}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !106, file: !107, line: 51, baseType: !62, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !106, file: !107, line: 54, baseType: !54, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !106, file: !107, line: 55, baseType: !54, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !106, file: !107, line: 56, baseType: !54, size: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !106, file: !107, line: 57, baseType: !54, size: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !106, file: !107, line: 58, baseType: !54, size: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !106, file: !107, line: 59, baseType: !54, size: 64, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !106, file: !107, line: 60, baseType: !54, size: 64, offset: 448)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !106, file: !107, line: 61, baseType: !54, size: 64, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !106, file: !107, line: 64, baseType: !54, size: 64, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !106, file: !107, line: 65, baseType: !54, size: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !106, file: !107, line: 66, baseType: !54, size: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !106, file: !107, line: 68, baseType: !122, size: 64, offset: 768)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !107, line: 36, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !106, file: !107, line: 70, baseType: !125, size: 64, offset: 832)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !106, file: !107, line: 72, baseType: !62, size: 32, offset: 896)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !106, file: !107, line: 73, baseType: !62, size: 32, offset: 928)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !106, file: !107, line: 74, baseType: !129, size: 64, offset: 960)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !130, line: 152, baseType: !131)
!130 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!131 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !106, file: !107, line: 77, baseType: !63, size: 16, offset: 1024)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !106, file: !107, line: 78, baseType: !134, size: 8, offset: 1040)
!134 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !106, file: !107, line: 79, baseType: !136, size: 8, offset: 1048)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 8, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 1)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !106, file: !107, line: 81, baseType: !140, size: 64, offset: 1088)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !107, line: 43, baseType: null)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !106, file: !107, line: 89, baseType: !143, size: 64, offset: 1152)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !130, line: 153, baseType: !131)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !106, file: !107, line: 91, baseType: !145, size: 64, offset: 1216)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !107, line: 37, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !106, file: !107, line: 92, baseType: !148, size: 64, offset: 1280)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !107, line: 38, flags: DIFlagFwdDecl)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !106, file: !107, line: 93, baseType: !125, size: 64, offset: 1344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !106, file: !107, line: 94, baseType: !56, size: 64, offset: 1408)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !106, file: !107, line: 95, baseType: !64, size: 64, offset: 1472)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !106, file: !107, line: 96, baseType: !62, size: 32, offset: 1536)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !106, file: !107, line: 98, baseType: !155, size: 160, offset: 1568)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 160, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 20)
!158 = !DILocalVariable(name: "__cnt", scope: !101, file: !81, line: 644, type: !64)
!159 = !DILocalVariable(name: "url_program", scope: !80, file: !81, line: 648, type: !67)
!160 = !DILocalVariable(name: "__ptr", scope: !161, file: !81, line: 686, type: !67)
!161 = distinct !DILexicalBlock(scope: !80, file: !81, line: 686, column: 3)
!162 = !DILocalVariable(name: "__stream", scope: !161, file: !81, line: 686, type: !103)
!163 = !DILocalVariable(name: "__cnt", scope: !161, file: !81, line: 686, type: !64)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "output_error_types", scope: !2, file: !3, line: 73, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 128, elements: !168)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!168 = !{!169}
!169 = !DISubrange(count: 4)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "output_error_args", scope: !2, file: !3, line: 69, type: !172, isLocal: true, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 320, elements: !174)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!174 = !{!175}
!175 = !DISubrange(count: 5)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 1536, elements: !186)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !179, line: 50, size: 256, elements: !180)
!179 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!180 = !{!181, !182, !183, !185}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !178, file: !179, line: 52, baseType: !67, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !178, file: !179, line: 55, baseType: !62, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !178, file: !179, line: 56, baseType: !184, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !178, file: !179, line: 57, baseType: !62, size: 32, offset: 192)
!186 = !{!187}
!187 = !DISubrange(count: 6)
!188 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!189 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "Version", scope: !192, file: !193, line: 3, type: !67, isLocal: false, isDefinition: true)
!192 = distinct !DICompileUnit(language: DW_LANG_C99, file: !193, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !194, splitDebugInlining: false, nameTableKind: None)
!193 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!194 = !{!190}
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !197, file: !198, line: 65, type: !202, isLocal: false, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199, retainedTypes: !200, globals: !201, splitDebugInlining: false, nameTableKind: None)
!198 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!199 = !{!37}
!200 = !{!56, !67, !69}
!201 = !{!195}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !203, line: 69, baseType: !204)
!203 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{null}
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "file_name", scope: !209, file: !210, line: 45, type: !67, isLocal: true, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !211, splitDebugInlining: false, nameTableKind: None)
!210 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!211 = !{!207, !212}
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !209, file: !210, line: 55, type: !73, isLocal: true, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !216, file: !217, line: 66, type: !204, isLocal: false, isDefinition: true)
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !218, globals: !219, splitDebugInlining: false, nameTableKind: None)
!217 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!218 = !{!56, !69}
!219 = !{!220, !246, !214, !248, !250}
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "old_file_name", scope: !222, file: !217, line: 304, type: !67, isLocal: true, isDefinition: true)
!222 = distinct !DISubprogram(name: "verror_at_line", scope: !217, file: !217, line: 298, type: !223, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !216, retainedNodes: !239)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !62, !62, !67, !6, !67, !225}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !226, line: 52, baseType: !227)
!226 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !228, line: 32, baseType: !229)
!228 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !230, baseType: !231)
!230 = !DIFile(filename: "lib/error.c", directory: "/src")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !232, size: 256, elements: !233)
!232 = !DINamespace(name: "std", scope: null)
!233 = !{!234, !235, !236, !237, !238}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !231, file: !230, baseType: !56, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !231, file: !230, baseType: !56, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !231, file: !230, baseType: !56, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !231, file: !230, baseType: !62, size: 32, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !231, file: !230, baseType: !62, size: 32, offset: 224)
!239 = !{!240, !241, !242, !243, !244, !245}
!240 = !DILocalVariable(name: "status", arg: 1, scope: !222, file: !217, line: 298, type: !62)
!241 = !DILocalVariable(name: "errnum", arg: 2, scope: !222, file: !217, line: 298, type: !62)
!242 = !DILocalVariable(name: "file_name", arg: 3, scope: !222, file: !217, line: 298, type: !67)
!243 = !DILocalVariable(name: "line_number", arg: 4, scope: !222, file: !217, line: 298, type: !6)
!244 = !DILocalVariable(name: "message", arg: 5, scope: !222, file: !217, line: 298, type: !67)
!245 = !DILocalVariable(name: "args", arg: 6, scope: !222, file: !217, line: 298, type: !225)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "old_line_number", scope: !222, file: !217, line: 305, type: !6, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "error_message_count", scope: !216, file: !217, line: 69, type: !6, isLocal: false, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !216, file: !217, line: 295, type: !62, isLocal: false, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "program_name", scope: !254, file: !255, line: 31, type: !67, isLocal: false, isDefinition: true)
!254 = distinct !DICompileUnit(language: DW_LANG_C99, file: !255, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !256, globals: !257, splitDebugInlining: false, nameTableKind: None)
!255 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!256 = !{!54}
!257 = !{!252}
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "utf07FF", scope: !260, file: !261, line: 46, type: !289, isLocal: true, isDefinition: true)
!260 = distinct !DISubprogram(name: "proper_name_lite", scope: !261, file: !261, line: 38, type: !262, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !264, retainedNodes: !266)
!261 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!262 = !DISubroutineType(types: !263)
!263 = !{!67, !67, !67}
!264 = distinct !DICompileUnit(language: DW_LANG_C99, file: !261, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !265, splitDebugInlining: false, nameTableKind: None)
!265 = !{!258}
!266 = !{!267, !268, !269, !270, !275}
!267 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !260, file: !261, line: 38, type: !67)
!268 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !260, file: !261, line: 38, type: !67)
!269 = !DILocalVariable(name: "translation", scope: !260, file: !261, line: 40, type: !67)
!270 = !DILocalVariable(name: "w", scope: !260, file: !261, line: 47, type: !271)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !272, line: 37, baseType: !273)
!272 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !130, line: 57, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !130, line: 42, baseType: !6)
!275 = !DILocalVariable(name: "mbs", scope: !260, file: !261, line: 48, type: !276)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !277, line: 6, baseType: !278)
!277 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !279, line: 21, baseType: !280)
!279 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !279, line: 13, size: 64, elements: !281)
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !280, file: !279, line: 15, baseType: !62, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !280, file: !279, line: 20, baseType: !284, size: 32, offset: 32)
!284 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !280, file: !279, line: 16, size: 32, elements: !285)
!285 = !{!286, !287}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !284, file: !279, line: 18, baseType: !6, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !284, file: !279, line: 19, baseType: !288, size: 32)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32, elements: !168)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 16, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 2)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !294, file: !295, line: 76, type: !363, isLocal: false, isDefinition: true)
!294 = distinct !DICompileUnit(language: DW_LANG_C99, file: !295, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !296, retainedTypes: !302, globals: !303, splitDebugInlining: false, nameTableKind: None)
!295 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!296 = !{!37, !297, !13}
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !38, line: 254, baseType: !6, size: 32, elements: !298)
!298 = !{!299, !300, !301}
!299 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!300 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!301 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!302 = !{!62, !63, !64}
!303 = !{!292, !304, !310, !322, !324, !329, !352, !359, !361}
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !294, file: !295, line: 92, type: !306, isLocal: false, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 320, elements: !308)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!308 = !{!309}
!309 = !DISubrange(count: 10)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !294, file: !295, line: 1040, type: !312, isLocal: false, isDefinition: true)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !295, line: 56, size: 448, elements: !313)
!313 = !{!314, !315, !316, !320, !321}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !312, file: !295, line: 59, baseType: !37, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !312, file: !295, line: 62, baseType: !62, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !312, file: !295, line: 66, baseType: !317, size: 256, offset: 64)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 8)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !312, file: !295, line: 69, baseType: !67, size: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !312, file: !295, line: 72, baseType: !67, size: 64, offset: 384)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !294, file: !295, line: 107, type: !312, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "slot0", scope: !294, file: !295, line: 831, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 2048, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 256)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "quote", scope: !331, file: !295, line: 228, type: !350, isLocal: true, isDefinition: true)
!331 = distinct !DISubprogram(name: "gettext_quote", scope: !295, file: !295, line: 197, type: !332, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !294, retainedNodes: !334)
!332 = !DISubroutineType(types: !333)
!333 = !{!67, !67, !37}
!334 = !{!335, !336, !337, !338, !339}
!335 = !DILocalVariable(name: "msgid", arg: 1, scope: !331, file: !295, line: 197, type: !67)
!336 = !DILocalVariable(name: "s", arg: 2, scope: !331, file: !295, line: 197, type: !37)
!337 = !DILocalVariable(name: "translation", scope: !331, file: !295, line: 199, type: !67)
!338 = !DILocalVariable(name: "w", scope: !331, file: !295, line: 229, type: !271)
!339 = !DILocalVariable(name: "mbs", scope: !331, file: !295, line: 230, type: !340)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !277, line: 6, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !279, line: 21, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !279, line: 13, size: 64, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !342, file: !279, line: 15, baseType: !62, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !342, file: !279, line: 20, baseType: !346, size: 32, offset: 32)
!346 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !342, file: !279, line: 16, size: 32, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !346, file: !279, line: 18, baseType: !6, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !346, file: !279, line: 19, baseType: !288, size: 32)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 64, elements: !351)
!351 = !{!291, !169}
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "slotvec", scope: !294, file: !295, line: 834, type: !354, isLocal: true, isDefinition: true)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !295, line: 823, size: 128, elements: !356)
!356 = !{!357, !358}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !355, file: !295, line: 825, baseType: !64, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !355, file: !295, line: 826, baseType: !54, size: 64, offset: 64)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "nslots", scope: !294, file: !295, line: 832, type: !62, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "slotvec0", scope: !294, file: !295, line: 833, type: !355, isLocal: true, isDefinition: true)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 704, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 11)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !368, file: !369, line: 26, type: !371, isLocal: false, isDefinition: true)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !370, splitDebugInlining: false, nameTableKind: None)
!369 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!370 = !{!366}
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 376, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 47)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "exit_failure", scope: !376, file: !377, line: 24, type: !379, isLocal: false, isDefinition: true)
!376 = distinct !DICompileUnit(language: DW_LANG_C99, file: !377, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !378, splitDebugInlining: false, nameTableKind: None)
!377 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!378 = !{!374}
!379 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !62)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "internal_state", scope: !382, file: !383, line: 97, type: !386, isLocal: true, isDefinition: true)
!382 = distinct !DICompileUnit(language: DW_LANG_C99, file: !383, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !384, globals: !385, splitDebugInlining: false, nameTableKind: None)
!383 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!384 = !{!56, !64, !69}
!385 = !{!380}
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !277, line: 6, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !279, line: 21, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !279, line: 13, size: 64, elements: !389)
!389 = !{!390, !391}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !388, file: !279, line: 15, baseType: !62, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !388, file: !279, line: 20, baseType: !392, size: 32, offset: 32)
!392 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !388, file: !279, line: 16, size: 32, elements: !393)
!393 = !{!394, !395}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !392, file: !279, line: 18, baseType: !6, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !392, file: !279, line: 19, baseType: !288, size: 32)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !398, file: !399, line: 506, type: !62, isLocal: true, isDefinition: true)
!398 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !399, file: !399, line: 485, type: !400, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !402, retainedNodes: !404)
!399 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!400 = !DISubroutineType(types: !401)
!401 = !{!62, !62, !62}
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !403, splitDebugInlining: false, nameTableKind: None)
!403 = !{!396}
!404 = !{!405, !406, !407, !408, !411}
!405 = !DILocalVariable(name: "fd", arg: 1, scope: !398, file: !399, line: 485, type: !62)
!406 = !DILocalVariable(name: "target", arg: 2, scope: !398, file: !399, line: 485, type: !62)
!407 = !DILocalVariable(name: "result", scope: !398, file: !399, line: 487, type: !62)
!408 = !DILocalVariable(name: "flags", scope: !409, file: !399, line: 530, type: !62)
!409 = distinct !DILexicalBlock(scope: !410, file: !399, line: 529, column: 5)
!410 = distinct !DILexicalBlock(scope: !398, file: !399, line: 528, column: 7)
!411 = !DILocalVariable(name: "saved_errno", scope: !412, file: !399, line: 533, type: !62)
!412 = distinct !DILexicalBlock(scope: !413, file: !399, line: 532, column: 9)
!413 = distinct !DILexicalBlock(scope: !409, file: !399, line: 531, column: 11)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "src/iopoll.c", directory: "/src", checksumkind: CSK_MD5, checksum: "994e71aa1d7ebbae5028422474ffd3c4")
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !418, splitDebugInlining: false, nameTableKind: None)
!417 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!418 = !{!28}
!419 = distinct !DICompileUnit(language: DW_LANG_C99, file: !420, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!420 = !DIFile(filename: "lib/open-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84efcad54206a8ffedf254f32134ee9c")
!421 = distinct !DICompileUnit(language: DW_LANG_C99, file: !422, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!422 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !424, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!424 = !DIFile(filename: "lib/isapipe.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5445de1f00883805631d924b7433dad7")
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!426 = !DIFile(filename: "lib/fd-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12c3310fb811f6ed0e0fb7e99c1b995b")
!427 = distinct !DICompileUnit(language: DW_LANG_C99, file: !428, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !429, retainedTypes: !433, splitDebugInlining: false, nameTableKind: None)
!428 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!429 = !{!430}
!430 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !428, line: 40, baseType: !6, size: 32, elements: !431)
!431 = !{!432}
!432 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!433 = !{!56}
!434 = distinct !DICompileUnit(language: DW_LANG_C99, file: !435, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !436, retainedTypes: !467, splitDebugInlining: false, nameTableKind: None)
!435 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!436 = !{!437, !449}
!437 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !438, file: !435, line: 188, baseType: !6, size: 32, elements: !447)
!438 = distinct !DISubprogram(name: "x2nrealloc", scope: !435, file: !435, line: 176, type: !439, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !434, retainedNodes: !442)
!439 = !DISubroutineType(types: !440)
!440 = !{!56, !56, !441, !64}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!442 = !{!443, !444, !445, !446}
!443 = !DILocalVariable(name: "p", arg: 1, scope: !438, file: !435, line: 176, type: !56)
!444 = !DILocalVariable(name: "pn", arg: 2, scope: !438, file: !435, line: 176, type: !441)
!445 = !DILocalVariable(name: "s", arg: 3, scope: !438, file: !435, line: 176, type: !64)
!446 = !DILocalVariable(name: "n", scope: !438, file: !435, line: 178, type: !64)
!447 = !{!448}
!448 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!449 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !450, file: !435, line: 228, baseType: !6, size: 32, elements: !447)
!450 = distinct !DISubprogram(name: "xpalloc", scope: !435, file: !435, line: 223, type: !451, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !434, retainedNodes: !457)
!451 = !DISubroutineType(types: !452)
!452 = !{!56, !56, !453, !454, !456, !454}
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !455, line: 130, baseType: !456)
!455 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !65, line: 35, baseType: !131)
!457 = !{!458, !459, !460, !461, !462, !463, !464, !465, !466}
!458 = !DILocalVariable(name: "pa", arg: 1, scope: !450, file: !435, line: 223, type: !56)
!459 = !DILocalVariable(name: "pn", arg: 2, scope: !450, file: !435, line: 223, type: !453)
!460 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !450, file: !435, line: 223, type: !454)
!461 = !DILocalVariable(name: "n_max", arg: 4, scope: !450, file: !435, line: 223, type: !456)
!462 = !DILocalVariable(name: "s", arg: 5, scope: !450, file: !435, line: 223, type: !454)
!463 = !DILocalVariable(name: "n0", scope: !450, file: !435, line: 230, type: !454)
!464 = !DILocalVariable(name: "n", scope: !450, file: !435, line: 237, type: !454)
!465 = !DILocalVariable(name: "nbytes", scope: !450, file: !435, line: 248, type: !454)
!466 = !DILocalVariable(name: "adjusted_nbytes", scope: !450, file: !435, line: 252, type: !454)
!467 = !{!54, !56, !73, !131, !66}
!468 = distinct !DICompileUnit(language: DW_LANG_C99, file: !469, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!469 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!470 = distinct !DICompileUnit(language: DW_LANG_C99, file: !471, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!471 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!473 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!474 = distinct !DICompileUnit(language: DW_LANG_C99, file: !475, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !433, splitDebugInlining: false, nameTableKind: None)
!475 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!476 = distinct !DICompileUnit(language: DW_LANG_C99, file: !477, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !433, splitDebugInlining: false, nameTableKind: None)
!477 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!478 = distinct !DICompileUnit(language: DW_LANG_C99, file: !479, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !480, splitDebugInlining: false, nameTableKind: None)
!479 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!480 = !{!73, !66, !56}
!481 = distinct !DICompileUnit(language: DW_LANG_C99, file: !482, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!482 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !484, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!484 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!486 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!487 = distinct !DICompileUnit(language: DW_LANG_C99, file: !488, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !433, splitDebugInlining: false, nameTableKind: None)
!488 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!489 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!490 = !{i32 7, !"Dwarf Version", i32 5}
!491 = !{i32 2, !"Debug Info Version", i32 3}
!492 = !{i32 1, !"wchar_size", i32 4}
!493 = !{i32 1, !"branch-target-enforcement", i32 0}
!494 = !{i32 1, !"sign-return-address", i32 0}
!495 = !{i32 1, !"sign-return-address-all", i32 0}
!496 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!497 = !{i32 7, !"PIC Level", i32 2}
!498 = !{i32 7, !"PIE Level", i32 2}
!499 = !{i32 7, !"uwtable", i32 1}
!500 = !{i32 7, !"frame-pointer", i32 1}
!501 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 81, type: !60, scopeLine: 82, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !502)
!502 = !{!503}
!503 = !DILocalVariable(name: "status", arg: 1, scope: !501, file: !3, line: 81, type: !62)
!504 = !DILocation(line: 0, scope: !501)
!505 = !DILocation(line: 83, column: 14, scope: !506)
!506 = distinct !DILexicalBlock(scope: !501, file: !3, line: 83, column: 7)
!507 = !DILocation(line: 83, column: 7, scope: !501)
!508 = !DILocation(line: 84, column: 5, scope: !509)
!509 = distinct !DILexicalBlock(scope: !506, file: !3, line: 84, column: 5)
!510 = !{!511, !511, i64 0}
!511 = !{!"any pointer", !512, i64 0}
!512 = !{!"omnipotent char", !513, i64 0}
!513 = !{!"Simple C/C++ TBAA"}
!514 = !DILocation(line: 87, column: 7, scope: !515)
!515 = distinct !DILexicalBlock(scope: !506, file: !3, line: 86, column: 5)
!516 = !DILocation(line: 88, column: 7, scope: !515)
!517 = !DILocation(line: 92, column: 7, scope: !515)
!518 = !DILocation(line: 96, column: 7, scope: !515)
!519 = !DILocation(line: 100, column: 7, scope: !515)
!520 = !DILocation(line: 104, column: 7, scope: !515)
!521 = !DILocation(line: 108, column: 7, scope: !515)
!522 = !DILocation(line: 109, column: 7, scope: !515)
!523 = !DILocation(line: 110, column: 7, scope: !515)
!524 = !DILocalVariable(name: "program", arg: 1, scope: !525, file: !81, line: 836, type: !67)
!525 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !81, file: !81, line: 836, type: !526, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !528)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !67}
!528 = !{!524, !529, !538, !539, !541, !542}
!529 = !DILocalVariable(name: "infomap", scope: !525, file: !81, line: 838, type: !530)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 896, elements: !536)
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !525, file: !81, line: 838, size: 128, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !532, file: !81, line: 838, baseType: !67, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !532, file: !81, line: 838, baseType: !67, size: 64, offset: 64)
!536 = !{!537}
!537 = !DISubrange(count: 7)
!538 = !DILocalVariable(name: "node", scope: !525, file: !81, line: 848, type: !67)
!539 = !DILocalVariable(name: "map_prog", scope: !525, file: !81, line: 849, type: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!541 = !DILocalVariable(name: "lc_messages", scope: !525, file: !81, line: 861, type: !67)
!542 = !DILocalVariable(name: "url_program", scope: !525, file: !81, line: 874, type: !67)
!543 = !DILocation(line: 0, scope: !525, inlinedAt: !544)
!544 = distinct !DILocation(line: 123, column: 7, scope: !515)
!545 = !DILocation(line: 838, column: 3, scope: !525, inlinedAt: !544)
!546 = !DILocation(line: 838, column: 67, scope: !525, inlinedAt: !544)
!547 = !DILocation(line: 849, column: 36, scope: !525, inlinedAt: !544)
!548 = !DILocation(line: 851, column: 3, scope: !525, inlinedAt: !544)
!549 = !DILocalVariable(name: "__s1", arg: 1, scope: !550, file: !551, line: 1359, type: !67)
!550 = distinct !DISubprogram(name: "streq", scope: !551, file: !551, line: 1359, type: !552, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !554)
!551 = !DIFile(filename: "./lib/string.h", directory: "/src")
!552 = !DISubroutineType(types: !553)
!553 = !{!73, !67, !67}
!554 = !{!549, !555}
!555 = !DILocalVariable(name: "__s2", arg: 2, scope: !550, file: !551, line: 1359, type: !67)
!556 = !DILocation(line: 0, scope: !550, inlinedAt: !557)
!557 = distinct !DILocation(line: 851, column: 33, scope: !525, inlinedAt: !544)
!558 = !DILocation(line: 1361, column: 11, scope: !550, inlinedAt: !557)
!559 = !DILocation(line: 1361, column: 10, scope: !550, inlinedAt: !557)
!560 = !DILocation(line: 852, column: 13, scope: !525, inlinedAt: !544)
!561 = !DILocation(line: 851, column: 20, scope: !525, inlinedAt: !544)
!562 = !{!563, !511, i64 0}
!563 = !{!"infomap", !511, i64 0, !511, i64 8}
!564 = !DILocation(line: 851, column: 10, scope: !525, inlinedAt: !544)
!565 = !DILocation(line: 851, column: 28, scope: !525, inlinedAt: !544)
!566 = distinct !{!566, !548, !560, !567}
!567 = !{!"llvm.loop.mustprogress"}
!568 = !DILocation(line: 854, column: 17, scope: !569, inlinedAt: !544)
!569 = distinct !DILexicalBlock(scope: !525, file: !81, line: 854, column: 7)
!570 = !{!563, !511, i64 8}
!571 = !DILocation(line: 854, column: 7, scope: !569, inlinedAt: !544)
!572 = !DILocation(line: 854, column: 7, scope: !525, inlinedAt: !544)
!573 = !DILocation(line: 857, column: 3, scope: !525, inlinedAt: !544)
!574 = !DILocation(line: 861, column: 29, scope: !525, inlinedAt: !544)
!575 = !DILocation(line: 862, column: 7, scope: !576, inlinedAt: !544)
!576 = distinct !DILexicalBlock(scope: !525, file: !81, line: 862, column: 7)
!577 = !DILocation(line: 862, column: 19, scope: !576, inlinedAt: !544)
!578 = !DILocation(line: 862, column: 22, scope: !576, inlinedAt: !544)
!579 = !DILocation(line: 862, column: 7, scope: !525, inlinedAt: !544)
!580 = !DILocation(line: 868, column: 7, scope: !581, inlinedAt: !544)
!581 = distinct !DILexicalBlock(scope: !576, file: !81, line: 863, column: 5)
!582 = !DILocation(line: 870, column: 5, scope: !581, inlinedAt: !544)
!583 = !DILocation(line: 0, scope: !550, inlinedAt: !584)
!584 = distinct !DILocation(line: 874, column: 29, scope: !525, inlinedAt: !544)
!585 = !DILocation(line: 875, column: 3, scope: !525, inlinedAt: !544)
!586 = !DILocation(line: 877, column: 3, scope: !525, inlinedAt: !544)
!587 = !DILocation(line: 879, column: 1, scope: !525, inlinedAt: !544)
!588 = !DILocation(line: 125, column: 3, scope: !501)
!589 = !DISubprogram(name: "dcgettext", scope: !590, file: !590, line: 51, type: !591, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !593)
!590 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!591 = !DISubroutineType(types: !592)
!592 = !{!54, !67, !67, !62}
!593 = !{}
!594 = !DISubprogram(name: "fputs_unlocked", scope: !226, file: !226, line: 691, type: !595, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !593)
!595 = !DISubroutineType(types: !596)
!596 = !{!62, !597, !598}
!597 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !67)
!598 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !103)
!599 = !DILocation(line: 0, scope: !80)
!600 = !DILocation(line: 581, column: 7, scope: !89)
!601 = !{!602, !602, i64 0}
!602 = !{!"int", !512, i64 0}
!603 = !DILocation(line: 581, column: 19, scope: !89)
!604 = !DILocation(line: 581, column: 7, scope: !80)
!605 = !DILocation(line: 585, column: 26, scope: !88)
!606 = !DILocation(line: 0, scope: !88)
!607 = !DILocation(line: 586, column: 23, scope: !88)
!608 = !DILocation(line: 586, column: 28, scope: !88)
!609 = !DILocation(line: 586, column: 32, scope: !88)
!610 = !{!512, !512, i64 0}
!611 = !DILocation(line: 586, column: 38, scope: !88)
!612 = !DILocation(line: 0, scope: !550, inlinedAt: !613)
!613 = distinct !DILocation(line: 586, column: 41, scope: !88)
!614 = !DILocation(line: 1361, column: 11, scope: !550, inlinedAt: !613)
!615 = !DILocation(line: 1361, column: 10, scope: !550, inlinedAt: !613)
!616 = !DILocation(line: 586, column: 19, scope: !88)
!617 = !DILocation(line: 587, column: 5, scope: !88)
!618 = !DILocation(line: 588, column: 7, scope: !619)
!619 = distinct !DILexicalBlock(scope: !80, file: !81, line: 588, column: 7)
!620 = !DILocation(line: 588, column: 7, scope: !80)
!621 = !DILocation(line: 590, column: 7, scope: !622)
!622 = distinct !DILexicalBlock(scope: !619, file: !81, line: 589, column: 5)
!623 = !DILocation(line: 591, column: 7, scope: !622)
!624 = !DILocation(line: 595, column: 37, scope: !80)
!625 = !DILocation(line: 595, column: 35, scope: !80)
!626 = !DILocation(line: 596, column: 29, scope: !80)
!627 = !DILocation(line: 597, column: 8, scope: !96)
!628 = !DILocation(line: 597, column: 7, scope: !80)
!629 = !DILocation(line: 604, column: 24, scope: !95)
!630 = !DILocation(line: 604, column: 12, scope: !96)
!631 = !DILocation(line: 0, scope: !94)
!632 = !DILocation(line: 610, column: 16, scope: !94)
!633 = !DILocation(line: 610, column: 7, scope: !94)
!634 = !DILocation(line: 611, column: 21, scope: !94)
!635 = !{!636, !636, i64 0}
!636 = !{!"short", !512, i64 0}
!637 = !DILocation(line: 611, column: 19, scope: !94)
!638 = !DILocation(line: 611, column: 16, scope: !94)
!639 = !DILocation(line: 610, column: 30, scope: !94)
!640 = distinct !{!640, !633, !634, !567}
!641 = !DILocation(line: 612, column: 18, scope: !642)
!642 = distinct !DILexicalBlock(scope: !94, file: !81, line: 612, column: 11)
!643 = !DILocation(line: 612, column: 11, scope: !94)
!644 = !DILocation(line: 620, column: 23, scope: !80)
!645 = !DILocation(line: 625, column: 39, scope: !80)
!646 = !DILocation(line: 626, column: 3, scope: !80)
!647 = !DILocation(line: 626, column: 10, scope: !80)
!648 = !DILocation(line: 626, column: 21, scope: !80)
!649 = !DILocation(line: 628, column: 44, scope: !650)
!650 = distinct !DILexicalBlock(scope: !651, file: !81, line: 628, column: 11)
!651 = distinct !DILexicalBlock(scope: !80, file: !81, line: 627, column: 5)
!652 = !DILocation(line: 628, column: 32, scope: !650)
!653 = !DILocation(line: 628, column: 49, scope: !650)
!654 = !DILocation(line: 628, column: 11, scope: !651)
!655 = !DILocation(line: 630, column: 11, scope: !656)
!656 = distinct !DILexicalBlock(scope: !651, file: !81, line: 630, column: 11)
!657 = !DILocation(line: 630, column: 11, scope: !651)
!658 = !DILocation(line: 632, column: 26, scope: !659)
!659 = distinct !DILexicalBlock(scope: !660, file: !81, line: 632, column: 15)
!660 = distinct !DILexicalBlock(scope: !656, file: !81, line: 631, column: 9)
!661 = !DILocation(line: 632, column: 34, scope: !659)
!662 = !DILocation(line: 632, column: 37, scope: !659)
!663 = !DILocation(line: 632, column: 15, scope: !660)
!664 = !DILocation(line: 636, column: 29, scope: !665)
!665 = distinct !DILexicalBlock(scope: !660, file: !81, line: 636, column: 15)
!666 = !DILocation(line: 640, column: 16, scope: !651)
!667 = distinct !{!667, !646, !668, !567}
!668 = !DILocation(line: 641, column: 5, scope: !80)
!669 = !DILocation(line: 644, column: 3, scope: !80)
!670 = !DILocation(line: 0, scope: !550, inlinedAt: !671)
!671 = distinct !DILocation(line: 648, column: 31, scope: !80)
!672 = !DILocation(line: 0, scope: !550, inlinedAt: !673)
!673 = distinct !DILocation(line: 649, column: 31, scope: !80)
!674 = !DILocation(line: 0, scope: !550, inlinedAt: !675)
!675 = distinct !DILocation(line: 650, column: 31, scope: !80)
!676 = !DILocation(line: 0, scope: !550, inlinedAt: !677)
!677 = distinct !DILocation(line: 651, column: 31, scope: !80)
!678 = !DILocation(line: 0, scope: !550, inlinedAt: !679)
!679 = distinct !DILocation(line: 652, column: 31, scope: !80)
!680 = !DILocation(line: 0, scope: !550, inlinedAt: !681)
!681 = distinct !DILocation(line: 653, column: 31, scope: !80)
!682 = !DILocation(line: 0, scope: !550, inlinedAt: !683)
!683 = distinct !DILocation(line: 654, column: 31, scope: !80)
!684 = !DILocation(line: 0, scope: !550, inlinedAt: !685)
!685 = distinct !DILocation(line: 655, column: 31, scope: !80)
!686 = !DILocation(line: 0, scope: !550, inlinedAt: !687)
!687 = distinct !DILocation(line: 656, column: 31, scope: !80)
!688 = !DILocation(line: 0, scope: !550, inlinedAt: !689)
!689 = distinct !DILocation(line: 657, column: 31, scope: !80)
!690 = !DILocation(line: 663, column: 7, scope: !691)
!691 = distinct !DILexicalBlock(scope: !80, file: !81, line: 663, column: 7)
!692 = !DILocation(line: 664, column: 7, scope: !691)
!693 = !DILocation(line: 664, column: 10, scope: !691)
!694 = !DILocation(line: 663, column: 7, scope: !80)
!695 = !DILocation(line: 669, column: 7, scope: !696)
!696 = distinct !DILexicalBlock(scope: !691, file: !81, line: 665, column: 5)
!697 = !DILocation(line: 671, column: 5, scope: !696)
!698 = !DILocation(line: 676, column: 7, scope: !699)
!699 = distinct !DILexicalBlock(scope: !691, file: !81, line: 673, column: 5)
!700 = !DILocation(line: 679, column: 3, scope: !80)
!701 = !DILocation(line: 683, column: 3, scope: !80)
!702 = !DILocation(line: 686, column: 3, scope: !80)
!703 = !DILocation(line: 688, column: 3, scope: !80)
!704 = !DILocation(line: 691, column: 3, scope: !80)
!705 = !DILocation(line: 695, column: 3, scope: !80)
!706 = !DILocation(line: 696, column: 1, scope: !80)
!707 = !DISubprogram(name: "setlocale", scope: !708, file: !708, line: 122, type: !709, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !593)
!708 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!709 = !DISubroutineType(types: !710)
!710 = !{!54, !62, !67}
!711 = !DISubprogram(name: "getenv", scope: !712, file: !712, line: 641, type: !713, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !593)
!712 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!713 = !DISubroutineType(types: !714)
!714 = !{!54, !67}
!715 = !DISubprogram(name: "fwrite_unlocked", scope: !226, file: !226, line: 704, type: !716, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !593)
!716 = !DISubroutineType(types: !717)
!717 = !{!64, !718, !64, !64, !598}
!718 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !52)
!719 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 129, type: !720, scopeLine: 130, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !723)
!720 = !DISubroutineType(types: !721)
!721 = !{!62, !62, !722}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!723 = !{!724, !725, !726, !727, !728}
!724 = !DILocalVariable(name: "argc", arg: 1, scope: !719, file: !3, line: 129, type: !62)
!725 = !DILocalVariable(name: "argv", arg: 2, scope: !719, file: !3, line: 129, type: !722)
!726 = !DILocalVariable(name: "optc", scope: !719, file: !3, line: 139, type: !62)
!727 = !DILocalVariable(name: "pipe_check", scope: !719, file: !3, line: 177, type: !73)
!728 = !DILocalVariable(name: "ok", scope: !719, file: !3, line: 184, type: !73)
!729 = !DILocation(line: 0, scope: !719)
!730 = !DILocation(line: 132, column: 21, scope: !719)
!731 = !DILocation(line: 132, column: 3, scope: !719)
!732 = !DILocation(line: 133, column: 3, scope: !719)
!733 = !DILocation(line: 134, column: 3, scope: !719)
!734 = !DILocation(line: 135, column: 3, scope: !719)
!735 = !DILocation(line: 137, column: 3, scope: !719)
!736 = !DILocation(line: 140, column: 3, scope: !719)
!737 = !DILocation(line: 140, column: 18, scope: !719)
!738 = !DILocation(line: 145, column: 18, scope: !739)
!739 = distinct !DILexicalBlock(scope: !740, file: !3, line: 143, column: 9)
!740 = distinct !DILexicalBlock(scope: !719, file: !3, line: 141, column: 5)
!741 = !DILocation(line: 146, column: 11, scope: !739)
!742 = !DILocation(line: 149, column: 29, scope: !739)
!743 = !DILocation(line: 150, column: 11, scope: !739)
!744 = !DILocation(line: 153, column: 15, scope: !745)
!745 = distinct !DILexicalBlock(scope: !739, file: !3, line: 153, column: 15)
!746 = !DILocation(line: 153, column: 15, scope: !739)
!747 = !DILocation(line: 154, column: 28, scope: !745)
!748 = !DILocation(line: 154, column: 26, scope: !745)
!749 = !DILocation(line: 154, column: 13, scope: !745)
!750 = distinct !{!750, !736, !751, !567}
!751 = !DILocation(line: 167, column: 5, scope: !719)
!752 = !DILocation(line: 157, column: 26, scope: !745)
!753 = !DILocation(line: 160, column: 9, scope: !739)
!754 = !DILocation(line: 162, column: 9, scope: !739)
!755 = !DILocation(line: 165, column: 11, scope: !739)
!756 = !DILocation(line: 169, column: 7, scope: !757)
!757 = distinct !DILexicalBlock(scope: !719, file: !3, line: 169, column: 7)
!758 = !DILocation(line: 169, column: 7, scope: !719)
!759 = !DILocation(line: 170, column: 5, scope: !757)
!760 = !DILocation(line: 172, column: 7, scope: !761)
!761 = distinct !DILexicalBlock(scope: !719, file: !3, line: 172, column: 7)
!762 = !DILocation(line: 172, column: 20, scope: !761)
!763 = !DILocation(line: 172, column: 7, scope: !719)
!764 = !DILocation(line: 173, column: 5, scope: !761)
!765 = !DILocation(line: 177, column: 23, scope: !719)
!766 = !DILocation(line: 178, column: 23, scope: !719)
!767 = !DILocation(line: 179, column: 25, scope: !719)
!768 = !DILocation(line: 184, column: 31, scope: !719)
!769 = !DILocation(line: 184, column: 29, scope: !719)
!770 = !DILocation(line: 184, column: 40, scope: !719)
!771 = !DILocalVariable(name: "nfiles", arg: 1, scope: !772, file: !3, line: 231, type: !62)
!772 = distinct !DISubprogram(name: "tee_files", scope: !3, file: !3, line: 231, type: !773, scopeLine: 232, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !775)
!773 = !DISubroutineType(types: !774)
!774 = !{!73, !62, !722, !73}
!775 = !{!771, !776, !777, !778, !779, !780, !782, !786, !790, !791, !792, !793, !795, !802, !806, !808}
!776 = !DILocalVariable(name: "files", arg: 2, scope: !772, file: !3, line: 231, type: !722)
!777 = !DILocalVariable(name: "pipe_check", arg: 3, scope: !772, file: !3, line: 231, type: !73)
!778 = !DILocalVariable(name: "n_outputs", scope: !772, file: !3, line: 233, type: !64)
!779 = !DILocalVariable(name: "descriptors", scope: !772, file: !3, line: 234, type: !184)
!780 = !DILocalVariable(name: "out_pollable", scope: !772, file: !3, line: 235, type: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!782 = !DILocalVariable(name: "buffer", scope: !772, file: !3, line: 236, type: !783)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 65536, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 8192)
!786 = !DILocalVariable(name: "bytes_read", scope: !772, file: !3, line: 237, type: !787)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !788, line: 108, baseType: !789)
!788 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !130, line: 194, baseType: !131)
!790 = !DILocalVariable(name: "first_out", scope: !772, file: !3, line: 238, type: !62)
!791 = !DILocalVariable(name: "ok", scope: !772, file: !3, line: 239, type: !73)
!792 = !DILocalVariable(name: "flags", scope: !772, file: !3, line: 240, type: !62)
!793 = !DILocalVariable(name: "i", scope: !794, file: !3, line: 259, type: !62)
!794 = distinct !DILexicalBlock(scope: !772, file: !3, line: 259, column: 3)
!795 = !DILocalVariable(name: "__errstatus", scope: !796, file: !3, line: 267, type: !801)
!796 = distinct !DILexicalBlock(scope: !797, file: !3, line: 267, column: 11)
!797 = distinct !DILexicalBlock(scope: !798, file: !3, line: 264, column: 9)
!798 = distinct !DILexicalBlock(scope: !799, file: !3, line: 263, column: 11)
!799 = distinct !DILexicalBlock(scope: !800, file: !3, line: 260, column: 5)
!800 = distinct !DILexicalBlock(scope: !794, file: !3, line: 259, column: 3)
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!802 = !DILocalVariable(name: "err", scope: !803, file: !3, line: 285, type: !62)
!803 = distinct !DILexicalBlock(scope: !804, file: !3, line: 283, column: 9)
!804 = distinct !DILexicalBlock(scope: !805, file: !3, line: 282, column: 11)
!805 = distinct !DILexicalBlock(scope: !772, file: !3, line: 281, column: 5)
!806 = !DILocalVariable(name: "i", scope: !807, file: !3, line: 312, type: !62)
!807 = distinct !DILexicalBlock(scope: !805, file: !3, line: 312, column: 7)
!808 = !DILocalVariable(name: "i", scope: !809, file: !3, line: 331, type: !62)
!809 = distinct !DILexicalBlock(scope: !772, file: !3, line: 331, column: 3)
!810 = !DILocation(line: 0, scope: !772, inlinedAt: !811)
!811 = distinct !DILocation(line: 184, column: 13, scope: !719)
!812 = !DILocation(line: 236, column: 3, scope: !772, inlinedAt: !811)
!813 = !DILocation(line: 236, column: 8, scope: !772, inlinedAt: !811)
!814 = !DILocation(line: 240, column: 48, scope: !772, inlinedAt: !811)
!815 = !DILocation(line: 240, column: 45, scope: !772, inlinedAt: !811)
!816 = !DILocation(line: 244, column: 12, scope: !772, inlinedAt: !811)
!817 = !DILocation(line: 244, column: 3, scope: !772, inlinedAt: !811)
!818 = !DILocation(line: 249, column: 34, scope: !772, inlinedAt: !811)
!819 = !DILocation(line: 249, column: 27, scope: !772, inlinedAt: !811)
!820 = !DILocation(line: 249, column: 17, scope: !772, inlinedAt: !811)
!821 = !DILocation(line: 250, column: 7, scope: !772, inlinedAt: !811)
!822 = !DILocation(line: 253, column: 18, scope: !772, inlinedAt: !811)
!823 = !DILocation(line: 251, column: 20, scope: !824, inlinedAt: !811)
!824 = distinct !DILexicalBlock(scope: !772, file: !3, line: 250, column: 7)
!825 = !DILocation(line: 255, column: 23, scope: !826, inlinedAt: !811)
!826 = distinct !DILexicalBlock(scope: !772, file: !3, line: 254, column: 7)
!827 = !DILocation(line: 255, column: 21, scope: !826, inlinedAt: !811)
!828 = !{!829, !829, i64 0}
!829 = !{!"_Bool", !512, i64 0}
!830 = !DILocation(line: 255, column: 5, scope: !826, inlinedAt: !811)
!831 = !DILocation(line: 252, column: 8, scope: !772, inlinedAt: !811)
!832 = !DILocation(line: 256, column: 24, scope: !772, inlinedAt: !811)
!833 = !DILocation(line: 256, column: 12, scope: !772, inlinedAt: !811)
!834 = !DILocation(line: 0, scope: !794, inlinedAt: !811)
!835 = !DILocation(line: 259, column: 21, scope: !800, inlinedAt: !811)
!836 = !DILocation(line: 259, column: 3, scope: !794, inlinedAt: !811)
!837 = !DILocation(line: 280, column: 3, scope: !772, inlinedAt: !811)
!838 = !DILocation(line: 262, column: 30, scope: !799, inlinedAt: !811)
!839 = !DILocation(line: 262, column: 24, scope: !799, inlinedAt: !811)
!840 = !DILocation(line: 262, column: 7, scope: !799, inlinedAt: !811)
!841 = !DILocation(line: 262, column: 22, scope: !799, inlinedAt: !811)
!842 = !DILocation(line: 263, column: 26, scope: !798, inlinedAt: !811)
!843 = !DILocation(line: 263, column: 11, scope: !799, inlinedAt: !811)
!844 = !DILocation(line: 265, column: 15, scope: !797, inlinedAt: !811)
!845 = !DILocation(line: 266, column: 13, scope: !846, inlinedAt: !811)
!846 = distinct !DILexicalBlock(scope: !797, file: !3, line: 265, column: 15)
!847 = !DILocation(line: 266, column: 29, scope: !846, inlinedAt: !811)
!848 = !DILocation(line: 267, column: 11, scope: !797, inlinedAt: !811)
!849 = !DILocation(line: 0, scope: !797, inlinedAt: !811)
!850 = !DILocation(line: 0, scope: !796, inlinedAt: !811)
!851 = !DILocation(line: 267, column: 11, scope: !796, inlinedAt: !811)
!852 = !DILocation(line: 274, column: 15, scope: !853, inlinedAt: !811)
!853 = distinct !DILexicalBlock(scope: !798, file: !3, line: 273, column: 9)
!854 = !DILocation(line: 275, column: 31, scope: !855, inlinedAt: !811)
!855 = distinct !DILexicalBlock(scope: !853, file: !3, line: 274, column: 15)
!856 = !DILocation(line: 275, column: 13, scope: !855, inlinedAt: !811)
!857 = !DILocation(line: 275, column: 29, scope: !855, inlinedAt: !811)
!858 = !DILocation(line: 276, column: 20, scope: !853, inlinedAt: !811)
!859 = !DILocation(line: 259, column: 33, scope: !800, inlinedAt: !811)
!860 = distinct !{!860, !836, !861, !567}
!861 = !DILocation(line: 278, column: 5, scope: !794, inlinedAt: !811)
!862 = !DILocation(line: 282, column: 22, scope: !804, inlinedAt: !811)
!863 = !DILocation(line: 282, column: 25, scope: !804, inlinedAt: !811)
!864 = !{i8 0, i8 2}
!865 = !DILocation(line: 282, column: 11, scope: !805, inlinedAt: !811)
!866 = !DILocation(line: 285, column: 43, scope: !803, inlinedAt: !811)
!867 = !DILocation(line: 285, column: 21, scope: !803, inlinedAt: !811)
!868 = !DILocation(line: 0, scope: !803, inlinedAt: !811)
!869 = !DILocation(line: 288, column: 15, scope: !803, inlinedAt: !811)
!870 = !DILocation(line: 290, column: 15, scope: !871, inlinedAt: !811)
!871 = distinct !DILexicalBlock(scope: !872, file: !3, line: 289, column: 13)
!872 = distinct !DILexicalBlock(scope: !803, file: !3, line: 288, column: 15)
!873 = !DILocation(line: 290, column: 21, scope: !871, inlinedAt: !811)
!874 = !DILocalVariable(name: "descriptors", arg: 1, scope: !875, file: !3, line: 209, type: !184)
!875 = distinct !DISubprogram(name: "fail_output", scope: !3, file: !3, line: 209, type: !876, scopeLine: 210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !878)
!876 = !DISubroutineType(types: !877)
!877 = !{!73, !184, !722, !62}
!878 = !{!874, !879, !880, !881, !882, !883}
!879 = !DILocalVariable(name: "files", arg: 2, scope: !875, file: !3, line: 209, type: !722)
!880 = !DILocalVariable(name: "i", arg: 3, scope: !875, file: !3, line: 209, type: !62)
!881 = !DILocalVariable(name: "w_errno", scope: !875, file: !3, line: 211, type: !62)
!882 = !DILocalVariable(name: "fail", scope: !875, file: !3, line: 212, type: !73)
!883 = !DILocalVariable(name: "__errstatus", scope: !884, file: !3, line: 217, type: !801)
!884 = distinct !DILexicalBlock(scope: !885, file: !3, line: 217, column: 7)
!885 = distinct !DILexicalBlock(scope: !886, file: !3, line: 216, column: 5)
!886 = distinct !DILexicalBlock(scope: !875, file: !3, line: 215, column: 7)
!887 = !DILocation(line: 0, scope: !875, inlinedAt: !888)
!888 = distinct !DILocation(line: 291, column: 19, scope: !889, inlinedAt: !811)
!889 = distinct !DILexicalBlock(scope: !871, file: !3, line: 291, column: 19)
!890 = !DILocation(line: 215, column: 7, scope: !875, inlinedAt: !888)
!891 = !DILocation(line: 217, column: 7, scope: !885, inlinedAt: !888)
!892 = !DILocation(line: 0, scope: !885, inlinedAt: !888)
!893 = !DILocation(line: 0, scope: !884, inlinedAt: !888)
!894 = !DILocation(line: 217, column: 7, scope: !884, inlinedAt: !888)
!895 = !DILocation(line: 213, column: 15, scope: !875, inlinedAt: !888)
!896 = !DILocation(line: 221, column: 18, scope: !875, inlinedAt: !888)
!897 = !DILocation(line: 291, column: 19, scope: !871, inlinedAt: !811)
!898 = !DILocation(line: 293, column: 24, scope: !871, inlinedAt: !811)
!899 = !DILocalVariable(name: "descriptors", arg: 1, scope: !900, file: !3, line: 197, type: !184)
!900 = distinct !DISubprogram(name: "get_next_out", scope: !3, file: !3, line: 197, type: !901, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !903)
!901 = !DISubroutineType(types: !902)
!902 = !{!62, !184, !62, !62}
!903 = !{!899, !904, !905}
!904 = !DILocalVariable(name: "nfiles", arg: 2, scope: !900, file: !3, line: 197, type: !62)
!905 = !DILocalVariable(name: "idx", arg: 3, scope: !900, file: !3, line: 197, type: !62)
!906 = !DILocation(line: 0, scope: !900, inlinedAt: !907)
!907 = distinct !DILocation(line: 294, column: 27, scope: !871, inlinedAt: !811)
!908 = !DILocation(line: 199, column: 8, scope: !909, inlinedAt: !907)
!909 = distinct !DILexicalBlock(scope: !900, file: !3, line: 199, column: 3)
!910 = !DILocation(line: 199, column: 19, scope: !911, inlinedAt: !907)
!911 = distinct !DILexicalBlock(scope: !909, file: !3, line: 199, column: 3)
!912 = !DILocation(line: 0, scope: !909, inlinedAt: !907)
!913 = !DILocation(line: 199, column: 3, scope: !909, inlinedAt: !907)
!914 = distinct !{!914, !837, !915, !567}
!915 = !DILocation(line: 322, column: 5, scope: !772, inlinedAt: !811)
!916 = !DILocation(line: 200, column: 14, scope: !917, inlinedAt: !907)
!917 = distinct !DILexicalBlock(scope: !911, file: !3, line: 200, column: 9)
!918 = !DILocation(line: 200, column: 11, scope: !917, inlinedAt: !907)
!919 = !DILocation(line: 200, column: 9, scope: !911, inlinedAt: !907)
!920 = distinct !{!920, !913, !921, !567}
!921 = !DILocation(line: 201, column: 14, scope: !909, inlinedAt: !907)
!922 = !DILocation(line: 203, column: 1, scope: !900, inlinedAt: !907)
!923 = distinct !{!923, !837, !915, !567}
!924 = !DILocation(line: 299, column: 15, scope: !925, inlinedAt: !811)
!925 = distinct !DILexicalBlock(scope: !926, file: !3, line: 298, column: 13)
!926 = distinct !DILexicalBlock(scope: !872, file: !3, line: 297, column: 20)
!927 = !DILocation(line: 301, column: 13, scope: !925, inlinedAt: !811)
!928 = !DILocation(line: 304, column: 20, scope: !805, inlinedAt: !811)
!929 = !DILocation(line: 305, column: 22, scope: !930, inlinedAt: !811)
!930 = distinct !DILexicalBlock(scope: !805, file: !3, line: 305, column: 11)
!931 = !DILocation(line: 305, column: 26, scope: !930, inlinedAt: !811)
!932 = !DILocation(line: 305, column: 29, scope: !930, inlinedAt: !811)
!933 = !DILocation(line: 305, column: 35, scope: !930, inlinedAt: !811)
!934 = !DILocation(line: 305, column: 11, scope: !805, inlinedAt: !811)
!935 = distinct !{!935, !837, !915, !567}
!936 = !DILocation(line: 307, column: 22, scope: !937, inlinedAt: !811)
!937 = distinct !DILexicalBlock(scope: !805, file: !3, line: 307, column: 11)
!938 = !DILocation(line: 307, column: 11, scope: !805, inlinedAt: !811)
!939 = !DILocation(line: 0, scope: !807, inlinedAt: !811)
!940 = !DILocation(line: 312, column: 7, scope: !807, inlinedAt: !811)
!941 = distinct !{!941, !837, !915, !567}
!942 = !DILocation(line: 313, column: 18, scope: !943, inlinedAt: !811)
!943 = distinct !DILexicalBlock(scope: !944, file: !3, line: 313, column: 13)
!944 = distinct !DILexicalBlock(scope: !807, file: !3, line: 312, column: 7)
!945 = !DILocation(line: 313, column: 15, scope: !943, inlinedAt: !811)
!946 = !DILocation(line: 314, column: 13, scope: !943, inlinedAt: !811)
!947 = !DILocation(line: 314, column: 18, scope: !943, inlinedAt: !811)
!948 = !DILocation(line: 313, column: 13, scope: !944, inlinedAt: !811)
!949 = !DILocation(line: 0, scope: !875, inlinedAt: !950)
!950 = distinct !DILocation(line: 316, column: 17, scope: !951, inlinedAt: !811)
!951 = distinct !DILexicalBlock(scope: !952, file: !3, line: 316, column: 17)
!952 = distinct !DILexicalBlock(scope: !943, file: !3, line: 315, column: 11)
!953 = !DILocation(line: 211, column: 17, scope: !875, inlinedAt: !950)
!954 = !DILocation(line: 212, column: 21, scope: !875, inlinedAt: !950)
!955 = !DILocation(line: 215, column: 7, scope: !875, inlinedAt: !950)
!956 = !DILocation(line: 217, column: 7, scope: !885, inlinedAt: !950)
!957 = !DILocation(line: 0, scope: !885, inlinedAt: !950)
!958 = !DILocation(line: 0, scope: !884, inlinedAt: !950)
!959 = !DILocation(line: 217, column: 7, scope: !884, inlinedAt: !950)
!960 = !DILocation(line: 213, column: 15, scope: !875, inlinedAt: !950)
!961 = !DILocation(line: 221, column: 18, scope: !875, inlinedAt: !950)
!962 = !DILocation(line: 316, column: 17, scope: !952, inlinedAt: !811)
!963 = !DILocation(line: 318, column: 22, scope: !952, inlinedAt: !811)
!964 = !DILocation(line: 319, column: 19, scope: !965, inlinedAt: !811)
!965 = distinct !DILexicalBlock(scope: !952, file: !3, line: 319, column: 17)
!966 = !DILocation(line: 319, column: 17, scope: !952, inlinedAt: !811)
!967 = !DILocation(line: 0, scope: !900, inlinedAt: !968)
!968 = distinct !DILocation(line: 320, column: 27, scope: !965, inlinedAt: !811)
!969 = !DILocation(line: 199, column: 8, scope: !909, inlinedAt: !968)
!970 = !DILocation(line: 199, column: 19, scope: !911, inlinedAt: !968)
!971 = !DILocation(line: 0, scope: !909, inlinedAt: !968)
!972 = !DILocation(line: 199, column: 3, scope: !909, inlinedAt: !968)
!973 = !DILocation(line: 200, column: 14, scope: !917, inlinedAt: !968)
!974 = !DILocation(line: 200, column: 11, scope: !917, inlinedAt: !968)
!975 = !DILocation(line: 200, column: 9, scope: !911, inlinedAt: !968)
!976 = distinct !{!976, !972, !977, !567}
!977 = !DILocation(line: 201, column: 14, scope: !909, inlinedAt: !968)
!978 = !DILocation(line: 203, column: 1, scope: !900, inlinedAt: !968)
!979 = !DILocation(line: 0, scope: !805, inlinedAt: !811)
!980 = !DILocation(line: 312, column: 37, scope: !944, inlinedAt: !811)
!981 = !DILocation(line: 312, column: 25, scope: !944, inlinedAt: !811)
!982 = distinct !{!982, !940, !983, !567}
!983 = !DILocation(line: 321, column: 11, scope: !807, inlinedAt: !811)
!984 = !DILocation(line: 324, column: 18, scope: !985, inlinedAt: !811)
!985 = distinct !DILexicalBlock(scope: !772, file: !3, line: 324, column: 7)
!986 = !DILocation(line: 324, column: 7, scope: !772, inlinedAt: !811)
!987 = !DILocation(line: 326, column: 7, scope: !988, inlinedAt: !811)
!988 = distinct !DILexicalBlock(scope: !985, file: !3, line: 325, column: 5)
!989 = !DILocation(line: 328, column: 5, scope: !988, inlinedAt: !811)
!990 = !DILocation(line: 0, scope: !809, inlinedAt: !811)
!991 = !DILocation(line: 331, column: 3, scope: !809, inlinedAt: !811)
!992 = !DILocation(line: 331, column: 21, scope: !993, inlinedAt: !811)
!993 = distinct !DILexicalBlock(scope: !809, file: !3, line: 331, column: 3)
!994 = !DILocation(line: 338, column: 3, scope: !772, inlinedAt: !811)
!995 = !DILocation(line: 339, column: 7, scope: !772, inlinedAt: !811)
!996 = !DILocation(line: 332, column: 14, scope: !997, inlinedAt: !811)
!997 = distinct !DILexicalBlock(scope: !993, file: !3, line: 332, column: 9)
!998 = !DILocation(line: 332, column: 11, scope: !997, inlinedAt: !811)
!999 = !DILocation(line: 332, column: 29, scope: !997, inlinedAt: !811)
!1000 = !DILocation(line: 332, column: 34, scope: !997, inlinedAt: !811)
!1001 = !DILocation(line: 332, column: 9, scope: !993, inlinedAt: !811)
!1002 = !DILocation(line: 334, column: 9, scope: !1003, inlinedAt: !811)
!1003 = distinct !DILexicalBlock(scope: !997, file: !3, line: 333, column: 7)
!1004 = !DILocation(line: 336, column: 7, scope: !1003, inlinedAt: !811)
!1005 = !DILocation(line: 331, column: 33, scope: !993, inlinedAt: !811)
!1006 = distinct !{!1006, !991, !1007, !567}
!1007 = !DILocation(line: 336, column: 7, scope: !809, inlinedAt: !811)
!1008 = !DILocation(line: 340, column: 5, scope: !1009, inlinedAt: !811)
!1009 = distinct !DILexicalBlock(scope: !772, file: !3, line: 339, column: 7)
!1010 = !DILocation(line: 343, column: 1, scope: !772, inlinedAt: !811)
!1011 = !DILocation(line: 185, column: 7, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !719, file: !3, line: 185, column: 7)
!1013 = !DILocation(line: 185, column: 28, scope: !1012)
!1014 = !DILocation(line: 185, column: 7, scope: !719)
!1015 = !DILocation(line: 186, column: 5, scope: !1012)
!1016 = !DILocation(line: 188, column: 10, scope: !719)
!1017 = !DILocation(line: 189, column: 1, scope: !719)
!1018 = !DISubprogram(name: "bindtextdomain", scope: !590, file: !590, line: 86, type: !1019, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !593)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!54, !67, !67}
!1021 = !DISubprogram(name: "textdomain", scope: !590, file: !590, line: 82, type: !713, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !593)
!1022 = !DISubprogram(name: "atexit", scope: !712, file: !712, line: 602, type: !1023, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !593)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!62, !204}
!1025 = !DISubprogram(name: "getopt_long", scope: !179, file: !179, line: 66, type: !1026, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !593)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!62, !62, !1028, !67, !1030, !184}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!1031 = !DISubprogram(name: "signal", scope: !58, file: !58, line: 88, type: !1032, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !593)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!57, !62, !57}
!1034 = !DISubprogram(name: "close", scope: !1035, file: !1035, line: 358, type: !1036, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !593)
!1035 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!62, !62}
!1038 = distinct !DISubprogram(name: "iopoll", scope: !415, file: !415, line: 139, type: !1039, scopeLine: 140, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !414, retainedNodes: !1041)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!62, !62, !62, !73}
!1041 = !{!1042, !1043, !1044}
!1042 = !DILocalVariable(name: "fdin", arg: 1, scope: !1038, file: !415, line: 139, type: !62)
!1043 = !DILocalVariable(name: "fdout", arg: 2, scope: !1038, file: !415, line: 139, type: !62)
!1044 = !DILocalVariable(name: "block", arg: 3, scope: !1038, file: !415, line: 139, type: !73)
!1045 = !DILocation(line: 0, scope: !1038)
!1046 = !DILocation(line: 141, column: 10, scope: !1038)
!1047 = !DILocation(line: 141, column: 3, scope: !1038)
!1048 = distinct !DISubprogram(name: "iopoll_internal", scope: !415, file: !415, line: 62, type: !1049, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !414, retainedNodes: !1051)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!62, !62, !62, !73, !73}
!1051 = !{!1052, !1053, !1054, !1055, !1056, !1065, !1066}
!1052 = !DILocalVariable(name: "fdin", arg: 1, scope: !1048, file: !415, line: 62, type: !62)
!1053 = !DILocalVariable(name: "fdout", arg: 2, scope: !1048, file: !415, line: 62, type: !62)
!1054 = !DILocalVariable(name: "block", arg: 3, scope: !1048, file: !415, line: 62, type: !73)
!1055 = !DILocalVariable(name: "broken_output", arg: 4, scope: !1048, file: !415, line: 62, type: !73)
!1056 = !DILocalVariable(name: "pfds", scope: !1048, file: !415, line: 67, type: !1057)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1058, size: 128, elements: !290)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !1059, line: 36, size: 64, elements: !1060)
!1059 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/poll.h", directory: "", checksumkind: CSK_MD5, checksum: "8fae87e980509ab4e228a56ef7f0a295")
!1060 = !{!1061, !1062, !1064}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1058, file: !1059, line: 38, baseType: !62, size: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !1058, file: !1059, line: 39, baseType: !1063, size: 16, offset: 32)
!1063 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !1058, file: !1059, line: 40, baseType: !1063, size: 16, offset: 48)
!1065 = !DILocalVariable(name: "check_out_events", scope: !1048, file: !415, line: 71, type: !62)
!1066 = !DILocalVariable(name: "ret", scope: !1048, file: !415, line: 72, type: !62)
!1067 = !DILocation(line: 0, scope: !1048)
!1068 = !DILocation(line: 64, column: 3, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !415, line: 64, column: 3)
!1070 = distinct !DILexicalBlock(scope: !1048, file: !415, line: 64, column: 3)
!1071 = !DILocation(line: 67, column: 3, scope: !1048)
!1072 = !DILocation(line: 67, column: 17, scope: !1048)
!1073 = !DILocation(line: 67, column: 27, scope: !1048)
!1074 = !DILocation(line: 68, column: 5, scope: !1048)
!1075 = !{!1076, !602, i64 0}
!1076 = !{!"pollfd", !602, i64 0, !636, i64 4, !636, i64 6}
!1077 = !{!1076, !636, i64 4}
!1078 = !{!1076, !636, i64 6}
!1079 = !DILocation(line: 69, column: 5, scope: !1048)
!1080 = !DILocation(line: 74, column: 7, scope: !1048)
!1081 = !DILocation(line: 76, column: 39, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !415, line: 75, column: 5)
!1083 = distinct !DILexicalBlock(scope: !1048, file: !415, line: 74, column: 7)
!1084 = !DILocation(line: 76, column: 22, scope: !1082)
!1085 = !DILocation(line: 78, column: 5, scope: !1082)
!1086 = !DILocation(line: 80, column: 12, scope: !1048)
!1087 = !DILocation(line: 80, column: 19, scope: !1048)
!1088 = !DILocation(line: 80, column: 22, scope: !1048)
!1089 = !DILocation(line: 80, column: 28, scope: !1048)
!1090 = !DILocation(line: 80, column: 3, scope: !1048)
!1091 = !DILocation(line: 82, column: 13, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1048, file: !415, line: 81, column: 5)
!1093 = !DILocation(line: 84, column: 15, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1092, file: !415, line: 84, column: 11)
!1095 = !DILocation(line: 84, column: 11, scope: !1092)
!1096 = !DILocation(line: 88, column: 7, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !415, line: 88, column: 7)
!1098 = distinct !DILexicalBlock(scope: !1092, file: !415, line: 88, column: 7)
!1099 = !DILocation(line: 88, column: 7, scope: !1098)
!1100 = !DILocation(line: 89, column: 19, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1092, file: !415, line: 89, column: 11)
!1102 = !DILocation(line: 89, column: 11, scope: !1101)
!1103 = !DILocation(line: 89, column: 11, scope: !1092)
!1104 = !DILocation(line: 91, column: 19, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1092, file: !415, line: 91, column: 11)
!1106 = !DILocation(line: 91, column: 11, scope: !1105)
!1107 = !DILocation(line: 91, column: 27, scope: !1105)
!1108 = !DILocation(line: 91, column: 11, scope: !1092)
!1109 = distinct !{!1109, !1090, !1110, !567}
!1110 = !DILocation(line: 93, column: 5, scope: !1048)
!1111 = !DILocation(line: 86, column: 15, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1092, file: !415, line: 86, column: 11)
!1113 = !DILocation(line: 86, column: 20, scope: !1112)
!1114 = !DILocation(line: 92, column: 16, scope: !1105)
!1115 = !DILocation(line: 92, column: 9, scope: !1105)
!1116 = !DILocation(line: 136, column: 1, scope: !1048)
!1117 = distinct !DISubprogram(name: "iopoll_input_ok", scope: !415, file: !415, line: 151, type: !1118, scopeLine: 152, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !414, retainedNodes: !1120)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!73, !62}
!1120 = !{!1121, !1122, !1158}
!1121 = !DILocalVariable(name: "fdin", arg: 1, scope: !1117, file: !415, line: 151, type: !62)
!1122 = !DILocalVariable(name: "st", scope: !1117, file: !415, line: 153, type: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1124, line: 44, size: 1024, elements: !1125)
!1124 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!1125 = !{!1126, !1128, !1130, !1132, !1134, !1136, !1138, !1139, !1140, !1141, !1143, !1144, !1146, !1154, !1155, !1156}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1123, file: !1124, line: 46, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !130, line: 145, baseType: !66)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1123, file: !1124, line: 47, baseType: !1129, size: 64, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !130, line: 148, baseType: !66)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1123, file: !1124, line: 48, baseType: !1131, size: 32, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !130, line: 150, baseType: !6)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1123, file: !1124, line: 49, baseType: !1133, size: 32, offset: 160)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !130, line: 151, baseType: !6)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1123, file: !1124, line: 50, baseType: !1135, size: 32, offset: 192)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !130, line: 146, baseType: !6)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1123, file: !1124, line: 51, baseType: !1137, size: 32, offset: 224)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !130, line: 147, baseType: !6)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1123, file: !1124, line: 52, baseType: !1127, size: 64, offset: 256)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1123, file: !1124, line: 53, baseType: !1127, size: 64, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1123, file: !1124, line: 54, baseType: !129, size: 64, offset: 384)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1123, file: !1124, line: 55, baseType: !1142, size: 32, offset: 448)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !130, line: 175, baseType: !62)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1123, file: !1124, line: 56, baseType: !62, size: 32, offset: 480)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1123, file: !1124, line: 57, baseType: !1145, size: 64, offset: 512)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !130, line: 180, baseType: !131)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1123, file: !1124, line: 65, baseType: !1147, size: 128, offset: 576)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1148, line: 11, size: 128, elements: !1149)
!1148 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1149 = !{!1150, !1152}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1147, file: !1148, line: 16, baseType: !1151, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !130, line: 160, baseType: !131)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1147, file: !1148, line: 21, baseType: !1153, size: 64, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !130, line: 197, baseType: !131)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1123, file: !1124, line: 66, baseType: !1147, size: 128, offset: 704)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1123, file: !1124, line: 67, baseType: !1147, size: 128, offset: 832)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1123, file: !1124, line: 79, baseType: !1157, size: 64, offset: 960)
!1157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 64, elements: !290)
!1158 = !DILocalVariable(name: "always_ready", scope: !1117, file: !415, line: 154, type: !73)
!1159 = !DILocation(line: 0, scope: !1117)
!1160 = !DILocation(line: 153, column: 3, scope: !1117)
!1161 = !DILocation(line: 153, column: 15, scope: !1117)
!1162 = !DILocation(line: 154, column: 23, scope: !1117)
!1163 = !DILocation(line: 154, column: 41, scope: !1117)
!1164 = !DILocation(line: 155, column: 23, scope: !1117)
!1165 = !DILocation(line: 155, column: 27, scope: !1117)
!1166 = !{!1167, !602, i64 16}
!1167 = !{!"stat", !1168, i64 0, !1168, i64 8, !602, i64 16, !602, i64 20, !602, i64 24, !602, i64 28, !1168, i64 32, !1168, i64 40, !1168, i64 48, !602, i64 56, !602, i64 60, !1168, i64 64, !1169, i64 72, !1169, i64 88, !1169, i64 104, !512, i64 120}
!1168 = !{!"long", !512, i64 0}
!1169 = !{!"timespec", !1168, i64 0, !1168, i64 8}
!1170 = !DILocation(line: 156, column: 27, scope: !1117)
!1171 = !DILocation(line: 158, column: 1, scope: !1117)
!1172 = !DILocation(line: 157, column: 3, scope: !1117)
!1173 = !DISubprogram(name: "fstat", scope: !1174, file: !1174, line: 210, type: !1175, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !593)
!1174 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "1e5cd132abb12ea0c79aeae3bfa4573e")
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!62, !62, !1177}
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1178 = distinct !DISubprogram(name: "iopoll_output_ok", scope: !415, file: !415, line: 164, type: !1118, scopeLine: 165, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !414, retainedNodes: !1179)
!1179 = !{!1180}
!1180 = !DILocalVariable(name: "fdout", arg: 1, scope: !1178, file: !415, line: 164, type: !62)
!1181 = !DILocation(line: 0, scope: !1178)
!1182 = !DILocation(line: 166, column: 10, scope: !1178)
!1183 = !DILocation(line: 166, column: 26, scope: !1178)
!1184 = !DILocation(line: 166, column: 3, scope: !1178)
!1185 = distinct !DISubprogram(name: "close_wait", scope: !415, file: !415, line: 200, type: !1118, scopeLine: 201, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !414, retainedNodes: !1186)
!1186 = !{!1187}
!1187 = !DILocalVariable(name: "fd", arg: 1, scope: !1185, file: !415, line: 200, type: !62)
!1188 = !DILocation(line: 0, scope: !1185)
!1189 = !DILocation(line: 202, column: 3, scope: !1185)
!1190 = !DILocalVariable(name: "fd", arg: 1, scope: !1191, file: !415, line: 180, type: !62)
!1191 = distinct !DISubprogram(name: "wait_for_nonblocking_write", scope: !415, file: !415, line: 180, type: !1118, scopeLine: 181, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !414, retainedNodes: !1192)
!1192 = !{!1190}
!1193 = !DILocation(line: 0, scope: !1191, inlinedAt: !1194)
!1194 = distinct !DILocation(line: 202, column: 10, scope: !1185)
!1195 = !DILocation(line: 182, column: 9, scope: !1196, inlinedAt: !1194)
!1196 = distinct !DILexicalBlock(scope: !1191, file: !415, line: 182, column: 7)
!1197 = !DILocation(line: 187, column: 7, scope: !1198, inlinedAt: !1194)
!1198 = distinct !DILexicalBlock(scope: !1191, file: !415, line: 187, column: 7)
!1199 = !DILocation(line: 187, column: 45, scope: !1198, inlinedAt: !1194)
!1200 = !DILocation(line: 187, column: 7, scope: !1191, inlinedAt: !1194)
!1201 = distinct !{!1201, !1189, !1202, !567}
!1202 = !DILocation(line: 203, column: 5, scope: !1185)
!1203 = !DILocation(line: 189, column: 13, scope: !1204, inlinedAt: !1194)
!1204 = distinct !DILexicalBlock(scope: !1198, file: !415, line: 188, column: 5)
!1205 = !DILocation(line: 190, column: 7, scope: !1204, inlinedAt: !1194)
!1206 = !DILocation(line: 204, column: 10, scope: !1185)
!1207 = !DILocation(line: 204, column: 21, scope: !1185)
!1208 = !DILocation(line: 204, column: 3, scope: !1185)
!1209 = distinct !DISubprogram(name: "write_wait", scope: !415, file: !415, line: 211, type: !1210, scopeLine: 212, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !414, retainedNodes: !1212)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!73, !62, !52, !64}
!1212 = !{!1213, !1214, !1215, !1216, !1219}
!1213 = !DILocalVariable(name: "fd", arg: 1, scope: !1209, file: !415, line: 211, type: !62)
!1214 = !DILocalVariable(name: "buffer", arg: 2, scope: !1209, file: !415, line: 211, type: !52)
!1215 = !DILocalVariable(name: "size", arg: 3, scope: !1209, file: !415, line: 211, type: !64)
!1216 = !DILocalVariable(name: "buf", scope: !1209, file: !415, line: 213, type: !1217)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!1219 = !DILocalVariable(name: "written", scope: !1220, file: !415, line: 217, type: !787)
