; ModuleID = 'src/truncate.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [29 x i8] c"Usage: %s OPTION... FILE...\0A\00", align 1

!38 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!39 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!40 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!41 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!42 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!43 = !{!44, !45, !46, !51, !53, !54, !57, !59, !60, !50, !56, !61}
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !47, line: 63, baseType: !48)
!47 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !49, line: 152, baseType: !50)
!49 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!50 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !55, line: 46, baseType: !56)
!55 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!56 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!59 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!60 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !62, line: 101, baseType: !63)
!62 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !49, line: 72, baseType: !50)
!64 = !{!65, !67, !69, !71, !0}
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "no_create", scope: !2, file: !3, line: 39, type: !60, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "block_mode", scope: !2, file: !3, line: 42, type: !60, isLocal: true, isDefinition: true)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "ref_file", scope: !2, file: !3, line: 45, type: !57, isLocal: true, isDefinition: true)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !73, file: !74, line: 575, type: !44, isLocal: true, isDefinition: true)
!73 = distinct !DISubprogram(name: "oputs_", scope: !74, file: !74, line: 573, type: !75, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !77)
!74 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!75 = !DISubroutineType(types: !76)
!76 = !{null, !57, !57}
!77 = !{!78, !79, !80, !83, !84, !85, !86, !90, !91, !92, !93, !95, !148, !149, !150, !152, !153}
!78 = !DILocalVariable(name: "program", arg: 1, scope: !73, file: !74, line: 573, type: !57)
!79 = !DILocalVariable(name: "option", arg: 2, scope: !73, file: !74, line: 573, type: !57)
!80 = !DILocalVariable(name: "term", scope: !81, file: !74, line: 585, type: !57)
!81 = distinct !DILexicalBlock(scope: !82, file: !74, line: 582, column: 5)
!82 = distinct !DILexicalBlock(scope: !73, file: !74, line: 581, column: 7)
!83 = !DILocalVariable(name: "double_space", scope: !73, file: !74, line: 594, type: !60)
!84 = !DILocalVariable(name: "first_word", scope: !73, file: !74, line: 595, type: !57)
!85 = !DILocalVariable(name: "option_text", scope: !73, file: !74, line: 596, type: !57)
!86 = !DILocalVariable(name: "s", scope: !87, file: !74, line: 608, type: !57)
!87 = distinct !DILexicalBlock(scope: !88, file: !74, line: 605, column: 5)
!88 = distinct !DILexicalBlock(scope: !89, file: !74, line: 604, column: 12)
!89 = distinct !DILexicalBlock(scope: !73, file: !74, line: 597, column: 7)
!90 = !DILocalVariable(name: "spaces", scope: !87, file: !74, line: 609, type: !54)
!91 = !DILocalVariable(name: "anchor_len", scope: !73, file: !74, line: 620, type: !54)
!92 = !DILocalVariable(name: "desc_text", scope: !73, file: !74, line: 625, type: !57)
!93 = !DILocalVariable(name: "__ptr", scope: !94, file: !74, line: 644, type: !57)
!94 = distinct !DILexicalBlock(scope: !73, file: !74, line: 644, column: 3)
!95 = !DILocalVariable(name: "__stream", scope: !94, file: !74, line: 644, type: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !98, line: 7, baseType: !99)
!98 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !100, line: 49, size: 1728, elements: !101)
!100 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!101 = !{!102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !117, !119, !120, !121, !122, !123, !125, !129, !132, !134, !137, !140, !141, !142, !143, !144}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !99, file: !100, line: 51, baseType: !44, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !99, file: !100, line: 54, baseType: !51, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !99, file: !100, line: 55, baseType: !51, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !99, file: !100, line: 56, baseType: !51, size: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !99, file: !100, line: 57, baseType: !51, size: 64, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !99, file: !100, line: 58, baseType: !51, size: 64, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !99, file: !100, line: 59, baseType: !51, size: 64, offset: 384)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !99, file: !100, line: 60, baseType: !51, size: 64, offset: 448)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !99, file: !100, line: 61, baseType: !51, size: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !99, file: !100, line: 64, baseType: !51, size: 64, offset: 576)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !99, file: !100, line: 65, baseType: !51, size: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !99, file: !100, line: 66, baseType: !51, size: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !99, file: !100, line: 68, baseType: !115, size: 64, offset: 768)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !100, line: 36, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !99, file: !100, line: 70, baseType: !118, size: 64, offset: 832)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !99, file: !100, line: 72, baseType: !44, size: 32, offset: 896)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !99, file: !100, line: 73, baseType: !44, size: 32, offset: 928)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !99, file: !100, line: 74, baseType: !48, size: 64, offset: 960)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !99, file: !100, line: 77, baseType: !45, size: 16, offset: 1024)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !99, file: !100, line: 78, baseType: !124, size: 8, offset: 1040)
!124 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !99, file: !100, line: 79, baseType: !126, size: 8, offset: 1048)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 8, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 1)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !99, file: !100, line: 81, baseType: !130, size: 64, offset: 1088)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !100, line: 43, baseType: null)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !99, file: !100, line: 89, baseType: !133, size: 64, offset: 1152)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !49, line: 153, baseType: !50)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !99, file: !100, line: 91, baseType: !135, size: 64, offset: 1216)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !100, line: 37, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !99, file: !100, line: 92, baseType: !138, size: 64, offset: 1280)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !100, line: 38, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !99, file: !100, line: 93, baseType: !118, size: 64, offset: 1344)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !99, file: !100, line: 94, baseType: !53, size: 64, offset: 1408)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !99, file: !100, line: 95, baseType: !54, size: 64, offset: 1472)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !99, file: !100, line: 96, baseType: !44, size: 32, offset: 1536)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !99, file: !100, line: 98, baseType: !145, size: 160, offset: 1568)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 160, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 20)
!148 = !DILocalVariable(name: "__cnt", scope: !94, file: !74, line: 644, type: !54)
!149 = !DILocalVariable(name: "url_program", scope: !73, file: !74, line: 648, type: !57)
!150 = !DILocalVariable(name: "__ptr", scope: !151, file: !74, line: 686, type: !57)
!151 = distinct !DILexicalBlock(scope: !73, file: !74, line: 686, column: 3)
!152 = !DILocalVariable(name: "__stream", scope: !151, file: !74, line: 686, type: !96)
!153 = !DILocalVariable(name: "__cnt", scope: !151, file: !74, line: 686, type: !54)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 1792, elements: !164)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !157, line: 50, size: 256, elements: !158)
!157 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!158 = !{!159, !160, !161, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !156, file: !157, line: 52, baseType: !57, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !156, file: !157, line: 55, baseType: !44, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !156, file: !157, line: 56, baseType: !162, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !156, file: !157, line: 57, baseType: !44, size: 32, offset: 192)
!164 = !{!165}
!165 = !DISubrange(count: 7)
!166 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!167 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "Version", scope: !170, file: !171, line: 3, type: !57, isLocal: false, isDefinition: true)
!170 = distinct !DICompileUnit(language: DW_LANG_C99, file: !171, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !172, splitDebugInlining: false, nameTableKind: None)
!171 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!172 = !{!168}
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "file_name", scope: !175, file: !176, line: 45, type: !57, isLocal: true, isDefinition: true)
!175 = distinct !DICompileUnit(language: DW_LANG_C99, file: !176, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !177, splitDebugInlining: false, nameTableKind: None)
!176 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!177 = !{!173, !178}
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !175, file: !176, line: 55, type: !60, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !182, file: !183, line: 66, type: !217, isLocal: false, isDefinition: true)
!182 = distinct !DICompileUnit(language: DW_LANG_C99, file: !183, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !184, globals: !185, splitDebugInlining: false, nameTableKind: None)
!183 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!184 = !{!53, !59}
!185 = !{!186, !211, !180, !213, !215}
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "old_file_name", scope: !188, file: !183, line: 304, type: !57, isLocal: true, isDefinition: true)
!188 = distinct !DISubprogram(name: "verror_at_line", scope: !183, file: !183, line: 298, type: !189, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !182, retainedNodes: !204)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !44, !44, !57, !6, !57, !191}
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !47, line: 52, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !193, line: 32, baseType: !194)
!193 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !195, baseType: !196)
!195 = !DIFile(filename: "lib/error.c", directory: "/src")
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !197, size: 256, elements: !198)
!197 = !DINamespace(name: "std", scope: null)
!198 = !{!199, !200, !201, !202, !203}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !196, file: !195, baseType: !53, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !196, file: !195, baseType: !53, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !196, file: !195, baseType: !53, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !196, file: !195, baseType: !44, size: 32, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !196, file: !195, baseType: !44, size: 32, offset: 224)
!204 = !{!205, !206, !207, !208, !209, !210}
!205 = !DILocalVariable(name: "status", arg: 1, scope: !188, file: !183, line: 298, type: !44)
!206 = !DILocalVariable(name: "errnum", arg: 2, scope: !188, file: !183, line: 298, type: !44)
!207 = !DILocalVariable(name: "file_name", arg: 3, scope: !188, file: !183, line: 298, type: !57)
!208 = !DILocalVariable(name: "line_number", arg: 4, scope: !188, file: !183, line: 298, type: !6)
!209 = !DILocalVariable(name: "message", arg: 5, scope: !188, file: !183, line: 298, type: !57)
!210 = !DILocalVariable(name: "args", arg: 6, scope: !188, file: !183, line: 298, type: !191)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "old_line_number", scope: !188, file: !183, line: 305, type: !6, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "error_message_count", scope: !182, file: !183, line: 69, type: !6, isLocal: false, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !182, file: !183, line: 295, type: !44, isLocal: false, isDefinition: true)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null}
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "program_name", scope: !222, file: !223, line: 31, type: !57, isLocal: false, isDefinition: true)
!222 = distinct !DICompileUnit(language: DW_LANG_C99, file: !223, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !224, globals: !225, splitDebugInlining: false, nameTableKind: None)
!223 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!224 = !{!51}
!225 = !{!220}
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "utf07FF", scope: !228, file: !229, line: 46, type: !259, isLocal: true, isDefinition: true)
!228 = distinct !DISubprogram(name: "proper_name_lite", scope: !229, file: !229, line: 38, type: !230, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !232, retainedNodes: !234)
!229 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!230 = !DISubroutineType(types: !231)
!231 = !{!57, !57, !57}
!232 = distinct !DICompileUnit(language: DW_LANG_C99, file: !229, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !233, splitDebugInlining: false, nameTableKind: None)
!233 = !{!226}
!234 = !{!235, !236, !237, !238, !243}
!235 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !228, file: !229, line: 38, type: !57)
!236 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !228, file: !229, line: 38, type: !57)
!237 = !DILocalVariable(name: "translation", scope: !228, file: !229, line: 40, type: !57)
!238 = !DILocalVariable(name: "w", scope: !228, file: !229, line: 47, type: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !240, line: 37, baseType: !241)
!240 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !49, line: 57, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !49, line: 42, baseType: !6)
!243 = !DILocalVariable(name: "mbs", scope: !228, file: !229, line: 48, type: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !245, line: 6, baseType: !246)
!245 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !247, line: 21, baseType: !248)
!247 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 13, size: 64, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !248, file: !247, line: 15, baseType: !44, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !248, file: !247, line: 20, baseType: !252, size: 32, offset: 32)
!252 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !248, file: !247, line: 16, size: 32, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !252, file: !247, line: 18, baseType: !6, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !252, file: !247, line: 19, baseType: !256, size: 32)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 32, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 4)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 16, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 2)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !264, file: !265, line: 76, type: !333, isLocal: false, isDefinition: true)
!264 = distinct !DICompileUnit(language: DW_LANG_C99, file: !265, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !266, retainedTypes: !272, globals: !273, splitDebugInlining: false, nameTableKind: None)
!265 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!266 = !{!29, !267, !14}
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !30, line: 254, baseType: !6, size: 32, elements: !268)
!268 = !{!269, !270, !271}
!269 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!270 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!271 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!272 = !{!44, !45, !54}
!273 = !{!262, !274, !280, !292, !294, !299, !322, !329, !331}
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !264, file: !265, line: 92, type: !276, isLocal: false, isDefinition: true)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 320, elements: !278)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!278 = !{!279}
!279 = !DISubrange(count: 10)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !264, file: !265, line: 1040, type: !282, isLocal: false, isDefinition: true)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !265, line: 56, size: 448, elements: !283)
!283 = !{!284, !285, !286, !290, !291}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !282, file: !265, line: 59, baseType: !29, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !282, file: !265, line: 62, baseType: !44, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !282, file: !265, line: 66, baseType: !287, size: 256, offset: 64)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 8)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !282, file: !265, line: 69, baseType: !57, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !282, file: !265, line: 72, baseType: !57, size: 64, offset: 384)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !264, file: !265, line: 107, type: !282, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "slot0", scope: !264, file: !265, line: 831, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 2048, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 256)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "quote", scope: !301, file: !265, line: 228, type: !320, isLocal: true, isDefinition: true)
!301 = distinct !DISubprogram(name: "gettext_quote", scope: !265, file: !265, line: 197, type: !302, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !264, retainedNodes: !304)
!302 = !DISubroutineType(types: !303)
!303 = !{!57, !57, !29}
!304 = !{!305, !306, !307, !308, !309}
!305 = !DILocalVariable(name: "msgid", arg: 1, scope: !301, file: !265, line: 197, type: !57)
!306 = !DILocalVariable(name: "s", arg: 2, scope: !301, file: !265, line: 197, type: !29)
!307 = !DILocalVariable(name: "translation", scope: !301, file: !265, line: 199, type: !57)
!308 = !DILocalVariable(name: "w", scope: !301, file: !265, line: 229, type: !239)
!309 = !DILocalVariable(name: "mbs", scope: !301, file: !265, line: 230, type: !310)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !245, line: 6, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !247, line: 21, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 13, size: 64, elements: !313)
!313 = !{!314, !315}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !312, file: !247, line: 15, baseType: !44, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !312, file: !247, line: 20, baseType: !316, size: 32, offset: 32)
!316 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !312, file: !247, line: 16, size: 32, elements: !317)
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !316, file: !247, line: 18, baseType: !6, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !316, file: !247, line: 19, baseType: !256, size: 32)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 64, elements: !321)
!321 = !{!261, !258}
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "slotvec", scope: !264, file: !265, line: 834, type: !324, isLocal: true, isDefinition: true)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !265, line: 823, size: 128, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !325, file: !265, line: 825, baseType: !54, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !325, file: !265, line: 826, baseType: !51, size: 64, offset: 64)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "nslots", scope: !264, file: !265, line: 832, type: !44, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "slotvec0", scope: !264, file: !265, line: 833, type: !325, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 704, elements: !335)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!335 = !{!336}
!336 = !DISubrange(count: 11)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !339, file: !340, line: 26, type: !342, isLocal: false, isDefinition: true)
!339 = distinct !DICompileUnit(language: DW_LANG_C99, file: !340, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !341, splitDebugInlining: false, nameTableKind: None)
!340 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!341 = !{!337}
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 376, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 47)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "exit_failure", scope: !347, file: !348, line: 24, type: !350, isLocal: false, isDefinition: true)
!347 = distinct !DICompileUnit(language: DW_LANG_C99, file: !348, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !349, splitDebugInlining: false, nameTableKind: None)
!348 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!349 = !{!345}
!350 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !44)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "internal_state", scope: !353, file: !354, line: 97, type: !357, isLocal: true, isDefinition: true)
!353 = distinct !DICompileUnit(language: DW_LANG_C99, file: !354, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !355, globals: !356, splitDebugInlining: false, nameTableKind: None)
!354 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!355 = !{!53, !54, !59}
!356 = !{!351}
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !245, line: 6, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !247, line: 21, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 13, size: 64, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !359, file: !247, line: 15, baseType: !44, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !359, file: !247, line: 20, baseType: !363, size: 32, offset: 32)
!363 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !359, file: !247, line: 16, size: 32, elements: !364)
!364 = !{!365, !366}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !363, file: !247, line: 18, baseType: !6, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !363, file: !247, line: 19, baseType: !256, size: 32)
!367 = distinct !DICompileUnit(language: DW_LANG_C99, file: !368, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!368 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!369 = distinct !DICompileUnit(language: DW_LANG_C99, file: !370, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !371, retainedTypes: !375, splitDebugInlining: false, nameTableKind: None)
!370 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!371 = !{!372}
!372 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !370, line: 40, baseType: !6, size: 32, elements: !373)
!373 = !{!374}
!374 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!375 = !{!53}
!376 = distinct !DICompileUnit(language: DW_LANG_C99, file: !377, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !378, retainedTypes: !409, splitDebugInlining: false, nameTableKind: None)
!377 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!378 = !{!379, !391}
!379 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !380, file: !377, line: 188, baseType: !6, size: 32, elements: !389)
!380 = distinct !DISubprogram(name: "x2nrealloc", scope: !377, file: !377, line: 176, type: !381, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !376, retainedNodes: !384)
!381 = !DISubroutineType(types: !382)
!382 = !{!53, !53, !383, !54}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!384 = !{!385, !386, !387, !388}
!385 = !DILocalVariable(name: "p", arg: 1, scope: !380, file: !377, line: 176, type: !53)
!386 = !DILocalVariable(name: "pn", arg: 2, scope: !380, file: !377, line: 176, type: !383)
!387 = !DILocalVariable(name: "s", arg: 3, scope: !380, file: !377, line: 176, type: !54)
!388 = !DILocalVariable(name: "n", scope: !380, file: !377, line: 178, type: !54)
!389 = !{!390}
!390 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!391 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !392, file: !377, line: 228, baseType: !6, size: 32, elements: !389)
!392 = distinct !DISubprogram(name: "xpalloc", scope: !377, file: !377, line: 223, type: !393, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !376, retainedNodes: !399)
!393 = !DISubroutineType(types: !394)
!394 = !{!53, !53, !395, !396, !398, !396}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !397, line: 130, baseType: !398)
!397 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !55, line: 35, baseType: !50)
!399 = !{!400, !401, !402, !403, !404, !405, !406, !407, !408}
!400 = !DILocalVariable(name: "pa", arg: 1, scope: !392, file: !377, line: 223, type: !53)
!401 = !DILocalVariable(name: "pn", arg: 2, scope: !392, file: !377, line: 223, type: !395)
!402 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !392, file: !377, line: 223, type: !396)
!403 = !DILocalVariable(name: "n_max", arg: 4, scope: !392, file: !377, line: 223, type: !398)
!404 = !DILocalVariable(name: "s", arg: 5, scope: !392, file: !377, line: 223, type: !396)
!405 = !DILocalVariable(name: "n0", scope: !392, file: !377, line: 230, type: !396)
!406 = !DILocalVariable(name: "n", scope: !392, file: !377, line: 237, type: !396)
!407 = !DILocalVariable(name: "nbytes", scope: !392, file: !377, line: 248, type: !396)
!408 = !DILocalVariable(name: "adjusted_nbytes", scope: !392, file: !377, line: 252, type: !396)
!409 = !{!51, !53, !60, !50, !56}
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!412 = distinct !DICompileUnit(language: DW_LANG_C99, file: !413, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !414, splitDebugInlining: false, nameTableKind: None)
!413 = !DIFile(filename: "lib/xdectoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "42ac5dbff69ece7310ee4220582d5072")
!414 = !{!415, !423}
!415 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !416, line: 30, baseType: !6, size: 32, elements: !417)
!416 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!417 = !{!418, !419, !420, !421, !422}
!418 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!419 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!420 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!421 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!422 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!423 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !424, line: 24, baseType: !6, size: 32, elements: !425)
!424 = !DIFile(filename: "./lib/xdectoint.h", directory: "/src", checksumkind: CSK_MD5, checksum: "940e29395e05012ab491478a296c89a0")
!425 = !{!426, !427, !428, !429}
!426 = !DIEnumerator(name: "XTOINT_MIN_QUIET", value: 1)
!427 = !DIEnumerator(name: "XTOINT_MAX_QUIET", value: 2)
!428 = !DIEnumerator(name: "XTOINT_MIN_RANGE", value: 4)
!429 = !DIEnumerator(name: "XTOINT_MAX_RANGE", value: 8)
!430 = distinct !DICompileUnit(language: DW_LANG_C99, file: !431, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !432, retainedTypes: !433, splitDebugInlining: false, nameTableKind: None)
!431 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d613cb456542443dde992ed5c05f2acb")
!432 = !{!415}
!433 = !{!60, !50, !56, !61}
!434 = distinct !DICompileUnit(language: DW_LANG_C99, file: !435, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!435 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!436 = distinct !DICompileUnit(language: DW_LANG_C99, file: !437, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!437 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!438 = distinct !DICompileUnit(language: DW_LANG_C99, file: !439, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !375, splitDebugInlining: false, nameTableKind: None)
!439 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !375, splitDebugInlining: false, nameTableKind: None)
!441 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !444, splitDebugInlining: false, nameTableKind: None)
!443 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!444 = !{!60, !56, !53}
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!446 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!447 = distinct !DICompileUnit(language: DW_LANG_C99, file: !448, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!448 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!449 = distinct !DICompileUnit(language: DW_LANG_C99, file: !450, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !375, splitDebugInlining: false, nameTableKind: None)
!450 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!451 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!452 = !{i32 7, !"Dwarf Version", i32 5}
!453 = !{i32 2, !"Debug Info Version", i32 3}
!454 = !{i32 1, !"wchar_size", i32 4}
!455 = !{i32 1, !"branch-target-enforcement", i32 0}
!456 = !{i32 1, !"sign-return-address", i32 0}
!457 = !{i32 1, !"sign-return-address-all", i32 0}
!458 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!459 = !{i32 7, !"PIC Level", i32 2}
!460 = !{i32 7, !"PIE Level", i32 2}
!461 = !{i32 7, !"uwtable", i32 1}
!462 = !{i32 7, !"frame-pointer", i32 1}
!463 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 62, type: !464, scopeLine: 63, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !466)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !44}
!466 = !{!467}
!467 = !DILocalVariable(name: "status", arg: 1, scope: !463, file: !3, line: 62, type: !44)
!468 = !DILocation(line: 0, scope: !463)
!469 = !DILocation(line: 64, column: 14, scope: !470)
!470 = distinct !DILexicalBlock(scope: !463, file: !3, line: 64, column: 7)
!471 = !DILocation(line: 64, column: 7, scope: !463)
!472 = !DILocation(line: 65, column: 5, scope: !473)
!473 = distinct !DILexicalBlock(scope: !470, file: !3, line: 65, column: 5)
!474 = !{!475, !475, i64 0}
!475 = !{!"any pointer", !476, i64 0}
!476 = !{!"omnipotent char", !477, i64 0}
!477 = !{!"Simple C/C++ TBAA"}
!478 = !DILocation(line: 68, column: 7, scope: !479)
!479 = distinct !DILexicalBlock(scope: !470, file: !3, line: 67, column: 5)
!480 = !DILocation(line: 69, column: 7, scope: !479)
!481 = !DILocation(line: 736, column: 3, scope: !482, inlinedAt: !484)
!482 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !74, file: !74, line: 734, type: !218, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !483)
!483 = !{}
!484 = distinct !DILocation(line: 79, column: 7, scope: !479)
!485 = !DILocation(line: 81, column: 7, scope: !479)
!486 = !DILocation(line: 84, column: 7, scope: !479)
!487 = !DILocation(line: 87, column: 7, scope: !479)
!488 = !DILocation(line: 90, column: 7, scope: !479)
!489 = !DILocation(line: 93, column: 7, scope: !479)
!490 = !DILocation(line: 94, column: 7, scope: !479)
!491 = !DILocation(line: 744, column: 3, scope: !492, inlinedAt: !493)
!492 = distinct !DISubprogram(name: "emit_size_note", scope: !74, file: !74, line: 742, type: !218, scopeLine: 743, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !483)
!493 = distinct !DILocation(line: 95, column: 7, scope: !479)
!494 = !DILocation(line: 96, column: 7, scope: !479)
!495 = !DILocalVariable(name: "program", arg: 1, scope: !496, file: !74, line: 836, type: !57)
!496 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !74, file: !74, line: 836, type: !497, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !499)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !57}
!499 = !{!495, !500, !507, !508, !510, !511}
!500 = !DILocalVariable(name: "infomap", scope: !496, file: !74, line: 838, type: !501)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 896, elements: !164)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !496, file: !74, line: 838, size: 128, elements: !504)
!504 = !{!505, !506}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !503, file: !74, line: 838, baseType: !57, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !503, file: !74, line: 838, baseType: !57, size: 64, offset: 64)
!507 = !DILocalVariable(name: "node", scope: !496, file: !74, line: 848, type: !57)
!508 = !DILocalVariable(name: "map_prog", scope: !496, file: !74, line: 849, type: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!510 = !DILocalVariable(name: "lc_messages", scope: !496, file: !74, line: 861, type: !57)
!511 = !DILocalVariable(name: "url_program", scope: !496, file: !74, line: 874, type: !57)
!512 = !DILocation(line: 0, scope: !496, inlinedAt: !513)
!513 = distinct !DILocation(line: 100, column: 7, scope: !479)
!514 = !DILocation(line: 838, column: 3, scope: !496, inlinedAt: !513)
!515 = !DILocation(line: 838, column: 67, scope: !496, inlinedAt: !513)
!516 = !DILocation(line: 849, column: 36, scope: !496, inlinedAt: !513)
!517 = !DILocation(line: 851, column: 3, scope: !496, inlinedAt: !513)
!518 = !DILocalVariable(name: "__s1", arg: 1, scope: !519, file: !520, line: 1359, type: !57)
!519 = distinct !DISubprogram(name: "streq", scope: !520, file: !520, line: 1359, type: !521, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !523)
!520 = !DIFile(filename: "./lib/string.h", directory: "/src")
!521 = !DISubroutineType(types: !522)
!522 = !{!60, !57, !57}
!523 = !{!518, !524}
!524 = !DILocalVariable(name: "__s2", arg: 2, scope: !519, file: !520, line: 1359, type: !57)
!525 = !DILocation(line: 0, scope: !519, inlinedAt: !526)
!526 = distinct !DILocation(line: 851, column: 33, scope: !496, inlinedAt: !513)
!527 = !DILocation(line: 1361, column: 11, scope: !519, inlinedAt: !526)
!528 = !DILocation(line: 1361, column: 10, scope: !519, inlinedAt: !526)
!529 = !DILocation(line: 852, column: 13, scope: !496, inlinedAt: !513)
!530 = !DILocation(line: 851, column: 20, scope: !496, inlinedAt: !513)
!531 = !{!532, !475, i64 0}
!532 = !{!"infomap", !475, i64 0, !475, i64 8}
!533 = !DILocation(line: 851, column: 10, scope: !496, inlinedAt: !513)
!534 = !DILocation(line: 851, column: 28, scope: !496, inlinedAt: !513)
!535 = distinct !{!535, !517, !529, !536}
!536 = !{!"llvm.loop.mustprogress"}
!537 = !DILocation(line: 854, column: 17, scope: !538, inlinedAt: !513)
!538 = distinct !DILexicalBlock(scope: !496, file: !74, line: 854, column: 7)
!539 = !{!532, !475, i64 8}
!540 = !DILocation(line: 854, column: 7, scope: !538, inlinedAt: !513)
!541 = !DILocation(line: 854, column: 7, scope: !496, inlinedAt: !513)
!542 = !DILocation(line: 857, column: 3, scope: !496, inlinedAt: !513)
!543 = !DILocation(line: 861, column: 29, scope: !496, inlinedAt: !513)
!544 = !DILocation(line: 862, column: 7, scope: !545, inlinedAt: !513)
!545 = distinct !DILexicalBlock(scope: !496, file: !74, line: 862, column: 7)
!546 = !DILocation(line: 862, column: 19, scope: !545, inlinedAt: !513)
!547 = !DILocation(line: 862, column: 22, scope: !545, inlinedAt: !513)
!548 = !DILocation(line: 862, column: 7, scope: !496, inlinedAt: !513)
!549 = !DILocation(line: 868, column: 7, scope: !550, inlinedAt: !513)
!550 = distinct !DILexicalBlock(scope: !545, file: !74, line: 863, column: 5)
!551 = !DILocation(line: 870, column: 5, scope: !550, inlinedAt: !513)
!552 = !DILocation(line: 0, scope: !519, inlinedAt: !553)
!553 = distinct !DILocation(line: 874, column: 29, scope: !496, inlinedAt: !513)
!554 = !DILocation(line: 875, column: 3, scope: !496, inlinedAt: !513)
!555 = !DILocation(line: 877, column: 3, scope: !496, inlinedAt: !513)
!556 = !DILocation(line: 879, column: 1, scope: !496, inlinedAt: !513)
!557 = !DILocation(line: 102, column: 3, scope: !463)
!558 = !DISubprogram(name: "dcgettext", scope: !559, file: !559, line: 51, type: !560, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !483)
!559 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!560 = !DISubroutineType(types: !561)
!561 = !{!51, !57, !57, !44}
!562 = !DISubprogram(name: "fputs_unlocked", scope: !47, file: !47, line: 691, type: !563, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !483)
!563 = !DISubroutineType(types: !564)
!564 = !{!44, !565, !566}
!565 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !57)
!566 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !96)
!567 = !DILocation(line: 0, scope: !73)
!568 = !DILocation(line: 581, column: 7, scope: !82)
!569 = !{!570, !570, i64 0}
!570 = !{!"int", !476, i64 0}
!571 = !DILocation(line: 581, column: 19, scope: !82)
!572 = !DILocation(line: 581, column: 7, scope: !73)
!573 = !DILocation(line: 585, column: 26, scope: !81)
!574 = !DILocation(line: 0, scope: !81)
!575 = !DILocation(line: 586, column: 23, scope: !81)
!576 = !DILocation(line: 586, column: 28, scope: !81)
!577 = !DILocation(line: 586, column: 32, scope: !81)
!578 = !{!476, !476, i64 0}
!579 = !DILocation(line: 586, column: 38, scope: !81)
!580 = !DILocation(line: 0, scope: !519, inlinedAt: !581)
!581 = distinct !DILocation(line: 586, column: 41, scope: !81)
!582 = !DILocation(line: 1361, column: 11, scope: !519, inlinedAt: !581)
!583 = !DILocation(line: 1361, column: 10, scope: !519, inlinedAt: !581)
!584 = !DILocation(line: 586, column: 19, scope: !81)
!585 = !DILocation(line: 587, column: 5, scope: !81)
!586 = !DILocation(line: 588, column: 7, scope: !587)
!587 = distinct !DILexicalBlock(scope: !73, file: !74, line: 588, column: 7)
!588 = !DILocation(line: 588, column: 7, scope: !73)
!589 = !DILocation(line: 590, column: 7, scope: !590)
!590 = distinct !DILexicalBlock(scope: !587, file: !74, line: 589, column: 5)
!591 = !DILocation(line: 591, column: 7, scope: !590)
!592 = !DILocation(line: 595, column: 37, scope: !73)
!593 = !DILocation(line: 595, column: 35, scope: !73)
!594 = !DILocation(line: 596, column: 29, scope: !73)
!595 = !DILocation(line: 597, column: 8, scope: !89)
!596 = !DILocation(line: 597, column: 7, scope: !73)
!597 = !DILocation(line: 604, column: 24, scope: !88)
!598 = !DILocation(line: 604, column: 12, scope: !89)
!599 = !DILocation(line: 0, scope: !87)
!600 = !DILocation(line: 610, column: 16, scope: !87)
!601 = !DILocation(line: 610, column: 7, scope: !87)
!602 = !DILocation(line: 611, column: 21, scope: !87)
!603 = !{!604, !604, i64 0}
!604 = !{!"short", !476, i64 0}
!605 = !DILocation(line: 611, column: 19, scope: !87)
!606 = !DILocation(line: 611, column: 16, scope: !87)
!607 = !DILocation(line: 610, column: 30, scope: !87)
!608 = distinct !{!608, !601, !602, !536}
!609 = !DILocation(line: 612, column: 18, scope: !610)
!610 = distinct !DILexicalBlock(scope: !87, file: !74, line: 612, column: 11)
!611 = !DILocation(line: 612, column: 11, scope: !87)
!612 = !DILocation(line: 620, column: 23, scope: !73)
!613 = !DILocation(line: 625, column: 39, scope: !73)
!614 = !DILocation(line: 626, column: 3, scope: !73)
!615 = !DILocation(line: 626, column: 10, scope: !73)
!616 = !DILocation(line: 626, column: 21, scope: !73)
!617 = !DILocation(line: 628, column: 44, scope: !618)
!618 = distinct !DILexicalBlock(scope: !619, file: !74, line: 628, column: 11)
!619 = distinct !DILexicalBlock(scope: !73, file: !74, line: 627, column: 5)
!620 = !DILocation(line: 628, column: 32, scope: !618)
!621 = !DILocation(line: 628, column: 49, scope: !618)
!622 = !DILocation(line: 628, column: 11, scope: !619)
!623 = !DILocation(line: 630, column: 11, scope: !624)
!624 = distinct !DILexicalBlock(scope: !619, file: !74, line: 630, column: 11)
!625 = !DILocation(line: 630, column: 11, scope: !619)
!626 = !DILocation(line: 632, column: 26, scope: !627)
!627 = distinct !DILexicalBlock(scope: !628, file: !74, line: 632, column: 15)
!628 = distinct !DILexicalBlock(scope: !624, file: !74, line: 631, column: 9)
!629 = !DILocation(line: 632, column: 34, scope: !627)
!630 = !DILocation(line: 632, column: 37, scope: !627)
!631 = !DILocation(line: 632, column: 15, scope: !628)
!632 = !DILocation(line: 636, column: 29, scope: !633)
!633 = distinct !DILexicalBlock(scope: !628, file: !74, line: 636, column: 15)
!634 = !DILocation(line: 640, column: 16, scope: !619)
!635 = distinct !{!635, !614, !636, !536}
!636 = !DILocation(line: 641, column: 5, scope: !73)
!637 = !DILocation(line: 644, column: 3, scope: !73)
!638 = !DILocation(line: 0, scope: !519, inlinedAt: !639)
!639 = distinct !DILocation(line: 648, column: 31, scope: !73)
!640 = !DILocation(line: 0, scope: !519, inlinedAt: !641)
!641 = distinct !DILocation(line: 649, column: 31, scope: !73)
!642 = !DILocation(line: 0, scope: !519, inlinedAt: !643)
!643 = distinct !DILocation(line: 650, column: 31, scope: !73)
!644 = !DILocation(line: 0, scope: !519, inlinedAt: !645)
!645 = distinct !DILocation(line: 651, column: 31, scope: !73)
!646 = !DILocation(line: 0, scope: !519, inlinedAt: !647)
!647 = distinct !DILocation(line: 652, column: 31, scope: !73)
!648 = !DILocation(line: 0, scope: !519, inlinedAt: !649)
!649 = distinct !DILocation(line: 653, column: 31, scope: !73)
!650 = !DILocation(line: 0, scope: !519, inlinedAt: !651)
!651 = distinct !DILocation(line: 654, column: 31, scope: !73)
!652 = !DILocation(line: 0, scope: !519, inlinedAt: !653)
!653 = distinct !DILocation(line: 655, column: 31, scope: !73)
!654 = !DILocation(line: 0, scope: !519, inlinedAt: !655)
!655 = distinct !DILocation(line: 656, column: 31, scope: !73)
!656 = !DILocation(line: 0, scope: !519, inlinedAt: !657)
!657 = distinct !DILocation(line: 657, column: 31, scope: !73)
!658 = !DILocation(line: 663, column: 7, scope: !659)
!659 = distinct !DILexicalBlock(scope: !73, file: !74, line: 663, column: 7)
!660 = !DILocation(line: 664, column: 7, scope: !659)
!661 = !DILocation(line: 664, column: 10, scope: !659)
!662 = !DILocation(line: 663, column: 7, scope: !73)
!663 = !DILocation(line: 669, column: 7, scope: !664)
!664 = distinct !DILexicalBlock(scope: !659, file: !74, line: 665, column: 5)
!665 = !DILocation(line: 671, column: 5, scope: !664)
!666 = !DILocation(line: 676, column: 7, scope: !667)
!667 = distinct !DILexicalBlock(scope: !659, file: !74, line: 673, column: 5)
!668 = !DILocation(line: 679, column: 3, scope: !73)
!669 = !DILocation(line: 683, column: 3, scope: !73)
!670 = !DILocation(line: 686, column: 3, scope: !73)
!671 = !DILocation(line: 688, column: 3, scope: !73)
!672 = !DILocation(line: 691, column: 3, scope: !73)
!673 = !DILocation(line: 695, column: 3, scope: !73)
!674 = !DILocation(line: 696, column: 1, scope: !73)
!675 = !DISubprogram(name: "setlocale", scope: !676, file: !676, line: 122, type: !677, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !483)
!676 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!677 = !DISubroutineType(types: !678)
!678 = !{!51, !44, !57}
!679 = !DISubprogram(name: "getenv", scope: !680, file: !680, line: 641, type: !681, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !483)
!680 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!681 = !DISubroutineType(types: !682)
!682 = !{!51, !57}
!683 = !DISubprogram(name: "fwrite_unlocked", scope: !47, file: !47, line: 704, type: !684, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !483)
!684 = !DISubroutineType(types: !685)
!685 = !{!54, !686, !54, !54, !566}
!686 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!689 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 201, type: !690, scopeLine: 202, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !693)
!690 = !DISubroutineType(types: !691)
!691 = !{!44, !44, !692}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!693 = !{!694, !695, !696, !697, !698, !699, !701, !702, !740, !741, !744, !747, !748, !749, !750, !752}
!694 = !DILocalVariable(name: "argc", arg: 1, scope: !689, file: !3, line: 201, type: !44)
!695 = !DILocalVariable(name: "argv", arg: 2, scope: !689, file: !3, line: 201, type: !692)
!696 = !DILocalVariable(name: "got_size", scope: !689, file: !3, line: 203, type: !60)
!697 = !DILocalVariable(name: "size", scope: !689, file: !3, line: 204, type: !46)
!698 = !DILocalVariable(name: "rsize", scope: !689, file: !3, line: 205, type: !46)
!699 = !DILocalVariable(name: "rel_mode", scope: !689, file: !3, line: 206, type: !700)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "rel_mode_t", file: !3, line: 59, baseType: !5)
!701 = !DILocalVariable(name: "c", scope: !689, file: !3, line: 207, type: !44)
!702 = !DILocalVariable(name: "sb", scope: !703, file: !3, line: 321, type: !705)
!703 = distinct !DILexicalBlock(scope: !704, file: !3, line: 320, column: 5)
!704 = distinct !DILexicalBlock(scope: !689, file: !3, line: 319, column: 7)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !706, line: 44, size: 1024, elements: !707)
!706 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!707 = !{!708, !710, !712, !714, !716, !718, !720, !721, !722, !723, !725, !726, !728, !736, !737, !738}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !705, file: !706, line: 46, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !49, line: 145, baseType: !56)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !705, file: !706, line: 47, baseType: !711, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !49, line: 148, baseType: !56)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !705, file: !706, line: 48, baseType: !713, size: 32, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !49, line: 150, baseType: !6)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !705, file: !706, line: 49, baseType: !715, size: 32, offset: 160)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !49, line: 151, baseType: !6)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !705, file: !706, line: 50, baseType: !717, size: 32, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !49, line: 146, baseType: !6)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !705, file: !706, line: 51, baseType: !719, size: 32, offset: 224)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !49, line: 147, baseType: !6)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !705, file: !706, line: 52, baseType: !709, size: 64, offset: 256)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !705, file: !706, line: 53, baseType: !709, size: 64, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !705, file: !706, line: 54, baseType: !48, size: 64, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !705, file: !706, line: 55, baseType: !724, size: 32, offset: 448)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !49, line: 175, baseType: !44)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !705, file: !706, line: 56, baseType: !44, size: 32, offset: 480)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !705, file: !706, line: 57, baseType: !727, size: 64, offset: 512)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !49, line: 180, baseType: !50)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !705, file: !706, line: 65, baseType: !729, size: 128, offset: 576)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !730, line: 11, size: 128, elements: !731)
!730 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!731 = !{!732, !734}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !729, file: !730, line: 16, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !49, line: 160, baseType: !50)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !729, file: !730, line: 21, baseType: !735, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !49, line: 197, baseType: !50)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !705, file: !706, line: 66, baseType: !729, size: 128, offset: 704)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !705, file: !706, line: 67, baseType: !729, size: 128, offset: 832)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !705, file: !706, line: 79, baseType: !739, size: 64, offset: 960)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 64, elements: !260)
!740 = !DILocalVariable(name: "file_size", scope: !703, file: !3, line: 322, type: !46)
!741 = !DILocalVariable(name: "ref_fd", scope: !742, file: !3, line: 329, type: !44)
!742 = distinct !DILexicalBlock(scope: !743, file: !3, line: 328, column: 9)
!743 = distinct !DILexicalBlock(scope: !703, file: !3, line: 325, column: 11)
!744 = !DILocalVariable(name: "file_end", scope: !745, file: !3, line: 332, type: !46)
!745 = distinct !DILexicalBlock(scope: !746, file: !3, line: 331, column: 13)
!746 = distinct !DILexicalBlock(scope: !742, file: !3, line: 330, column: 15)
!747 = !DILocalVariable(name: "saved_errno", scope: !745, file: !3, line: 333, type: !44)
!748 = !DILocalVariable(name: "oflags", scope: !689, file: !3, line: 353, type: !44)
!749 = !DILocalVariable(name: "errors", scope: !689, file: !3, line: 354, type: !60)
!750 = !DILocalVariable(name: "fname", scope: !751, file: !3, line: 356, type: !57)
!751 = distinct !DILexicalBlock(scope: !689, file: !3, line: 356, column: 3)
!752 = !DILocalVariable(name: "fd", scope: !753, file: !3, line: 358, type: !44)
!753 = distinct !DILexicalBlock(scope: !754, file: !3, line: 357, column: 5)
!754 = distinct !DILexicalBlock(scope: !751, file: !3, line: 356, column: 3)
!755 = !DILocation(line: 0, scope: !689)
!756 = !DILocation(line: 210, column: 21, scope: !689)
!757 = !DILocation(line: 210, column: 3, scope: !689)
!758 = !DILocation(line: 211, column: 3, scope: !689)
!759 = !DILocation(line: 212, column: 3, scope: !689)
!760 = !DILocation(line: 213, column: 3, scope: !689)
!761 = !DILocation(line: 215, column: 3, scope: !689)
!762 = !DILocation(line: 217, column: 3, scope: !689)
!763 = !DILocation(line: 217, column: 15, scope: !689)
!764 = !DILocation(line: 235, column: 18, scope: !765)
!765 = distinct !DILexicalBlock(scope: !766, file: !3, line: 220, column: 9)
!766 = distinct !DILexicalBlock(scope: !689, file: !3, line: 218, column: 5)
!767 = !DILocation(line: 235, column: 11, scope: !765)
!768 = !DILocation(line: 222, column: 21, scope: !765)
!769 = !DILocation(line: 223, column: 11, scope: !765)
!770 = !DILocation(line: 226, column: 22, scope: !765)
!771 = !DILocation(line: 227, column: 11, scope: !765)
!772 = !DILocation(line: 230, column: 22, scope: !765)
!773 = !DILocation(line: 230, column: 20, scope: !765)
!774 = !DILocation(line: 231, column: 11, scope: !765)
!775 = distinct !{!775, !762, !776, !536}
!776 = !DILocation(line: 286, column: 5, scope: !689)
!777 = !DILocation(line: 236, column: 19, scope: !765)
!778 = distinct !{!778, !767, !777, !536}
!779 = !DILocation(line: 237, column: 11, scope: !765)
!780 = !DILocation(line: 246, column: 15, scope: !781)
!781 = distinct !DILexicalBlock(scope: !765, file: !3, line: 238, column: 13)
!782 = !DILocation(line: 250, column: 15, scope: !781)
!783 = !DILocation(line: 254, column: 15, scope: !781)
!784 = !DILocation(line: 0, scope: !781)
!785 = !DILocation(line: 257, column: 18, scope: !765)
!786 = !DILocation(line: 257, column: 11, scope: !765)
!787 = !DILocation(line: 258, column: 19, scope: !765)
!788 = distinct !{!788, !786, !787, !536}
!789 = !DILocation(line: 259, column: 30, scope: !790)
!790 = distinct !DILexicalBlock(scope: !765, file: !3, line: 259, column: 15)
!791 = !DILocation(line: 261, column: 19, scope: !792)
!792 = distinct !DILexicalBlock(scope: !793, file: !3, line: 261, column: 19)
!793 = distinct !DILexicalBlock(scope: !790, file: !3, line: 260, column: 13)
!794 = !DILocation(line: 261, column: 19, scope: !793)
!795 = !DILocation(line: 263, column: 19, scope: !796)
!796 = distinct !DILexicalBlock(scope: !792, file: !3, line: 262, column: 17)
!797 = !DILocation(line: 265, column: 19, scope: !796)
!798 = !DILocation(line: 272, column: 30, scope: !765)
!799 = !DILocation(line: 271, column: 18, scope: !765)
!800 = !DILocation(line: 274, column: 35, scope: !801)
!801 = distinct !DILexicalBlock(scope: !765, file: !3, line: 274, column: 15)
!802 = !DILocation(line: 275, column: 13, scope: !801)
!803 = !DILocation(line: 279, column: 9, scope: !765)
!804 = !DILocation(line: 281, column: 9, scope: !765)
!805 = !DILocation(line: 284, column: 11, scope: !765)
!806 = !DILocation(line: 288, column: 11, scope: !689)
!807 = !DILocation(line: 288, column: 8, scope: !689)
!808 = !DILocation(line: 292, column: 8, scope: !809)
!809 = distinct !DILexicalBlock(scope: !689, file: !3, line: 292, column: 7)
!810 = !DILocation(line: 292, column: 17, scope: !809)
!811 = !DILocation(line: 294, column: 7, scope: !812)
!812 = distinct !DILexicalBlock(scope: !809, file: !3, line: 293, column: 5)
!813 = !DILocation(line: 296, column: 7, scope: !812)
!814 = !DILocation(line: 299, column: 16, scope: !815)
!815 = distinct !DILexicalBlock(scope: !689, file: !3, line: 299, column: 7)
!816 = !DILocation(line: 299, column: 28, scope: !815)
!817 = !DILocation(line: 301, column: 7, scope: !818)
!818 = distinct !DILexicalBlock(scope: !815, file: !3, line: 300, column: 5)
!819 = !DILocation(line: 303, column: 7, scope: !818)
!820 = !DILocation(line: 306, column: 7, scope: !821)
!821 = distinct !DILexicalBlock(scope: !689, file: !3, line: 306, column: 7)
!822 = !DILocation(line: 306, column: 18, scope: !821)
!823 = !DILocation(line: 308, column: 7, scope: !824)
!824 = distinct !DILexicalBlock(scope: !821, file: !3, line: 307, column: 5)
!825 = !DILocation(line: 310, column: 7, scope: !824)
!826 = !DILocation(line: 313, column: 12, scope: !827)
!827 = distinct !DILexicalBlock(scope: !689, file: !3, line: 313, column: 7)
!828 = !DILocation(line: 313, column: 7, scope: !689)
!829 = !DILocation(line: 315, column: 7, scope: !830)
!830 = distinct !DILexicalBlock(scope: !827, file: !3, line: 314, column: 5)
!831 = !DILocation(line: 316, column: 7, scope: !830)
!832 = !DILocation(line: 319, column: 7, scope: !689)
!833 = !DILocation(line: 321, column: 7, scope: !703)
!834 = !DILocation(line: 321, column: 19, scope: !703)
!835 = !DILocation(line: 0, scope: !703)
!836 = !DILocation(line: 323, column: 11, scope: !837)
!837 = distinct !DILexicalBlock(scope: !703, file: !3, line: 323, column: 11)
!838 = !DILocation(line: 323, column: 32, scope: !837)
!839 = !DILocation(line: 323, column: 11, scope: !703)
!840 = !DILocation(line: 324, column: 9, scope: !837)
!841 = !DILocation(line: 325, column: 11, scope: !743)
!842 = !{!843, !570, i64 16}
!843 = !{!"stat", !844, i64 0, !844, i64 8, !570, i64 16, !570, i64 20, !570, i64 24, !570, i64 28, !844, i64 32, !844, i64 40, !844, i64 48, !570, i64 56, !570, i64 60, !844, i64 64, !845, i64 72, !845, i64 88, !845, i64 104, !476, i64 120}
!844 = !{!"long", !476, i64 0}
!845 = !{!"timespec", !844, i64 0, !844, i64 8}
!846 = !DILocalVariable(name: "sb", arg: 1, scope: !847, file: !74, line: 911, type: !850)
!847 = distinct !DISubprogram(name: "usable_st_size", scope: !74, file: !74, line: 911, type: !848, scopeLine: 912, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !852)
!848 = !DISubroutineType(types: !849)
!849 = !{!60, !850}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!852 = !{!846}
!853 = !DILocation(line: 0, scope: !847, inlinedAt: !854)
!854 = distinct !DILocation(line: 325, column: 11, scope: !743)
!855 = !DILocation(line: 913, column: 11, scope: !847, inlinedAt: !854)
!856 = !DILocation(line: 913, column: 33, scope: !847, inlinedAt: !854)
!857 = !DILocation(line: 325, column: 11, scope: !703)
!858 = !DILocation(line: 329, column: 30, scope: !742)
!859 = !DILocation(line: 329, column: 24, scope: !742)
!860 = !DILocation(line: 0, scope: !742)
!861 = !DILocation(line: 330, column: 17, scope: !746)
!862 = !DILocation(line: 330, column: 15, scope: !742)
!863 = !DILocation(line: 332, column: 32, scope: !745)
!864 = !DILocation(line: 0, scope: !745)
!865 = !DILocation(line: 333, column: 33, scope: !745)
!866 = !DILocation(line: 334, column: 15, scope: !745)
!867 = !DILocation(line: 335, column: 21, scope: !868)
!868 = distinct !DILexicalBlock(scope: !745, file: !3, line: 335, column: 19)
!869 = !DILocation(line: 335, column: 19, scope: !745)
!870 = !DILocation(line: 340, column: 25, scope: !871)
!871 = distinct !DILexicalBlock(scope: !868, file: !3, line: 338, column: 17)
!872 = !DILocation(line: 326, column: 24, scope: !743)
!873 = !{!843, !844, i64 48}
!874 = !DILocation(line: 344, column: 21, scope: !875)
!875 = distinct !DILexicalBlock(scope: !703, file: !3, line: 344, column: 11)
!876 = !DILocation(line: 344, column: 11, scope: !703)
!877 = !DILocation(line: 345, column: 9, scope: !875)
!878 = !DILocation(line: 351, column: 5, scope: !704)
!879 = !DILocation(line: 351, column: 5, scope: !703)
!880 = !DILocation(line: 353, column: 28, scope: !689)
!881 = !DILocation(line: 353, column: 53, scope: !689)
!882 = !DILocation(line: 356, column: 36, scope: !754)
!883 = !DILocation(line: 0, scope: !751)
!884 = !DILocation(line: 356, column: 3, scope: !751)
!885 = !DILocation(line: 383, column: 10, scope: !689)
!886 = !DILocation(line: 384, column: 1, scope: !689)
!887 = !DILocation(line: 358, column: 16, scope: !753)
!888 = !DILocation(line: 0, scope: !753)
!889 = !DILocation(line: 359, column: 14, scope: !890)
!890 = distinct !DILexicalBlock(scope: !753, file: !3, line: 359, column: 11)
!891 = !DILocation(line: 359, column: 11, scope: !753)
!892 = !DILocation(line: 365, column: 17, scope: !893)
!893 = distinct !DILexicalBlock(scope: !894, file: !3, line: 365, column: 15)
!894 = distinct !DILexicalBlock(scope: !890, file: !3, line: 360, column: 9)
!895 = !DILocation(line: 0, scope: !893)
!896 = !DILocation(line: 365, column: 27, scope: !893)
!897 = !DILocation(line: 365, column: 30, scope: !893)
!898 = !DILocation(line: 365, column: 36, scope: !893)
!899 = !DILocation(line: 365, column: 15, scope: !894)
!900 = !DILocalVariable(name: "fd", arg: 1, scope: !901, file: !3, line: 107, type: !44)
!901 = distinct !DISubprogram(name: "do_ftruncate", scope: !3, file: !3, line: 107, type: !902, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !904)
!902 = !DISubroutineType(types: !903)
!903 = !{!60, !44, !57, !46, !46, !700}
!904 = !{!900, !905, !906, !907, !908, !909, !910, !911, !914, !915, !918}
!905 = !DILocalVariable(name: "fname", arg: 2, scope: !901, file: !3, line: 107, type: !57)
!906 = !DILocalVariable(name: "ssize", arg: 3, scope: !901, file: !3, line: 107, type: !46)
!907 = !DILocalVariable(name: "rsize", arg: 4, scope: !901, file: !3, line: 107, type: !46)
!908 = !DILocalVariable(name: "rel_mode", arg: 5, scope: !901, file: !3, line: 108, type: !700)
!909 = !DILocalVariable(name: "sb", scope: !901, file: !3, line: 110, type: !705)
!910 = !DILocalVariable(name: "nsize", scope: !901, file: !3, line: 111, type: !46)
!911 = !DILocalVariable(name: "blksize", scope: !912, file: !3, line: 120, type: !398)
!912 = distinct !DILexicalBlock(scope: !913, file: !3, line: 119, column: 5)
!913 = distinct !DILexicalBlock(scope: !901, file: !3, line: 118, column: 7)
!914 = !DILocalVariable(name: "ssize0", scope: !912, file: !3, line: 121, type: !61)
!915 = !DILocalVariable(name: "fsize", scope: !916, file: !3, line: 132, type: !46)
!916 = distinct !DILexicalBlock(scope: !917, file: !3, line: 131, column: 5)
!917 = distinct !DILexicalBlock(scope: !901, file: !3, line: 130, column: 7)
!918 = !DILocalVariable(name: "r", scope: !919, file: !3, line: 174, type: !46)
!919 = distinct !DILexicalBlock(scope: !920, file: !3, line: 172, column: 13)
!920 = distinct !DILexicalBlock(scope: !921, file: !3, line: 171, column: 15)
!921 = distinct !DILexicalBlock(scope: !922, file: !3, line: 170, column: 9)
!922 = distinct !DILexicalBlock(scope: !923, file: !3, line: 166, column: 16)
!923 = distinct !DILexicalBlock(scope: !924, file: !3, line: 164, column: 16)
!924 = distinct !DILexicalBlock(scope: !916, file: !3, line: 162, column: 11)
!925 = !DILocation(line: 0, scope: !901, inlinedAt: !926)
!926 = distinct !DILocation(line: 374, column: 22, scope: !927)
!927 = distinct !DILexicalBlock(scope: !890, file: !3, line: 373, column: 9)
!928 = !DILocation(line: 110, column: 3, scope: !901, inlinedAt: !926)
!929 = !DILocation(line: 110, column: 15, scope: !901, inlinedAt: !926)
!930 = !DILocation(line: 113, column: 8, scope: !931, inlinedAt: !926)
!931 = distinct !DILexicalBlock(scope: !901, file: !3, line: 113, column: 7)
!932 = !DILocation(line: 113, column: 19, scope: !931, inlinedAt: !926)
!933 = !DILocation(line: 113, column: 50, scope: !931, inlinedAt: !926)
!934 = !DILocation(line: 113, column: 66, scope: !931, inlinedAt: !926)
!935 = !DILocation(line: 113, column: 7, scope: !901, inlinedAt: !926)
!936 = !DILocation(line: 115, column: 7, scope: !937, inlinedAt: !926)
!937 = distinct !DILexicalBlock(scope: !931, file: !3, line: 114, column: 5)
!938 = !DILocation(line: 116, column: 7, scope: !937, inlinedAt: !926)
!939 = !DILocation(line: 118, column: 7, scope: !913, inlinedAt: !926)
!940 = !DILocation(line: 118, column: 7, scope: !901, inlinedAt: !926)
!941 = !DILocation(line: 120, column: 27, scope: !912, inlinedAt: !926)
!942 = !{!843, !570, i64 56}
!943 = !DILocation(line: 0, scope: !912, inlinedAt: !926)
!944 = !DILocation(line: 122, column: 11, scope: !945, inlinedAt: !926)
!945 = distinct !DILexicalBlock(scope: !912, file: !3, line: 122, column: 11)
!946 = !DILocation(line: 122, column: 11, scope: !912, inlinedAt: !926)
!947 = !DILocation(line: 124, column: 11, scope: !948, inlinedAt: !926)
!948 = distinct !DILexicalBlock(scope: !945, file: !3, line: 123, column: 9)
!949 = !DILocation(line: 130, column: 7, scope: !901, inlinedAt: !926)
!950 = !DILocation(line: 134, column: 11, scope: !916, inlinedAt: !926)
!951 = !DILocation(line: 138, column: 15, scope: !952, inlinedAt: !926)
!952 = distinct !DILexicalBlock(scope: !953, file: !3, line: 138, column: 15)
!953 = distinct !DILexicalBlock(scope: !954, file: !3, line: 137, column: 9)
!954 = distinct !DILexicalBlock(scope: !916, file: !3, line: 134, column: 11)
!955 = !DILocation(line: 0, scope: !847, inlinedAt: !956)
!956 = distinct !DILocation(line: 138, column: 15, scope: !952, inlinedAt: !926)
!957 = !DILocation(line: 913, column: 11, scope: !847, inlinedAt: !956)
!958 = !DILocation(line: 913, column: 33, scope: !847, inlinedAt: !956)
!959 = !DILocation(line: 138, column: 15, scope: !953, inlinedAt: !926)
!960 = !DILocation(line: 140, column: 26, scope: !961, inlinedAt: !926)
!961 = distinct !DILexicalBlock(scope: !952, file: !3, line: 139, column: 13)
!962 = !DILocation(line: 0, scope: !916, inlinedAt: !926)
!963 = !DILocation(line: 141, column: 25, scope: !964, inlinedAt: !926)
!964 = distinct !DILexicalBlock(scope: !961, file: !3, line: 141, column: 19)
!965 = !DILocation(line: 141, column: 19, scope: !961, inlinedAt: !926)
!966 = !DILocation(line: 145, column: 19, scope: !967, inlinedAt: !926)
!967 = distinct !DILexicalBlock(scope: !964, file: !3, line: 142, column: 17)
!968 = !DILocation(line: 147, column: 19, scope: !967, inlinedAt: !926)
!969 = !DILocation(line: 152, column: 23, scope: !970, inlinedAt: !926)
!970 = distinct !DILexicalBlock(scope: !952, file: !3, line: 151, column: 13)
!971 = !DILocation(line: 153, column: 25, scope: !972, inlinedAt: !926)
!972 = distinct !DILexicalBlock(scope: !970, file: !3, line: 153, column: 19)
!973 = !DILocation(line: 153, column: 19, scope: !970, inlinedAt: !926)
!974 = !DILocation(line: 155, column: 19, scope: !975, inlinedAt: !926)
!975 = distinct !DILexicalBlock(scope: !972, file: !3, line: 154, column: 17)
!976 = !DILocation(line: 157, column: 19, scope: !975, inlinedAt: !926)
!977 = !DILocation(line: 0, scope: !954, inlinedAt: !926)
!978 = !DILocation(line: 162, column: 11, scope: !916, inlinedAt: !926)
!979 = !DILocation(line: 163, column: 17, scope: !924, inlinedAt: !926)
!980 = !DILocation(line: 163, column: 9, scope: !924, inlinedAt: !926)
!981 = !DILocation(line: 165, column: 17, scope: !923, inlinedAt: !926)
!982 = !DILocation(line: 165, column: 9, scope: !923, inlinedAt: !926)
!983 = !DILocation(line: 168, column: 31, scope: !922, inlinedAt: !926)
!984 = !DILocation(line: 168, column: 23, scope: !922, inlinedAt: !926)
!985 = !DILocation(line: 168, column: 9, scope: !922, inlinedAt: !926)
!986 = !DILocation(line: 174, column: 31, scope: !919, inlinedAt: !926)
!987 = !DILocation(line: 0, scope: !919, inlinedAt: !926)
!988 = !DILocation(line: 175, column: 25, scope: !919, inlinedAt: !926)
!989 = !DILocation(line: 175, column: 23, scope: !919, inlinedAt: !926)
!990 = !DILocation(line: 176, column: 13, scope: !919, inlinedAt: !926)
!991 = !DILocation(line: 177, column: 15, scope: !992, inlinedAt: !926)
!992 = distinct !DILexicalBlock(scope: !921, file: !3, line: 177, column: 15)
!993 = !DILocation(line: 177, column: 15, scope: !921, inlinedAt: !926)
!994 = !DILocation(line: 179, column: 15, scope: !995, inlinedAt: !926)
!995 = distinct !DILexicalBlock(scope: !992, file: !3, line: 178, column: 13)
!996 = !DILocation(line: 181, column: 15, scope: !995, inlinedAt: !926)
!997 = !DILocation(line: 0, scope: !917, inlinedAt: !926)
!998 = !DILocation(line: 187, column: 7, scope: !901, inlinedAt: !926)
!999 = !DILocation(line: 190, column: 7, scope: !1000, inlinedAt: !926)
!1000 = distinct !DILexicalBlock(scope: !901, file: !3, line: 190, column: 7)
!1001 = !DILocation(line: 190, column: 29, scope: !1000, inlinedAt: !926)
!1002 = !DILocation(line: 190, column: 7, scope: !901, inlinedAt: !926)
!1003 = !DILocation(line: 192, column: 7, scope: !1004, inlinedAt: !926)
!1004 = distinct !DILexicalBlock(scope: !1000, file: !3, line: 191, column: 5)
!1005 = !DILocation(line: 194, column: 7, scope: !1004, inlinedAt: !926)
!1006 = !DILocation(line: 198, column: 1, scope: !901, inlinedAt: !926)
!1007 = !DILocation(line: 374, column: 18, scope: !927)
!1008 = !DILocation(line: 375, column: 15, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !927, file: !3, line: 375, column: 15)
!1010 = !DILocation(line: 375, column: 26, scope: !1009)
!1011 = !DILocation(line: 375, column: 15, scope: !927)
!1012 = !DILocation(line: 377, column: 15, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 376, column: 13)
!1014 = !DILocation(line: 379, column: 13, scope: !1013)
!1015 = !DILocation(line: 0, scope: !890)
!1016 = !DILocation(line: 356, column: 48, scope: !754)
!1017 = distinct !{!1017, !884, !1018, !536}
!1018 = !DILocation(line: 381, column: 5, scope: !751)
!1019 = !DISubprogram(name: "bindtextdomain", scope: !559, file: !559, line: 86, type: !1020, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !483)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!51, !57, !57}
!1022 = !DISubprogram(name: "textdomain", scope: !559, file: !559, line: 82, type: !681, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !483)
!1023 = !DISubprogram(name: "atexit", scope: !680, file: !680, line: 602, type: !1024, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !483)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!44, !217}
!1026 = !DISubprogram(name: "getopt_long", scope: !157, file: !157, line: 66, type: !1027, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !483)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!44, !44, !1029, !57, !1031, !162}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!1032 = !DISubprogram(name: "stat", scope: !1033, file: !1033, line: 205, type: !1034, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !483)
!1033 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "1e5cd132abb12ea0c79aeae3bfa4573e")
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!44, !565, !1036}
!1036 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1037)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!1038 = !DISubprogram(name: "open", scope: !1039, file: !1039, line: 181, type: !1040, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !483)
!1039 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!44, !57, !44, null}
!1042 = !DISubprogram(name: "lseek", scope: !1043, file: !1043, line: 339, type: !1044, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !483)
!1043 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!48, !44, !48, !44}
!1046 = !DISubprogram(name: "close", scope: !1043, file: !1043, line: 358, type: !1047, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !483)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!44, !44}
!1049 = !DISubprogram(name: "fstat", scope: !1033, file: !1033, line: 210, type: !1050, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !483)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!44, !44, !1037}
!1052 = !DISubprogram(name: "ftruncate", scope: !1043, file: !1043, line: 1049, type: !1053, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !483)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!44, !44, !48}
!1055 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !176, file: !176, line: 50, type: !497, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !175, retainedNodes: !1056)
!1056 = !{!1057}
!1057 = !DILocalVariable(name: "file", arg: 1, scope: !1055, file: !176, line: 50, type: !57)
!1058 = !DILocation(line: 0, scope: !1055)
!1059 = !DILocation(line: 52, column: 13, scope: !1055)
!1060 = !DILocation(line: 53, column: 1, scope: !1055)
!1061 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !176, file: !176, line: 87, type: !1062, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !175, retainedNodes: !1064)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{null, !60}
!1064 = !{!1065}
!1065 = !DILocalVariable(name: "ignore", arg: 1, scope: !1061, file: !176, line: 87, type: !60)
!1066 = !DILocation(line: 0, scope: !1061)
!1067 = !DILocation(line: 89, column: 16, scope: !1061)
!1068 = !{!1069, !1069, i64 0}
!1069 = !{!"_Bool", !476, i64 0}
!1070 = !DILocation(line: 90, column: 1, scope: !1061)
!1071 = distinct !DISubprogram(name: "close_stdout", scope: !176, file: !176, line: 116, type: !218, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !175, retainedNodes: !1072)
!1072 = !{!1073}
!1073 = !DILocalVariable(name: "write_error", scope: !1074, file: !176, line: 121, type: !57)
!1074 = distinct !DILexicalBlock(scope: !1075, file: !176, line: 120, column: 5)
!1075 = distinct !DILexicalBlock(scope: !1071, file: !176, line: 118, column: 7)
!1076 = !DILocation(line: 118, column: 21, scope: !1075)
!1077 = !DILocation(line: 118, column: 7, scope: !1075)
!1078 = !DILocation(line: 118, column: 29, scope: !1075)
!1079 = !DILocation(line: 119, column: 7, scope: !1075)
!1080 = !DILocation(line: 119, column: 12, scope: !1075)
!1081 = !{i8 0, i8 2}
!1082 = !DILocation(line: 119, column: 25, scope: !1075)
!1083 = !DILocation(line: 119, column: 28, scope: !1075)
!1084 = !DILocation(line: 119, column: 34, scope: !1075)
!1085 = !DILocation(line: 118, column: 7, scope: !1071)
!1086 = !DILocation(line: 121, column: 33, scope: !1074)
!1087 = !DILocation(line: 0, scope: !1074)
!1088 = !DILocation(line: 122, column: 11, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1074, file: !176, line: 122, column: 11)
!1090 = !DILocation(line: 0, scope: !1089)
!1091 = !DILocation(line: 122, column: 11, scope: !1074)
!1092 = !DILocation(line: 123, column: 9, scope: !1089)
!1093 = !DILocation(line: 126, column: 9, scope: !1089)
!1094 = !DILocation(line: 128, column: 14, scope: !1074)
!1095 = !DILocation(line: 128, column: 7, scope: !1074)
!1096 = !DILocation(line: 133, column: 42, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1071, file: !176, line: 133, column: 7)
!1098 = !DILocation(line: 133, column: 28, scope: !1097)
!1099 = !DILocation(line: 133, column: 50, scope: !1097)
!1100 = !DILocation(line: 133, column: 7, scope: !1071)
!1101 = !DILocation(line: 134, column: 12, scope: !1097)
!1102 = !DILocation(line: 134, column: 5, scope: !1097)
!1103 = !DILocation(line: 135, column: 1, scope: !1071)
!1104 = distinct !DISubprogram(name: "verror", scope: !183, file: !183, line: 251, type: !1105, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !182, retainedNodes: !1107)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{null, !44, !44, !57, !191}
!1107 = !{!1108, !1109, !1110, !1111}
!1108 = !DILocalVariable(name: "status", arg: 1, scope: !1104, file: !183, line: 251, type: !44)
!1109 = !DILocalVariable(name: "errnum", arg: 2, scope: !1104, file: !183, line: 251, type: !44)
!1110 = !DILocalVariable(name: "message", arg: 3, scope: !1104, file: !183, line: 251, type: !57)
!1111 = !DILocalVariable(name: "args", arg: 4, scope: !1104, file: !183, line: 251, type: !191)
!1112 = !DILocation(line: 0, scope: !1104)
!1113 = !DILocation(line: 251, column: 1, scope: !1104)
!1114 = !DILocation(line: 261, column: 3, scope: !1104)
!1115 = !DILocation(line: 265, column: 7, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1104, file: !183, line: 265, column: 7)
!1117 = !DILocation(line: 265, column: 7, scope: !1104)
!1118 = !DILocation(line: 266, column: 5, scope: !1116)
!1119 = !DILocation(line: 272, column: 7, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1116, file: !183, line: 268, column: 5)
!1121 = !DILocation(line: 276, column: 3, scope: !1104)
!1122 = !{i64 0, i64 8, !474, i64 8, i64 8, !474, i64 16, i64 8, !474, i64 24, i64 4, !569, i64 28, i64 4, !569}
!1123 = !DILocation(line: 282, column: 1, scope: !1104)
!1124 = distinct !DISubprogram(name: "flush_stdout", scope: !183, file: !183, line: 163, type: !218, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !182, retainedNodes: !1125)
!1125 = !{!1126}
!1126 = !DILocalVariable(name: "stdout_fd", scope: !1124, file: !183, line: 166, type: !44)
!1127 = !DILocation(line: 0, scope: !1124)
!1128 = !DILocalVariable(name: "fd", arg: 1, scope: !1129, file: !183, line: 145, type: !44)
!1129 = distinct !DISubprogram(name: "is_open", scope: !183, file: !183, line: 145, type: !1047, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !182, retainedNodes: !1130)
!1130 = !{!1128}
!1131 = !DILocation(line: 0, scope: !1129, inlinedAt: !1132)
!1132 = distinct !DILocation(line: 182, column: 25, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1124, file: !183, line: 182, column: 7)
!1134 = !DILocation(line: 157, column: 15, scope: !1129, inlinedAt: !1132)
!1135 = !DILocation(line: 182, column: 25, scope: !1133)
!1136 = !DILocation(line: 182, column: 7, scope: !1124)
!1137 = !DILocation(line: 184, column: 5, scope: !1133)
!1138 = !DILocation(line: 185, column: 1, scope: !1124)
!1139 = distinct !DISubprogram(name: "error_tail", scope: !183, file: !183, line: 219, type: !1105, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !182, retainedNodes: !1140)
!1140 = !{!1141, !1142, !1143, !1144}
!1141 = !DILocalVariable(name: "status", arg: 1, scope: !1139, file: !183, line: 219, type: !44)
!1142 = !DILocalVariable(name: "errnum", arg: 2, scope: !1139, file: !183, line: 219, type: !44)
!1143 = !DILocalVariable(name: "message", arg: 3, scope: !1139, file: !183, line: 219, type: !57)
!1144 = !DILocalVariable(name: "args", arg: 4, scope: !1139, file: !183, line: 219, type: !191)
!1145 = !DILocation(line: 0, scope: !1139)
!1146 = !DILocation(line: 219, column: 1, scope: !1139)
!1147 = !DILocation(line: 229, column: 13, scope: !1139)
!1148 = !DILocation(line: 229, column: 3, scope: !1139)
!1149 = !DILocalVariable(name: "__stream", arg: 1, scope: !1150, file: !1151, line: 132, type: !1154)
!1150 = distinct !DISubprogram(name: "vfprintf", scope: !1151, file: !1151, line: 132, type: !1152, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !182, retainedNodes: !1189)
!1151 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!44, !1154, !565, !192}
!1154 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1155)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !98, line: 7, baseType: !1157)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !100, line: 49, size: 1728, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1157, file: !100, line: 51, baseType: !44, size: 32)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1157, file: !100, line: 54, baseType: !51, size: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1157, file: !100, line: 55, baseType: !51, size: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1157, file: !100, line: 56, baseType: !51, size: 64, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1157, file: !100, line: 57, baseType: !51, size: 64, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1157, file: !100, line: 58, baseType: !51, size: 64, offset: 320)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1157, file: !100, line: 59, baseType: !51, size: 64, offset: 384)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1157, file: !100, line: 60, baseType: !51, size: 64, offset: 448)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1157, file: !100, line: 61, baseType: !51, size: 64, offset: 512)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1157, file: !100, line: 64, baseType: !51, size: 64, offset: 576)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1157, file: !100, line: 65, baseType: !51, size: 64, offset: 640)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1157, file: !100, line: 66, baseType: !51, size: 64, offset: 704)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1157, file: !100, line: 68, baseType: !115, size: 64, offset: 768)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1157, file: !100, line: 70, baseType: !1173, size: 64, offset: 832)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1157, file: !100, line: 72, baseType: !44, size: 32, offset: 896)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1157, file: !100, line: 73, baseType: !44, size: 32, offset: 928)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1157, file: !100, line: 74, baseType: !48, size: 64, offset: 960)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1157, file: !100, line: 77, baseType: !45, size: 16, offset: 1024)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1157, file: !100, line: 78, baseType: !124, size: 8, offset: 1040)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1157, file: !100, line: 79, baseType: !126, size: 8, offset: 1048)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1157, file: !100, line: 81, baseType: !130, size: 64, offset: 1088)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1157, file: !100, line: 89, baseType: !133, size: 64, offset: 1152)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1157, file: !100, line: 91, baseType: !135, size: 64, offset: 1216)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1157, file: !100, line: 92, baseType: !138, size: 64, offset: 1280)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1157, file: !100, line: 93, baseType: !1173, size: 64, offset: 1344)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1157, file: !100, line: 94, baseType: !53, size: 64, offset: 1408)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1157, file: !100, line: 95, baseType: !54, size: 64, offset: 1472)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1157, file: !100, line: 96, baseType: !44, size: 32, offset: 1536)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1157, file: !100, line: 98, baseType: !145, size: 160, offset: 1568)
!1189 = !{!1149, !1190, !1191}
!1190 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1150, file: !1151, line: 133, type: !565)
!1191 = !DILocalVariable(name: "__ap", arg: 3, scope: !1150, file: !1151, line: 133, type: !192)
!1192 = !DILocation(line: 0, scope: !1150, inlinedAt: !1193)
!1193 = distinct !DILocation(line: 229, column: 3, scope: !1139)
!1194 = !DILocation(line: 135, column: 10, scope: !1150, inlinedAt: !1193)
!1195 = !{!1196, !1198}
!1196 = distinct !{!1196, !1197, !"vfprintf.inline: argument 0"}
!1197 = distinct !{!1197, !"vfprintf.inline"}
!1198 = distinct !{!1198, !1197, !"vfprintf.inline: argument 1"}
!1199 = !DILocation(line: 232, column: 3, scope: !1139)
!1200 = !DILocation(line: 233, column: 7, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1139, file: !183, line: 233, column: 7)
!1202 = !DILocation(line: 233, column: 7, scope: !1139)
!1203 = !DILocalVariable(name: "errnum", arg: 1, scope: !1204, file: !183, line: 188, type: !44)
!1204 = distinct !DISubprogram(name: "print_errno_message", scope: !183, file: !183, line: 188, type: !464, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !182, retainedNodes: !1205)
!1205 = !{!1203, !1206, !1207}
!1206 = !DILocalVariable(name: "s", scope: !1204, file: !183, line: 190, type: !57)
!1207 = !DILocalVariable(name: "errbuf", scope: !1204, file: !183, line: 193, type: !1208)
!1208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 8192, elements: !1209)
!1209 = !{!1210}
!1210 = !DISubrange(count: 1024)
!1211 = !DILocation(line: 0, scope: !1204, inlinedAt: !1212)
!1212 = distinct !DILocation(line: 234, column: 5, scope: !1201)
!1213 = !DILocation(line: 193, column: 3, scope: !1204, inlinedAt: !1212)
!1214 = !DILocation(line: 193, column: 8, scope: !1204, inlinedAt: !1212)
!1215 = !DILocation(line: 195, column: 7, scope: !1204, inlinedAt: !1212)
!1216 = !DILocation(line: 207, column: 9, scope: !1217, inlinedAt: !1212)
!1217 = distinct !DILexicalBlock(scope: !1204, file: !183, line: 207, column: 7)
!1218 = !DILocation(line: 207, column: 7, scope: !1204, inlinedAt: !1212)
!1219 = !DILocation(line: 208, column: 9, scope: !1217, inlinedAt: !1212)
!1220 = !DILocation(line: 208, column: 5, scope: !1217, inlinedAt: !1212)
