; ModuleID = 'src/id.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [USER]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [108 x i8] c"Print user and group information for each specified USER,\0Aor (when USER omitted) for the current process.\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"id\00", align 1

!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !28, line: 46, baseType: !29)
!28 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!29 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !34, line: 102, baseType: !35)
!34 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !36, line: 73, baseType: !29)
!36 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!37 = !{!38, !43, !45, !49, !51, !0, !137, !139, !141, !143, !145, !147, !149, !151, !153, !155}
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "ruid", scope: !2, file: !3, line: 62, type: !40, isLocal: true, isDefinition: true)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !41, line: 79, baseType: !42)
!41 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !36, line: 146, baseType: !7)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "euid", scope: !2, file: !3, line: 62, type: !40, isLocal: true, isDefinition: true)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "rgid", scope: !2, file: !3, line: 63, type: !47, isLocal: true, isDefinition: true)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !41, line: 64, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !36, line: 147, baseType: !7)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "egid", scope: !2, file: !3, line: 63, type: !47, isLocal: true, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !53, file: !54, line: 575, type: !25, isLocal: true, isDefinition: true)
!53 = distinct !DISubprogram(name: "oputs_", scope: !54, file: !54, line: 573, type: !55, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !57)
!54 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!55 = !DISubroutineType(types: !56)
!56 = !{null, !30, !30}
!57 = !{!58, !59, !60, !63, !65, !66, !67, !71, !72, !73, !74, !76, !131, !132, !133, !135, !136}
!58 = !DILocalVariable(name: "program", arg: 1, scope: !53, file: !54, line: 573, type: !30)
!59 = !DILocalVariable(name: "option", arg: 2, scope: !53, file: !54, line: 573, type: !30)
!60 = !DILocalVariable(name: "term", scope: !61, file: !54, line: 585, type: !30)
!61 = distinct !DILexicalBlock(scope: !62, file: !54, line: 582, column: 5)
!62 = distinct !DILexicalBlock(scope: !53, file: !54, line: 581, column: 7)
!63 = !DILocalVariable(name: "double_space", scope: !53, file: !54, line: 594, type: !64)
!64 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!65 = !DILocalVariable(name: "first_word", scope: !53, file: !54, line: 595, type: !30)
!66 = !DILocalVariable(name: "option_text", scope: !53, file: !54, line: 596, type: !30)
!67 = !DILocalVariable(name: "s", scope: !68, file: !54, line: 608, type: !30)
!68 = distinct !DILexicalBlock(scope: !69, file: !54, line: 605, column: 5)
!69 = distinct !DILexicalBlock(scope: !70, file: !54, line: 604, column: 12)
!70 = distinct !DILexicalBlock(scope: !53, file: !54, line: 597, column: 7)
!71 = !DILocalVariable(name: "spaces", scope: !68, file: !54, line: 609, type: !27)
!72 = !DILocalVariable(name: "anchor_len", scope: !53, file: !54, line: 620, type: !27)
!73 = !DILocalVariable(name: "desc_text", scope: !53, file: !54, line: 625, type: !30)
!74 = !DILocalVariable(name: "__ptr", scope: !75, file: !54, line: 644, type: !30)
!75 = distinct !DILexicalBlock(scope: !53, file: !54, line: 644, column: 3)
!76 = !DILocalVariable(name: "__stream", scope: !75, file: !54, line: 644, type: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !79, line: 7, baseType: !80)
!79 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !81, line: 49, size: 1728, elements: !82)
!81 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !98, !100, !101, !102, !105, !106, !108, !112, !115, !117, !120, !123, !124, !125, !126, !127}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !80, file: !81, line: 51, baseType: !25, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !80, file: !81, line: 54, baseType: !22, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !80, file: !81, line: 55, baseType: !22, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !80, file: !81, line: 56, baseType: !22, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !80, file: !81, line: 57, baseType: !22, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !80, file: !81, line: 58, baseType: !22, size: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !80, file: !81, line: 59, baseType: !22, size: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !80, file: !81, line: 60, baseType: !22, size: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !80, file: !81, line: 61, baseType: !22, size: 64, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !80, file: !81, line: 64, baseType: !22, size: 64, offset: 576)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !80, file: !81, line: 65, baseType: !22, size: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !80, file: !81, line: 66, baseType: !22, size: 64, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !80, file: !81, line: 68, baseType: !96, size: 64, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !81, line: 36, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !80, file: !81, line: 70, baseType: !99, size: 64, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !80, file: !81, line: 72, baseType: !25, size: 32, offset: 896)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !80, file: !81, line: 73, baseType: !25, size: 32, offset: 928)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !80, file: !81, line: 74, baseType: !103, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !36, line: 152, baseType: !104)
!104 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !80, file: !81, line: 77, baseType: !26, size: 16, offset: 1024)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !80, file: !81, line: 78, baseType: !107, size: 8, offset: 1040)
!107 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !80, file: !81, line: 79, baseType: !109, size: 8, offset: 1048)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 1)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !80, file: !81, line: 81, baseType: !113, size: 64, offset: 1088)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !81, line: 43, baseType: null)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !80, file: !81, line: 89, baseType: !116, size: 64, offset: 1152)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !36, line: 153, baseType: !104)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !80, file: !81, line: 91, baseType: !118, size: 64, offset: 1216)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !81, line: 37, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !80, file: !81, line: 92, baseType: !121, size: 64, offset: 1280)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !81, line: 38, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !80, file: !81, line: 93, baseType: !99, size: 64, offset: 1344)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !80, file: !81, line: 94, baseType: !24, size: 64, offset: 1408)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !80, file: !81, line: 95, baseType: !27, size: 64, offset: 1472)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !80, file: !81, line: 96, baseType: !25, size: 32, offset: 1536)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !80, file: !81, line: 98, baseType: !128, size: 160, offset: 1568)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 160, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 20)
!131 = !DILocalVariable(name: "__cnt", scope: !75, file: !54, line: 644, type: !27)
!132 = !DILocalVariable(name: "url_program", scope: !53, file: !54, line: 648, type: !30)
!133 = !DILocalVariable(name: "__ptr", scope: !134, file: !54, line: 686, type: !30)
!134 = distinct !DILexicalBlock(scope: !53, file: !54, line: 686, column: 3)
!135 = !DILocalVariable(name: "__stream", scope: !134, file: !54, line: 686, type: !77)
!136 = !DILocalVariable(name: "__cnt", scope: !134, file: !54, line: 686, type: !27)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "just_context", scope: !2, file: !3, line: 43, type: !64, isLocal: true, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "just_group", scope: !2, file: !3, line: 49, type: !64, isLocal: true, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "use_name", scope: !2, file: !3, line: 59, type: !64, isLocal: true, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "use_real", scope: !2, file: !3, line: 51, type: !64, isLocal: true, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "just_user", scope: !2, file: !3, line: 53, type: !64, isLocal: true, isDefinition: true)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "opt_zero", scope: !2, file: !3, line: 45, type: !64, isLocal: true, isDefinition: true)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "just_group_list", scope: !2, file: !3, line: 47, type: !64, isLocal: true, isDefinition: true)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "context", scope: !2, file: !3, line: 67, type: !22, isLocal: true, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "multiple_users", scope: !2, file: !3, line: 57, type: !64, isLocal: true, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "ok", scope: !2, file: !3, line: 55, type: !64, isLocal: true, isDefinition: true)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 2560, elements: !167)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !160, line: 50, size: 256, elements: !161)
!160 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!161 = !{!162, !163, !164, !166}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !159, file: !160, line: 52, baseType: !30, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !159, file: !160, line: 55, baseType: !25, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !159, file: !160, line: 56, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !159, file: !160, line: 57, baseType: !25, size: 32, offset: 192)
!167 = !{!168}
!168 = !DISubrange(count: 10)
!169 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!170 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!171 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!172 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!173 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!174 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "Version", scope: !177, file: !178, line: 3, type: !30, isLocal: false, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !179, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!179 = !{!175}
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "file_name", scope: !182, file: !183, line: 45, type: !30, isLocal: true, isDefinition: true)
!182 = distinct !DICompileUnit(language: DW_LANG_C99, file: !183, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !184, splitDebugInlining: false, nameTableKind: None)
!183 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!184 = !{!180, !185}
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !182, file: !183, line: 55, type: !64, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !189, file: !190, line: 66, type: !225, isLocal: false, isDefinition: true)
!189 = distinct !DICompileUnit(language: DW_LANG_C99, file: !190, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !191, globals: !192, splitDebugInlining: false, nameTableKind: None)
!190 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!191 = !{!24, !32}
!192 = !{!193, !219, !187, !221, !223}
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "old_file_name", scope: !195, file: !190, line: 304, type: !30, isLocal: true, isDefinition: true)
!195 = distinct !DISubprogram(name: "verror_at_line", scope: !190, file: !190, line: 298, type: !196, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !189, retainedNodes: !212)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !25, !25, !30, !7, !30, !198}
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !199, line: 52, baseType: !200)
!199 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !201, line: 32, baseType: !202)
!201 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !203, baseType: !204)
!203 = !DIFile(filename: "lib/error.c", directory: "/src")
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !205, size: 256, elements: !206)
!205 = !DINamespace(name: "std", scope: null)
!206 = !{!207, !208, !209, !210, !211}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !204, file: !203, baseType: !24, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !204, file: !203, baseType: !24, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !204, file: !203, baseType: !24, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !204, file: !203, baseType: !25, size: 32, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !204, file: !203, baseType: !25, size: 32, offset: 224)
!212 = !{!213, !214, !215, !216, !217, !218}
!213 = !DILocalVariable(name: "status", arg: 1, scope: !195, file: !190, line: 298, type: !25)
!214 = !DILocalVariable(name: "errnum", arg: 2, scope: !195, file: !190, line: 298, type: !25)
!215 = !DILocalVariable(name: "file_name", arg: 3, scope: !195, file: !190, line: 298, type: !30)
!216 = !DILocalVariable(name: "line_number", arg: 4, scope: !195, file: !190, line: 298, type: !7)
!217 = !DILocalVariable(name: "message", arg: 5, scope: !195, file: !190, line: 298, type: !30)
!218 = !DILocalVariable(name: "args", arg: 6, scope: !195, file: !190, line: 298, type: !198)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "old_line_number", scope: !195, file: !190, line: 305, type: !7, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "error_message_count", scope: !189, file: !190, line: 69, type: !7, isLocal: false, isDefinition: true)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !189, file: !190, line: 295, type: !25, isLocal: false, isDefinition: true)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{null}
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "program_name", scope: !230, file: !231, line: 31, type: !30, isLocal: false, isDefinition: true)
!230 = distinct !DICompileUnit(language: DW_LANG_C99, file: !231, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !232, globals: !233, splitDebugInlining: false, nameTableKind: None)
!231 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!232 = !{!22}
!233 = !{!228}
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "utf07FF", scope: !236, file: !237, line: 46, type: !267, isLocal: true, isDefinition: true)
!236 = distinct !DISubprogram(name: "proper_name_lite", scope: !237, file: !237, line: 38, type: !238, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !240, retainedNodes: !242)
!237 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!238 = !DISubroutineType(types: !239)
!239 = !{!30, !30, !30}
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !237, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !241, splitDebugInlining: false, nameTableKind: None)
!241 = !{!234}
!242 = !{!243, !244, !245, !246, !251}
!243 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !236, file: !237, line: 38, type: !30)
!244 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !236, file: !237, line: 38, type: !30)
!245 = !DILocalVariable(name: "translation", scope: !236, file: !237, line: 40, type: !30)
!246 = !DILocalVariable(name: "w", scope: !236, file: !237, line: 47, type: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !248, line: 37, baseType: !249)
!248 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !36, line: 57, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !36, line: 42, baseType: !7)
!251 = !DILocalVariable(name: "mbs", scope: !236, file: !237, line: 48, type: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !253, line: 6, baseType: !254)
!253 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !255, line: 21, baseType: !256)
!255 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !255, line: 13, size: 64, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !256, file: !255, line: 15, baseType: !25, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !256, file: !255, line: 20, baseType: !260, size: 32, offset: 32)
!260 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !256, file: !255, line: 16, size: 32, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !260, file: !255, line: 18, baseType: !7, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !260, file: !255, line: 19, baseType: !264, size: 32)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 32, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 4)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 16, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 2)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !272, file: !273, line: 76, type: !353, isLocal: false, isDefinition: true)
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !274, retainedTypes: !294, globals: !295, splitDebugInlining: false, nameTableKind: None)
!273 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!274 = !{!275, !289, !5}
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !276, line: 42, baseType: !7, size: 32, elements: !277)
!276 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!278 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!279 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!280 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!281 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!282 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!283 = !DIEnumerator(name: "c_quoting_style", value: 5)
!284 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!285 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!286 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!287 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!288 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !276, line: 254, baseType: !7, size: 32, elements: !290)
!290 = !{!291, !292, !293}
!291 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!292 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!293 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!294 = !{!25, !26, !27}
!295 = !{!270, !296, !300, !312, !314, !319, !342, !349, !351}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !272, file: !273, line: 92, type: !298, isLocal: false, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 320, elements: !167)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !272, file: !273, line: 1040, type: !302, isLocal: false, isDefinition: true)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !273, line: 56, size: 448, elements: !303)
!303 = !{!304, !305, !306, !310, !311}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !302, file: !273, line: 59, baseType: !275, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !302, file: !273, line: 62, baseType: !25, size: 32, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !302, file: !273, line: 66, baseType: !307, size: 256, offset: 64)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 8)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !302, file: !273, line: 69, baseType: !30, size: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !302, file: !273, line: 72, baseType: !30, size: 64, offset: 384)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !272, file: !273, line: 107, type: !302, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "slot0", scope: !272, file: !273, line: 831, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2048, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 256)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "quote", scope: !321, file: !273, line: 228, type: !340, isLocal: true, isDefinition: true)
!321 = distinct !DISubprogram(name: "gettext_quote", scope: !273, file: !273, line: 197, type: !322, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !272, retainedNodes: !324)
!322 = !DISubroutineType(types: !323)
!323 = !{!30, !30, !275}
!324 = !{!325, !326, !327, !328, !329}
!325 = !DILocalVariable(name: "msgid", arg: 1, scope: !321, file: !273, line: 197, type: !30)
!326 = !DILocalVariable(name: "s", arg: 2, scope: !321, file: !273, line: 197, type: !275)
!327 = !DILocalVariable(name: "translation", scope: !321, file: !273, line: 199, type: !30)
!328 = !DILocalVariable(name: "w", scope: !321, file: !273, line: 229, type: !247)
!329 = !DILocalVariable(name: "mbs", scope: !321, file: !273, line: 230, type: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !253, line: 6, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !255, line: 21, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !255, line: 13, size: 64, elements: !333)
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !332, file: !255, line: 15, baseType: !25, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !332, file: !255, line: 20, baseType: !336, size: 32, offset: 32)
!336 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !332, file: !255, line: 16, size: 32, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !336, file: !255, line: 18, baseType: !7, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !336, file: !255, line: 19, baseType: !264, size: 32)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 64, elements: !341)
!341 = !{!269, !266}
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "slotvec", scope: !272, file: !273, line: 834, type: !344, isLocal: true, isDefinition: true)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !273, line: 823, size: 128, elements: !346)
!346 = !{!347, !348}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !345, file: !273, line: 825, baseType: !27, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !345, file: !273, line: 826, baseType: !22, size: 64, offset: 64)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "nslots", scope: !272, file: !273, line: 832, type: !25, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "slotvec0", scope: !272, file: !273, line: 833, type: !345, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 704, elements: !355)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!355 = !{!356}
!356 = !DISubrange(count: 11)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !359, file: !360, line: 26, type: !362, isLocal: false, isDefinition: true)
!359 = distinct !DICompileUnit(language: DW_LANG_C99, file: !360, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !361, splitDebugInlining: false, nameTableKind: None)
!360 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!361 = !{!357}
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 376, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 47)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "exit_failure", scope: !367, file: !368, line: 24, type: !370, isLocal: false, isDefinition: true)
!367 = distinct !DICompileUnit(language: DW_LANG_C99, file: !368, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !369, splitDebugInlining: false, nameTableKind: None)
!368 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!369 = !{!365}
!370 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !25)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "internal_state", scope: !373, file: !374, line: 97, type: !377, isLocal: true, isDefinition: true)
!373 = distinct !DICompileUnit(language: DW_LANG_C99, file: !374, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !375, globals: !376, splitDebugInlining: false, nameTableKind: None)
!374 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!375 = !{!24, !27, !32}
!376 = !{!371}
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !253, line: 6, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !255, line: 21, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !255, line: 13, size: 64, elements: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !379, file: !255, line: 15, baseType: !25, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !379, file: !255, line: 20, baseType: !383, size: 32, offset: 32)
!383 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !379, file: !255, line: 16, size: 32, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !383, file: !255, line: 18, baseType: !7, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !383, file: !255, line: 19, baseType: !264, size: 32)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !389, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "src/group-list.c", directory: "/src", checksumkind: CSK_MD5, checksum: "86bc740edd29a2e1277335d35d8d331e")
!389 = !{!24, !33, !32}
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!391 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!392 = distinct !DICompileUnit(language: DW_LANG_C99, file: !393, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!393 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !396, retainedTypes: !405, splitDebugInlining: false, nameTableKind: None)
!395 = !DIFile(filename: "lib/userspec.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9b1d112c5d74602907b912457199dc83")
!396 = !{!397}
!397 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !398, line: 30, baseType: !7, size: 32, elements: !399)
!398 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!399 = !{!400, !401, !402, !403, !404}
!400 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!401 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!402 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!403 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!404 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!405 = !{!24, !40, !47}
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !408, retainedTypes: !412, splitDebugInlining: false, nameTableKind: None)
!407 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!408 = !{!409}
!409 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !407, line: 40, baseType: !7, size: 32, elements: !410)
!410 = !{!411}
!411 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!412 = !{!24}
!413 = distinct !DICompileUnit(language: DW_LANG_C99, file: !414, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !415, retainedTypes: !446, splitDebugInlining: false, nameTableKind: None)
!414 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!415 = !{!416, !428}
!416 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !417, file: !414, line: 188, baseType: !7, size: 32, elements: !426)
!417 = distinct !DISubprogram(name: "x2nrealloc", scope: !414, file: !414, line: 176, type: !418, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !413, retainedNodes: !421)
!418 = !DISubroutineType(types: !419)
!419 = !{!24, !24, !420, !27}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!421 = !{!422, !423, !424, !425}
!422 = !DILocalVariable(name: "p", arg: 1, scope: !417, file: !414, line: 176, type: !24)
!423 = !DILocalVariable(name: "pn", arg: 2, scope: !417, file: !414, line: 176, type: !420)
!424 = !DILocalVariable(name: "s", arg: 3, scope: !417, file: !414, line: 176, type: !27)
!425 = !DILocalVariable(name: "n", scope: !417, file: !414, line: 178, type: !27)
!426 = !{!427}
!427 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!428 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !429, file: !414, line: 228, baseType: !7, size: 32, elements: !426)
!429 = distinct !DISubprogram(name: "xpalloc", scope: !414, file: !414, line: 223, type: !430, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !413, retainedNodes: !436)
!430 = !DISubroutineType(types: !431)
!431 = !{!24, !24, !432, !433, !435, !433}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !434, line: 130, baseType: !435)
!434 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !28, line: 35, baseType: !104)
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445}
!437 = !DILocalVariable(name: "pa", arg: 1, scope: !429, file: !414, line: 223, type: !24)
!438 = !DILocalVariable(name: "pn", arg: 2, scope: !429, file: !414, line: 223, type: !432)
!439 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !429, file: !414, line: 223, type: !433)
!440 = !DILocalVariable(name: "n_max", arg: 4, scope: !429, file: !414, line: 223, type: !435)
!441 = !DILocalVariable(name: "s", arg: 5, scope: !429, file: !414, line: 223, type: !433)
!442 = !DILocalVariable(name: "n0", scope: !429, file: !414, line: 230, type: !433)
!443 = !DILocalVariable(name: "n", scope: !429, file: !414, line: 237, type: !433)
!444 = !DILocalVariable(name: "nbytes", scope: !429, file: !414, line: 248, type: !433)
!445 = !DILocalVariable(name: "adjusted_nbytes", scope: !429, file: !414, line: 252, type: !433)
!446 = !{!22, !24, !64, !104, !29}
!447 = distinct !DICompileUnit(language: DW_LANG_C99, file: !448, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!448 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!449 = distinct !DICompileUnit(language: DW_LANG_C99, file: !450, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!450 = !DIFile(filename: "lib/xgetgroups.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b5210c3f5d54a118d66836a8f2f46b25")
!451 = distinct !DICompileUnit(language: DW_LANG_C99, file: !452, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !453, retainedTypes: !454, splitDebugInlining: false, nameTableKind: None)
!452 = !DIFile(filename: "lib/xstrtoul.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2b318e5928e8382cfa3ae094c8d00222")
!453 = !{!397, !5}
!454 = !{!25, !26, !22, !64, !29}
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!456 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!457 = distinct !DICompileUnit(language: DW_LANG_C99, file: !458, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!458 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !412, splitDebugInlining: false, nameTableKind: None)
!460 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !412, splitDebugInlining: false, nameTableKind: None)
!462 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!463 = distinct !DICompileUnit(language: DW_LANG_C99, file: !464, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !465, splitDebugInlining: false, nameTableKind: None)
!464 = !DIFile(filename: "lib/umaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "afa759af6e92fed26f32f683da6c23a8")
!465 = !{!33}
!466 = distinct !DICompileUnit(language: DW_LANG_C99, file: !467, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !468, retainedTypes: !503, splitDebugInlining: false, nameTableKind: None)
!467 = !DIFile(filename: "lib/mgetgroups.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c6d0df677a26dbd2695c193e3d6de3d1")
!468 = !{!469}
!469 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !470, file: !467, line: 79, baseType: !7, size: 32, elements: !501)
!470 = distinct !DISubprogram(name: "mgetgroups", scope: !467, file: !467, line: 66, type: !471, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !466, retainedNodes: !475)
!471 = !DISubroutineType(types: !472)
!472 = !{!25, !30, !47, !473}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!475 = !{!476, !477, !478, !479, !482, !483, !485, !486, !487, !488, !493, !494, !495, !498, !499}
!476 = !DILocalVariable(name: "username", arg: 1, scope: !470, file: !467, line: 66, type: !30)
!477 = !DILocalVariable(name: "gid", arg: 2, scope: !470, file: !467, line: 66, type: !47)
!478 = !DILocalVariable(name: "groups", arg: 3, scope: !470, file: !467, line: 66, type: !473)
!479 = !DILocalVariable(name: "max_n_groups", scope: !480, file: !467, line: 80, type: !25)
!480 = distinct !DILexicalBlock(scope: !481, file: !467, line: 78, column: 5)
!481 = distinct !DILexicalBlock(scope: !470, file: !467, line: 77, column: 7)
!482 = !DILocalVariable(name: "g", scope: !480, file: !467, line: 82, type: !474)
!483 = !DILocalVariable(name: "last_n_groups", scope: !484, file: !467, line: 88, type: !25)
!484 = distinct !DILexicalBlock(scope: !480, file: !467, line: 87, column: 9)
!485 = !DILocalVariable(name: "ng", scope: !484, file: !467, line: 91, type: !25)
!486 = !DILocalVariable(name: "h", scope: !484, file: !467, line: 98, type: !474)
!487 = !DILocalVariable(name: "max_n_groups", scope: !470, file: !467, line: 118, type: !25)
!488 = !DILocalVariable(name: "g", scope: !489, file: !467, line: 129, type: !474)
!489 = distinct !DILexicalBlock(scope: !490, file: !467, line: 128, column: 9)
!490 = distinct !DILexicalBlock(scope: !491, file: !467, line: 127, column: 11)
!491 = distinct !DILexicalBlock(scope: !492, file: !467, line: 126, column: 5)
!492 = distinct !DILexicalBlock(scope: !470, file: !467, line: 125, column: 7)
!493 = !DILocalVariable(name: "g", scope: !470, file: !467, line: 142, type: !474)
!494 = !DILocalVariable(name: "ng", scope: !470, file: !467, line: 146, type: !25)
!495 = !DILocalVariable(name: "first", scope: !496, file: !467, line: 183, type: !47)
!496 = distinct !DILexicalBlock(scope: !497, file: !467, line: 182, column: 5)
!497 = distinct !DILexicalBlock(scope: !470, file: !467, line: 181, column: 7)
!498 = !DILocalVariable(name: "groups_end", scope: !496, file: !467, line: 184, type: !474)
!499 = !DILocalVariable(name: "next", scope: !500, file: !467, line: 186, type: !474)
!500 = distinct !DILexicalBlock(scope: !496, file: !467, line: 186, column: 7)
!501 = !{!502}
!502 = !DIEnumerator(name: "N_GROUPS_INIT", value: 10)
!503 = !{!24, !47}
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !506, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!506 = !{!64, !29, !24}
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!508 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!509 = distinct !DICompileUnit(language: DW_LANG_C99, file: !510, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!510 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!511 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !412, splitDebugInlining: false, nameTableKind: None)
!512 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!513 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!514 = !{i32 7, !"Dwarf Version", i32 5}
!515 = !{i32 2, !"Debug Info Version", i32 3}
!516 = !{i32 1, !"wchar_size", i32 4}
!517 = !{i32 1, !"branch-target-enforcement", i32 0}
!518 = !{i32 1, !"sign-return-address", i32 0}
!519 = !{i32 1, !"sign-return-address-all", i32 0}
!520 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!521 = !{i32 7, !"PIC Level", i32 2}
!522 = !{i32 7, !"PIE Level", i32 2}
!523 = !{i32 7, !"uwtable", i32 1}
!524 = !{i32 7, !"frame-pointer", i32 1}
!525 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 88, type: !526, scopeLine: 89, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !528)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !25}
!528 = !{!529}
!529 = !DILocalVariable(name: "status", arg: 1, scope: !525, file: !3, line: 88, type: !25)
!530 = !DILocation(line: 0, scope: !525)
!531 = !DILocation(line: 90, column: 14, scope: !532)
!532 = distinct !DILexicalBlock(scope: !525, file: !3, line: 90, column: 7)
!533 = !DILocation(line: 90, column: 7, scope: !525)
!534 = !DILocation(line: 91, column: 5, scope: !535)
!535 = distinct !DILexicalBlock(scope: !532, file: !3, line: 91, column: 5)
!536 = !{!537, !537, i64 0}
!537 = !{!"any pointer", !538, i64 0}
!538 = !{!"omnipotent char", !539, i64 0}
!539 = !{!"Simple C/C++ TBAA"}
!540 = !DILocation(line: 94, column: 7, scope: !541)
!541 = distinct !DILexicalBlock(scope: !532, file: !3, line: 93, column: 5)
!542 = !DILocation(line: 95, column: 7, scope: !541)
!543 = !DILocation(line: 100, column: 7, scope: !541)
!544 = !DILocation(line: 104, column: 7, scope: !541)
!545 = !DILocation(line: 108, column: 7, scope: !541)
!546 = !DILocation(line: 112, column: 7, scope: !541)
!547 = !DILocation(line: 116, column: 7, scope: !541)
!548 = !DILocation(line: 120, column: 7, scope: !541)
!549 = !DILocation(line: 124, column: 7, scope: !541)
!550 = !DILocation(line: 128, column: 7, scope: !541)
!551 = !DILocation(line: 133, column: 7, scope: !541)
!552 = !DILocation(line: 134, column: 7, scope: !541)
!553 = !DILocation(line: 135, column: 7, scope: !541)
!554 = !DILocalVariable(name: "program", arg: 1, scope: !555, file: !54, line: 836, type: !30)
!555 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !54, file: !54, line: 836, type: !556, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !558)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !30}
!558 = !{!554, !559, !568, !569, !571, !572}
!559 = !DILocalVariable(name: "infomap", scope: !555, file: !54, line: 838, type: !560)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 896, elements: !566)
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !555, file: !54, line: 838, size: 128, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !562, file: !54, line: 838, baseType: !30, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !562, file: !54, line: 838, baseType: !30, size: 64, offset: 64)
!566 = !{!567}
!567 = !DISubrange(count: 7)
!568 = !DILocalVariable(name: "node", scope: !555, file: !54, line: 848, type: !30)
!569 = !DILocalVariable(name: "map_prog", scope: !555, file: !54, line: 849, type: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!571 = !DILocalVariable(name: "lc_messages", scope: !555, file: !54, line: 861, type: !30)
!572 = !DILocalVariable(name: "url_program", scope: !555, file: !54, line: 874, type: !30)
!573 = !DILocation(line: 0, scope: !555, inlinedAt: !574)
!574 = distinct !DILocation(line: 139, column: 7, scope: !541)
!575 = !DILocation(line: 838, column: 3, scope: !555, inlinedAt: !574)
!576 = !DILocation(line: 838, column: 67, scope: !555, inlinedAt: !574)
!577 = !DILocation(line: 849, column: 36, scope: !555, inlinedAt: !574)
!578 = !DILocation(line: 851, column: 3, scope: !555, inlinedAt: !574)
!579 = !DILocalVariable(name: "__s1", arg: 1, scope: !580, file: !581, line: 1359, type: !30)
!580 = distinct !DISubprogram(name: "streq", scope: !581, file: !581, line: 1359, type: !582, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !584)
!581 = !DIFile(filename: "./lib/string.h", directory: "/src")
!582 = !DISubroutineType(types: !583)
!583 = !{!64, !30, !30}
!584 = !{!579, !585}
!585 = !DILocalVariable(name: "__s2", arg: 2, scope: !580, file: !581, line: 1359, type: !30)
!586 = !DILocation(line: 0, scope: !580, inlinedAt: !587)
!587 = distinct !DILocation(line: 851, column: 33, scope: !555, inlinedAt: !574)
!588 = !DILocation(line: 1361, column: 11, scope: !580, inlinedAt: !587)
!589 = !DILocation(line: 1361, column: 10, scope: !580, inlinedAt: !587)
!590 = !DILocation(line: 852, column: 13, scope: !555, inlinedAt: !574)
!591 = !DILocation(line: 851, column: 20, scope: !555, inlinedAt: !574)
!592 = !{!593, !537, i64 0}
!593 = !{!"infomap", !537, i64 0, !537, i64 8}
!594 = !DILocation(line: 851, column: 10, scope: !555, inlinedAt: !574)
!595 = !DILocation(line: 851, column: 28, scope: !555, inlinedAt: !574)
!596 = distinct !{!596, !578, !590, !597}
!597 = !{!"llvm.loop.mustprogress"}
!598 = !DILocation(line: 854, column: 17, scope: !599, inlinedAt: !574)
!599 = distinct !DILexicalBlock(scope: !555, file: !54, line: 854, column: 7)
!600 = !{!593, !537, i64 8}
!601 = !DILocation(line: 854, column: 7, scope: !599, inlinedAt: !574)
!602 = !DILocation(line: 854, column: 7, scope: !555, inlinedAt: !574)
!603 = !DILocation(line: 857, column: 3, scope: !555, inlinedAt: !574)
!604 = !DILocation(line: 861, column: 29, scope: !555, inlinedAt: !574)
!605 = !DILocation(line: 862, column: 7, scope: !606, inlinedAt: !574)
!606 = distinct !DILexicalBlock(scope: !555, file: !54, line: 862, column: 7)
!607 = !DILocation(line: 862, column: 19, scope: !606, inlinedAt: !574)
!608 = !DILocation(line: 862, column: 22, scope: !606, inlinedAt: !574)
!609 = !DILocation(line: 862, column: 7, scope: !555, inlinedAt: !574)
!610 = !DILocation(line: 868, column: 7, scope: !611, inlinedAt: !574)
!611 = distinct !DILexicalBlock(scope: !606, file: !54, line: 863, column: 5)
!612 = !DILocation(line: 870, column: 5, scope: !611, inlinedAt: !574)
!613 = !DILocation(line: 0, scope: !580, inlinedAt: !614)
!614 = distinct !DILocation(line: 874, column: 29, scope: !555, inlinedAt: !574)
!615 = !DILocation(line: 875, column: 3, scope: !555, inlinedAt: !574)
!616 = !DILocation(line: 877, column: 3, scope: !555, inlinedAt: !574)
!617 = !DILocation(line: 879, column: 1, scope: !555, inlinedAt: !574)
!618 = !DILocation(line: 141, column: 3, scope: !525)
!619 = !DISubprogram(name: "dcgettext", scope: !620, file: !620, line: 51, type: !621, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !623)
!620 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!621 = !DISubroutineType(types: !622)
!622 = !{!22, !30, !30, !25}
!623 = !{}
!624 = !DISubprogram(name: "fputs_unlocked", scope: !199, file: !199, line: 691, type: !625, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !623)
!625 = !DISubroutineType(types: !626)
!626 = !{!25, !627, !628}
!627 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !30)
!628 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !77)
!629 = !DILocation(line: 0, scope: !53)
!630 = !DILocation(line: 581, column: 7, scope: !62)
!631 = !{!632, !632, i64 0}
!632 = !{!"int", !538, i64 0}
!633 = !DILocation(line: 581, column: 19, scope: !62)
!634 = !DILocation(line: 581, column: 7, scope: !53)
!635 = !DILocation(line: 585, column: 26, scope: !61)
!636 = !DILocation(line: 0, scope: !61)
!637 = !DILocation(line: 586, column: 23, scope: !61)
!638 = !DILocation(line: 586, column: 28, scope: !61)
!639 = !DILocation(line: 586, column: 32, scope: !61)
!640 = !{!538, !538, i64 0}
!641 = !DILocation(line: 586, column: 38, scope: !61)
!642 = !DILocation(line: 0, scope: !580, inlinedAt: !643)
!643 = distinct !DILocation(line: 586, column: 41, scope: !61)
!644 = !DILocation(line: 1361, column: 11, scope: !580, inlinedAt: !643)
!645 = !DILocation(line: 1361, column: 10, scope: !580, inlinedAt: !643)
!646 = !DILocation(line: 586, column: 19, scope: !61)
!647 = !DILocation(line: 587, column: 5, scope: !61)
!648 = !DILocation(line: 588, column: 7, scope: !649)
!649 = distinct !DILexicalBlock(scope: !53, file: !54, line: 588, column: 7)
!650 = !DILocation(line: 588, column: 7, scope: !53)
!651 = !DILocation(line: 590, column: 7, scope: !652)
!652 = distinct !DILexicalBlock(scope: !649, file: !54, line: 589, column: 5)
!653 = !DILocation(line: 591, column: 7, scope: !652)
!654 = !DILocation(line: 595, column: 37, scope: !53)
!655 = !DILocation(line: 595, column: 35, scope: !53)
!656 = !DILocation(line: 596, column: 29, scope: !53)
!657 = !DILocation(line: 597, column: 8, scope: !70)
!658 = !DILocation(line: 597, column: 7, scope: !53)
!659 = !DILocation(line: 604, column: 24, scope: !69)
!660 = !DILocation(line: 604, column: 12, scope: !70)
!661 = !DILocation(line: 0, scope: !68)
!662 = !DILocation(line: 610, column: 16, scope: !68)
!663 = !DILocation(line: 610, column: 7, scope: !68)
!664 = !DILocation(line: 611, column: 21, scope: !68)
!665 = !{!666, !666, i64 0}
!666 = !{!"short", !538, i64 0}
!667 = !DILocation(line: 611, column: 19, scope: !68)
!668 = !DILocation(line: 611, column: 16, scope: !68)
!669 = !DILocation(line: 610, column: 30, scope: !68)
!670 = distinct !{!670, !663, !664, !597}
!671 = !DILocation(line: 612, column: 18, scope: !672)
!672 = distinct !DILexicalBlock(scope: !68, file: !54, line: 612, column: 11)
!673 = !DILocation(line: 612, column: 11, scope: !68)
!674 = !DILocation(line: 620, column: 23, scope: !53)
!675 = !DILocation(line: 625, column: 39, scope: !53)
!676 = !DILocation(line: 626, column: 3, scope: !53)
!677 = !DILocation(line: 626, column: 10, scope: !53)
!678 = !DILocation(line: 626, column: 21, scope: !53)
!679 = !DILocation(line: 628, column: 44, scope: !680)
!680 = distinct !DILexicalBlock(scope: !681, file: !54, line: 628, column: 11)
!681 = distinct !DILexicalBlock(scope: !53, file: !54, line: 627, column: 5)
!682 = !DILocation(line: 628, column: 32, scope: !680)
!683 = !DILocation(line: 628, column: 49, scope: !680)
!684 = !DILocation(line: 628, column: 11, scope: !681)
!685 = !DILocation(line: 630, column: 11, scope: !686)
!686 = distinct !DILexicalBlock(scope: !681, file: !54, line: 630, column: 11)
!687 = !DILocation(line: 630, column: 11, scope: !681)
!688 = !DILocation(line: 632, column: 26, scope: !689)
!689 = distinct !DILexicalBlock(scope: !690, file: !54, line: 632, column: 15)
!690 = distinct !DILexicalBlock(scope: !686, file: !54, line: 631, column: 9)
!691 = !DILocation(line: 632, column: 34, scope: !689)
!692 = !DILocation(line: 632, column: 37, scope: !689)
!693 = !DILocation(line: 632, column: 15, scope: !690)
!694 = !DILocation(line: 636, column: 29, scope: !695)
!695 = distinct !DILexicalBlock(scope: !690, file: !54, line: 636, column: 15)
!696 = !DILocation(line: 640, column: 16, scope: !681)
!697 = distinct !{!697, !676, !698, !597}
!698 = !DILocation(line: 641, column: 5, scope: !53)
!699 = !DILocation(line: 644, column: 3, scope: !53)
!700 = !DILocation(line: 0, scope: !580, inlinedAt: !701)
!701 = distinct !DILocation(line: 648, column: 31, scope: !53)
!702 = !DILocation(line: 0, scope: !580, inlinedAt: !703)
!703 = distinct !DILocation(line: 649, column: 31, scope: !53)
!704 = !DILocation(line: 0, scope: !580, inlinedAt: !705)
!705 = distinct !DILocation(line: 650, column: 31, scope: !53)
!706 = !DILocation(line: 0, scope: !580, inlinedAt: !707)
!707 = distinct !DILocation(line: 651, column: 31, scope: !53)
!708 = !DILocation(line: 0, scope: !580, inlinedAt: !709)
!709 = distinct !DILocation(line: 652, column: 31, scope: !53)
!710 = !DILocation(line: 0, scope: !580, inlinedAt: !711)
!711 = distinct !DILocation(line: 653, column: 31, scope: !53)
!712 = !DILocation(line: 0, scope: !580, inlinedAt: !713)
!713 = distinct !DILocation(line: 654, column: 31, scope: !53)
!714 = !DILocation(line: 0, scope: !580, inlinedAt: !715)
!715 = distinct !DILocation(line: 655, column: 31, scope: !53)
!716 = !DILocation(line: 0, scope: !580, inlinedAt: !717)
!717 = distinct !DILocation(line: 656, column: 31, scope: !53)
!718 = !DILocation(line: 0, scope: !580, inlinedAt: !719)
!719 = distinct !DILocation(line: 657, column: 31, scope: !53)
!720 = !DILocation(line: 663, column: 7, scope: !721)
!721 = distinct !DILexicalBlock(scope: !53, file: !54, line: 663, column: 7)
!722 = !DILocation(line: 664, column: 7, scope: !721)
!723 = !DILocation(line: 664, column: 10, scope: !721)
!724 = !DILocation(line: 663, column: 7, scope: !53)
!725 = !DILocation(line: 669, column: 7, scope: !726)
!726 = distinct !DILexicalBlock(scope: !721, file: !54, line: 665, column: 5)
!727 = !DILocation(line: 671, column: 5, scope: !726)
!728 = !DILocation(line: 676, column: 7, scope: !729)
!729 = distinct !DILexicalBlock(scope: !721, file: !54, line: 673, column: 5)
!730 = !DILocation(line: 679, column: 3, scope: !53)
!731 = !DILocation(line: 683, column: 3, scope: !53)
!732 = !DILocation(line: 686, column: 3, scope: !53)
!733 = !DILocation(line: 688, column: 3, scope: !53)
!734 = !DILocation(line: 691, column: 3, scope: !53)
!735 = !DILocation(line: 695, column: 3, scope: !53)
!736 = !DILocation(line: 696, column: 1, scope: !53)
!737 = !DISubprogram(name: "setlocale", scope: !738, file: !738, line: 122, type: !739, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !623)
!738 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!739 = !DISubroutineType(types: !740)
!740 = !{!22, !25, !30}
!741 = !DISubprogram(name: "getenv", scope: !742, file: !742, line: 641, type: !743, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !623)
!742 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!743 = !DISubroutineType(types: !744)
!744 = !{!22, !30}
!745 = !DISubprogram(name: "fwrite_unlocked", scope: !199, file: !199, line: 704, type: !746, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !623)
!746 = !DISubroutineType(types: !747)
!747 = !{!27, !748, !27, !27, !628}
!748 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!751 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 145, type: !752, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !755)
!752 = !DISubroutineType(types: !753)
!753 = !{!25, !25, !754}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!755 = !{!756, !757, !758, !759, !760, !761, !762, !763, !769, !781, !782, !784}
!756 = !DILocalVariable(name: "argc", arg: 1, scope: !751, file: !3, line: 145, type: !25)
!757 = !DILocalVariable(name: "argv", arg: 2, scope: !751, file: !3, line: 145, type: !754)
!758 = !DILocalVariable(name: "optc", scope: !751, file: !3, line: 147, type: !25)
!759 = !DILocalVariable(name: "selinux_enabled", scope: !751, file: !3, line: 148, type: !25)
!760 = !DILocalVariable(name: "smack_enabled", scope: !751, file: !3, line: 149, type: !64)
!761 = !DILocalVariable(name: "n_ids", scope: !751, file: !3, line: 207, type: !27)
!762 = !DILocalVariable(name: "default_format", scope: !751, file: !3, line: 216, type: !64)
!763 = !DILocalVariable(name: "pw_name", scope: !764, file: !3, line: 257, type: !22)
!764 = distinct !DILexicalBlock(scope: !765, file: !3, line: 256, column: 9)
!765 = distinct !DILexicalBlock(scope: !766, file: !3, line: 255, column: 7)
!766 = distinct !DILexicalBlock(scope: !767, file: !3, line: 255, column: 7)
!767 = distinct !DILexicalBlock(scope: !768, file: !3, line: 247, column: 5)
!768 = distinct !DILexicalBlock(scope: !751, file: !3, line: 246, column: 7)
!769 = !DILocalVariable(name: "pwd", scope: !764, file: !3, line: 258, type: !770)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !772, line: 49, size: 384, elements: !773)
!772 = !DIFile(filename: "/usr/include/pwd.h", directory: "", checksumkind: CSK_MD5, checksum: "6682d47abdfe13134f841d46e0eadc7b")
!773 = !{!774, !775, !776, !777, !778, !779, !780}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !771, file: !772, line: 51, baseType: !22, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !771, file: !772, line: 52, baseType: !22, size: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !771, file: !772, line: 54, baseType: !42, size: 32, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !771, file: !772, line: 55, baseType: !48, size: 32, offset: 160)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !771, file: !772, line: 56, baseType: !22, size: 64, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !771, file: !772, line: 57, baseType: !22, size: 64, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !771, file: !772, line: 58, baseType: !22, size: 64, offset: 320)
!781 = !DILocalVariable(name: "spec", scope: !764, file: !3, line: 259, type: !30)
!782 = !DILocalVariable(name: "NO_UID", scope: !783, file: !3, line: 291, type: !40)
!783 = distinct !DILexicalBlock(scope: !768, file: !3, line: 287, column: 5)
!784 = !DILocalVariable(name: "NO_GID", scope: !783, file: !3, line: 292, type: !47)
!785 = !DILocation(line: 0, scope: !751)
!786 = !DILocation(line: 152, column: 21, scope: !751)
!787 = !DILocation(line: 152, column: 3, scope: !751)
!788 = !DILocation(line: 153, column: 3, scope: !751)
!789 = !DILocation(line: 154, column: 3, scope: !751)
!790 = !DILocation(line: 155, column: 3, scope: !751)
!791 = !DILocation(line: 157, column: 3, scope: !751)
!792 = !DILocation(line: 159, column: 3, scope: !751)
!793 = !DILocation(line: 159, column: 18, scope: !751)
!794 = !DILocation(line: 176, column: 13, scope: !795)
!795 = distinct !DILexicalBlock(scope: !796, file: !3, line: 175, column: 15)
!796 = distinct !DILexicalBlock(scope: !797, file: !3, line: 162, column: 9)
!797 = distinct !DILexicalBlock(scope: !751, file: !3, line: 160, column: 5)
!798 = !DILocation(line: 187, column: 11, scope: !796)
!799 = !DILocation(line: 190, column: 11, scope: !796)
!800 = !DILocation(line: 193, column: 11, scope: !796)
!801 = !DILocation(line: 196, column: 11, scope: !796)
!802 = !DILocation(line: 199, column: 11, scope: !796)
!803 = !DILocation(line: 200, column: 9, scope: !796)
!804 = !DILocation(line: 201, column: 9, scope: !796)
!805 = !DILocation(line: 203, column: 11, scope: !796)
!806 = !DILocation(line: 0, scope: !796)
!807 = distinct !{!807, !792, !808, !597}
!808 = !DILocation(line: 205, column: 5, scope: !751)
!809 = !DILocation(line: 207, column: 25, scope: !751)
!810 = !DILocation(line: 207, column: 23, scope: !751)
!811 = !DILocation(line: 207, column: 18, scope: !751)
!812 = !DILocation(line: 213, column: 7, scope: !813)
!813 = distinct !DILexicalBlock(scope: !751, file: !3, line: 213, column: 7)
!814 = !DILocation(line: 213, column: 19, scope: !813)
!815 = !DILocation(line: 213, column: 17, scope: !813)
!816 = !DILocation(line: 213, column: 32, scope: !813)
!817 = !DILocation(line: 213, column: 30, scope: !813)
!818 = !DILocation(line: 213, column: 63, scope: !813)
!819 = !DILocation(line: 213, column: 7, scope: !751)
!820 = !DILocation(line: 214, column: 5, scope: !813)
!821 = !DILocation(line: 217, column: 28, scope: !751)
!822 = !DILocation(line: 221, column: 22, scope: !823)
!823 = distinct !DILexicalBlock(scope: !751, file: !3, line: 221, column: 7)
!824 = !DILocation(line: 234, column: 13, scope: !825)
!825 = distinct !DILexicalBlock(scope: !751, file: !3, line: 234, column: 7)
!826 = !DILocation(line: 246, column: 7, scope: !751)
!827 = !DILocation(line: 221, column: 26, scope: !823)
!828 = !DILocation(line: 221, column: 35, scope: !823)
!829 = !DILocation(line: 221, column: 38, scope: !823)
!830 = !DILocation(line: 221, column: 7, scope: !751)
!831 = !DILocation(line: 222, column: 5, scope: !823)
!832 = !DILocation(line: 225, column: 25, scope: !833)
!833 = distinct !DILexicalBlock(scope: !751, file: !3, line: 225, column: 7)
!834 = !DILocation(line: 225, column: 7, scope: !751)
!835 = !DILocation(line: 226, column: 5, scope: !833)
!836 = !DILocation(line: 235, column: 7, scope: !825)
!837 = !DILocation(line: 236, column: 35, scope: !825)
!838 = !DILocation(line: 248, column: 30, scope: !767)
!839 = !DILocation(line: 248, column: 22, scope: !767)
!840 = !{!841, !841, i64 0}
!841 = !{!"_Bool", !538, i64 0}
!842 = !DILocation(line: 253, column: 16, scope: !767)
!843 = !DILocation(line: 253, column: 13, scope: !767)
!844 = !DILocation(line: 255, column: 21, scope: !765)
!845 = !DILocation(line: 255, column: 7, scope: !766)
!846 = !DILocation(line: 257, column: 11, scope: !764)
!847 = !DILocation(line: 0, scope: !764)
!848 = !DILocation(line: 257, column: 17, scope: !764)
!849 = !DILocation(line: 259, column: 30, scope: !764)
!850 = !DILocation(line: 263, column: 15, scope: !851)
!851 = distinct !DILexicalBlock(scope: !764, file: !3, line: 263, column: 15)
!852 = !DILocation(line: 263, column: 15, scope: !764)
!853 = !DILocation(line: 265, column: 21, scope: !854)
!854 = distinct !DILexicalBlock(scope: !855, file: !3, line: 265, column: 19)
!855 = distinct !DILexicalBlock(scope: !851, file: !3, line: 264, column: 13)
!856 = !DILocation(line: 265, column: 19, scope: !855)
!857 = !DILocation(line: 266, column: 23, scope: !854)
!858 = !DILocation(line: 266, column: 33, scope: !854)
!859 = !DILocation(line: 266, column: 64, scope: !854)
!860 = !DILocation(line: 266, column: 54, scope: !854)
!861 = !DILocation(line: 268, column: 19, scope: !862)
!862 = distinct !DILexicalBlock(scope: !764, file: !3, line: 268, column: 15)
!863 = !DILocation(line: 268, column: 15, scope: !764)
!864 = !DILocation(line: 270, column: 15, scope: !865)
!865 = distinct !DILexicalBlock(scope: !862, file: !3, line: 269, column: 13)
!866 = !DILocation(line: 271, column: 18, scope: !865)
!867 = !DILocation(line: 272, column: 13, scope: !865)
!868 = !DILocation(line: 275, column: 20, scope: !869)
!869 = distinct !DILexicalBlock(scope: !870, file: !3, line: 275, column: 19)
!870 = distinct !DILexicalBlock(scope: !862, file: !3, line: 274, column: 13)
!871 = !DILocation(line: 275, column: 19, scope: !870)
!872 = !DILocation(line: 276, column: 41, scope: !869)
!873 = !{!874, !537, i64 0}
!874 = !{!"passwd", !537, i64 0, !537, i64 8, !632, i64 16, !632, i64 20, !537, i64 24, !537, i64 32, !537, i64 40}
!875 = !DILocation(line: 276, column: 27, scope: !869)
!876 = !DILocation(line: 276, column: 25, scope: !869)
!877 = !DILocation(line: 276, column: 17, scope: !869)
!878 = !DILocation(line: 279, column: 28, scope: !870)
!879 = !DILocation(line: 277, column: 34, scope: !870)
!880 = !{!874, !632, i64 16}
!881 = !DILocation(line: 277, column: 27, scope: !870)
!882 = !DILocation(line: 277, column: 20, scope: !870)
!883 = !DILocation(line: 278, column: 34, scope: !870)
!884 = !{!874, !632, i64 20}
!885 = !DILocation(line: 278, column: 27, scope: !870)
!886 = !DILocation(line: 278, column: 20, scope: !870)
!887 = !DILocation(line: 279, column: 15, scope: !870)
!888 = !DILocation(line: 280, column: 19, scope: !889)
!889 = distinct !DILexicalBlock(scope: !870, file: !3, line: 280, column: 19)
!890 = !DILocalVariable(name: "__stream", arg: 1, scope: !891, file: !892, line: 135, type: !77)
!891 = distinct !DISubprogram(name: "ferror_unlocked", scope: !892, file: !892, line: 135, type: !893, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !895)
!892 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!893 = !DISubroutineType(types: !894)
!894 = !{!25, !77}
!895 = !{!890}
!896 = !DILocation(line: 0, scope: !891, inlinedAt: !897)
!897 = distinct !DILocation(line: 280, column: 19, scope: !889)
!898 = !DILocation(line: 137, column: 10, scope: !891, inlinedAt: !897)
!899 = !{!900, !632, i64 0}
!900 = !{!"_IO_FILE", !632, i64 0, !537, i64 8, !537, i64 16, !537, i64 24, !537, i64 32, !537, i64 40, !537, i64 48, !537, i64 56, !537, i64 64, !537, i64 72, !537, i64 80, !537, i64 88, !537, i64 96, !537, i64 104, !632, i64 112, !632, i64 116, !901, i64 120, !666, i64 128, !538, i64 130, !538, i64 131, !537, i64 136, !901, i64 144, !537, i64 152, !537, i64 160, !537, i64 168, !537, i64 176, !901, i64 184, !632, i64 192, !538, i64 196}
!901 = !{!"long", !538, i64 0}
!902 = !DILocation(line: 280, column: 19, scope: !870)
!903 = !DILocation(line: 948, column: 21, scope: !904, inlinedAt: !907)
!904 = distinct !DISubprogram(name: "write_error", scope: !54, file: !54, line: 946, type: !226, scopeLine: 947, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !905)
!905 = !{!906}
!906 = !DILocalVariable(name: "saved_errno", scope: !904, file: !54, line: 948, type: !25)
!907 = distinct !DILocation(line: 281, column: 17, scope: !889)
!908 = !DILocation(line: 0, scope: !904, inlinedAt: !907)
!909 = !DILocation(line: 949, column: 3, scope: !904, inlinedAt: !907)
!910 = !DILocation(line: 950, column: 11, scope: !904, inlinedAt: !907)
!911 = !DILocation(line: 950, column: 3, scope: !904, inlinedAt: !907)
!912 = !DILocation(line: 951, column: 3, scope: !904, inlinedAt: !907)
!913 = !DILocation(line: 952, column: 3, scope: !904, inlinedAt: !907)
!914 = !DILocation(line: 283, column: 17, scope: !764)
!915 = !DILocation(line: 283, column: 11, scope: !764)
!916 = !DILocation(line: 284, column: 9, scope: !765)
!917 = !DILocation(line: 255, column: 36, scope: !765)
!918 = !DILocation(line: 255, column: 14, scope: !765)
!919 = distinct !{!919, !845, !920, !597}
!920 = !DILocation(line: 284, column: 9, scope: !766)
!921 = !DILocation(line: 0, scope: !783)
!922 = !DILocation(line: 294, column: 11, scope: !783)
!923 = !DILocation(line: 294, column: 24, scope: !924)
!924 = distinct !DILexicalBlock(scope: !783, file: !3, line: 294, column: 11)
!925 = !DILocation(line: 294, column: 11, scope: !924)
!926 = !DILocation(line: 295, column: 25, scope: !924)
!927 = !DILocation(line: 297, column: 11, scope: !928)
!928 = distinct !DILexicalBlock(scope: !924, file: !3, line: 296, column: 9)
!929 = !DILocation(line: 297, column: 17, scope: !928)
!930 = !DILocation(line: 298, column: 18, scope: !928)
!931 = !DILocation(line: 298, column: 16, scope: !928)
!932 = !DILocation(line: 299, column: 20, scope: !933)
!933 = distinct !DILexicalBlock(scope: !928, file: !3, line: 299, column: 15)
!934 = !DILocation(line: 299, column: 30, scope: !933)
!935 = !DILocation(line: 299, column: 33, scope: !933)
!936 = !DILocation(line: 299, column: 15, scope: !928)
!937 = !DILocation(line: 300, column: 13, scope: !933)
!938 = !DILocation(line: 303, column: 11, scope: !939)
!939 = distinct !DILexicalBlock(scope: !783, file: !3, line: 303, column: 11)
!940 = !DILocation(line: 303, column: 11, scope: !783)
!941 = !DILocation(line: 303, column: 23, scope: !939)
!942 = !DILocation(line: 304, column: 14, scope: !939)
!943 = !DILocation(line: 304, column: 25, scope: !939)
!944 = !DILocation(line: 314, column: 11, scope: !945)
!945 = distinct !DILexicalBlock(scope: !946, file: !3, line: 313, column: 9)
!946 = distinct !DILexicalBlock(scope: !783, file: !3, line: 312, column: 11)
!947 = !DILocation(line: 306, column: 11, scope: !948)
!948 = distinct !DILexicalBlock(scope: !939, file: !3, line: 305, column: 9)
!949 = !DILocation(line: 306, column: 17, scope: !948)
!950 = !DILocation(line: 307, column: 18, scope: !948)
!951 = !DILocation(line: 307, column: 16, scope: !948)
!952 = !DILocation(line: 308, column: 20, scope: !953)
!953 = distinct !DILexicalBlock(scope: !948, file: !3, line: 308, column: 15)
!954 = !DILocation(line: 308, column: 30, scope: !953)
!955 = !DILocation(line: 308, column: 33, scope: !953)
!956 = !DILocation(line: 308, column: 15, scope: !948)
!957 = !DILocation(line: 309, column: 13, scope: !953)
!958 = !DILocation(line: 312, column: 12, scope: !946)
!959 = !DILocation(line: 312, column: 22, scope: !946)
!960 = !DILocation(line: 314, column: 17, scope: !945)
!961 = !DILocation(line: 315, column: 18, scope: !945)
!962 = !DILocation(line: 315, column: 16, scope: !945)
!963 = !DILocation(line: 316, column: 20, scope: !964)
!964 = distinct !DILexicalBlock(scope: !945, file: !3, line: 316, column: 15)
!965 = !DILocation(line: 316, column: 30, scope: !964)
!966 = !DILocation(line: 316, column: 33, scope: !964)
!967 = !DILocation(line: 316, column: 15, scope: !945)
!968 = !DILocation(line: 317, column: 13, scope: !964)
!969 = !DILocation(line: 319, column: 17, scope: !945)
!970 = !DILocation(line: 320, column: 18, scope: !945)
!971 = !DILocation(line: 320, column: 16, scope: !945)
!972 = !DILocation(line: 321, column: 20, scope: !973)
!973 = distinct !DILexicalBlock(scope: !945, file: !3, line: 321, column: 15)
!974 = !DILocation(line: 321, column: 30, scope: !973)
!975 = !DILocation(line: 321, column: 33, scope: !973)
!976 = !DILocation(line: 321, column: 15, scope: !945)
!977 = !DILocation(line: 322, column: 13, scope: !973)
!978 = !DILocation(line: 324, column: 9, scope: !783)
!979 = !DILocation(line: 327, column: 10, scope: !751)
!980 = !{i8 0, i8 2}
!981 = !DILocation(line: 328, column: 1, scope: !751)
!982 = !DISubprogram(name: "bindtextdomain", scope: !620, file: !620, line: 86, type: !983, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !623)
!983 = !DISubroutineType(types: !984)
!984 = !{!22, !30, !30}
!985 = !DISubprogram(name: "textdomain", scope: !620, file: !620, line: 82, type: !743, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !623)
!986 = !DISubprogram(name: "atexit", scope: !742, file: !742, line: 602, type: !987, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !623)
!987 = !DISubroutineType(types: !988)
!988 = !{!25, !225}
!989 = !DISubprogram(name: "getopt_long", scope: !160, file: !160, line: 66, type: !990, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !623)
!990 = !DISubroutineType(types: !991)
!991 = !{!25, !25, !992, !30, !994, !165}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!995 = !DISubprogram(name: "getpwnam", scope: !772, file: !772, line: 116, type: !996, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !623)
!996 = !DISubroutineType(types: !997)
!997 = !{!770, !30}
!998 = !DISubprogram(name: "getpwuid", scope: !772, file: !772, line: 110, type: !999, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !623)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!770, !42}
!1001 = distinct !DISubprogram(name: "print_stuff", scope: !3, file: !3, line: 431, type: !556, scopeLine: 432, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1002)
!1002 = !{!1003}
!1003 = !DILocalVariable(name: "pw_name", arg: 1, scope: !1001, file: !3, line: 431, type: !30)
!1004 = !DILocation(line: 0, scope: !1001)
!1005 = !DILocation(line: 433, column: 7, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 433, column: 7)
!1007 = !DILocation(line: 433, column: 7, scope: !1001)
!1008 = !DILocation(line: 434, column: 19, scope: !1006)
!1009 = !DILocalVariable(name: "uid", arg: 1, scope: !1010, file: !3, line: 333, type: !40)
!1010 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !1011, scopeLine: 334, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1013)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{null, !40}
!1013 = !{!1009, !1014}
!1014 = !DILocalVariable(name: "pwd", scope: !1010, file: !3, line: 335, type: !770)
!1015 = !DILocation(line: 0, scope: !1010, inlinedAt: !1016)
!1016 = distinct !DILocation(line: 434, column: 7, scope: !1006)
!1017 = !DILocation(line: 337, column: 7, scope: !1018, inlinedAt: !1016)
!1018 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 337, column: 7)
!1019 = !DILocation(line: 337, column: 7, scope: !1010, inlinedAt: !1016)
!1020 = !DILocation(line: 350, column: 5, scope: !1021, inlinedAt: !1016)
!1021 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 347, column: 7)
!1022 = !DILocation(line: 339, column: 13, scope: !1023, inlinedAt: !1016)
!1023 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 338, column: 5)
!1024 = !DILocation(line: 340, column: 15, scope: !1025, inlinedAt: !1016)
!1025 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 340, column: 11)
!1026 = !DILocation(line: 340, column: 11, scope: !1023, inlinedAt: !1016)
!1027 = !DILocation(line: 342, column: 11, scope: !1028, inlinedAt: !1016)
!1028 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 341, column: 9)
!1029 = !DILocation(line: 343, column: 14, scope: !1028, inlinedAt: !1016)
!1030 = !DILocation(line: 344, column: 9, scope: !1028, inlinedAt: !1016)
!1031 = !DILocation(line: 348, column: 5, scope: !1021, inlinedAt: !1016)
!1032 = !DILocation(line: 441, column: 12, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 441, column: 12)
!1034 = !DILocation(line: 441, column: 12, scope: !1006)
!1035 = !DILocation(line: 442, column: 24, scope: !1033)
!1036 = !DILocation(line: 442, column: 48, scope: !1033)
!1037 = !DILocation(line: 442, column: 11, scope: !1033)
!1038 = !DILocation(line: 442, column: 8, scope: !1033)
!1039 = !DILocation(line: 442, column: 5, scope: !1033)
!1040 = !DILocation(line: 443, column: 12, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 443, column: 12)
!1042 = !DILocation(line: 443, column: 12, scope: !1033)
!1043 = !DILocation(line: 444, column: 38, scope: !1041)
!1044 = !DILocation(line: 444, column: 44, scope: !1041)
!1045 = !DILocation(line: 444, column: 50, scope: !1041)
!1046 = !DILocation(line: 445, column: 29, scope: !1041)
!1047 = !DILocation(line: 445, column: 39, scope: !1041)
!1048 = !DILocation(line: 444, column: 11, scope: !1041)
!1049 = !DILocation(line: 444, column: 8, scope: !1041)
!1050 = !DILocation(line: 444, column: 5, scope: !1041)
!1051 = !DILocalVariable(name: "username", arg: 1, scope: !1052, file: !3, line: 356, type: !30)
!1052 = distinct !DISubprogram(name: "print_full_info", scope: !3, file: !3, line: 356, type: !556, scopeLine: 357, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1053)
!1053 = !{!1051, !1054, !1055, !1064, !1066, !1067, !1068}
!1054 = !DILocalVariable(name: "pwd", scope: !1052, file: !3, line: 358, type: !770)
!1055 = !DILocalVariable(name: "grp", scope: !1052, file: !3, line: 359, type: !1056)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !1058, line: 42, size: 256, elements: !1059)
!1058 = !DIFile(filename: "/usr/include/grp.h", directory: "", checksumkind: CSK_MD5, checksum: "17838c4acd24e08e5bed6821e9e2c084")
!1059 = !{!1060, !1061, !1062, !1063}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !1057, file: !1058, line: 44, baseType: !22, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !1057, file: !1058, line: 45, baseType: !22, size: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !1057, file: !1058, line: 46, baseType: !48, size: 32, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !1057, file: !1058, line: 47, baseType: !754, size: 64, offset: 192)
!1064 = !DILocalVariable(name: "groups", scope: !1065, file: !3, line: 388, type: !474)
!1065 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 387, column: 3)
!1066 = !DILocalVariable(name: "primary_group", scope: !1065, file: !3, line: 390, type: !47)
!1067 = !DILocalVariable(name: "n_groups", scope: !1065, file: !3, line: 396, type: !25)
!1068 = !DILocalVariable(name: "i", scope: !1069, file: !3, line: 410, type: !25)
!1069 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 410, column: 5)
!1070 = !DILocation(line: 0, scope: !1052, inlinedAt: !1071)
!1071 = distinct !DILocation(line: 449, column: 5, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 446, column: 12)
!1073 = !DILocation(line: 361, column: 3, scope: !1052, inlinedAt: !1071)
!1074 = !DILocation(line: 362, column: 19, scope: !1052, inlinedAt: !1071)
!1075 = !DILocation(line: 362, column: 9, scope: !1052, inlinedAt: !1071)
!1076 = !DILocation(line: 363, column: 7, scope: !1077, inlinedAt: !1071)
!1077 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 363, column: 7)
!1078 = !DILocation(line: 363, column: 7, scope: !1052, inlinedAt: !1071)
!1079 = !DILocation(line: 364, column: 5, scope: !1077, inlinedAt: !1071)
!1080 = !DILocation(line: 366, column: 3, scope: !1052, inlinedAt: !1071)
!1081 = !DILocation(line: 367, column: 19, scope: !1052, inlinedAt: !1071)
!1082 = !DILocation(line: 367, column: 9, scope: !1052, inlinedAt: !1071)
!1083 = !DILocation(line: 368, column: 7, scope: !1084, inlinedAt: !1071)
!1084 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 368, column: 7)
!1085 = !DILocation(line: 368, column: 7, scope: !1052, inlinedAt: !1071)
!1086 = !DILocation(line: 369, column: 5, scope: !1084, inlinedAt: !1071)
!1087 = !{!1088, !537, i64 0}
!1088 = !{!"group", !537, i64 0, !537, i64 8, !632, i64 16, !537, i64 24}
!1089 = !DILocation(line: 371, column: 7, scope: !1090, inlinedAt: !1071)
!1090 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 371, column: 7)
!1091 = !DILocation(line: 371, column: 15, scope: !1090, inlinedAt: !1071)
!1092 = !DILocation(line: 371, column: 12, scope: !1090, inlinedAt: !1071)
!1093 = !DILocation(line: 371, column: 7, scope: !1052, inlinedAt: !1071)
!1094 = !DILocation(line: 373, column: 7, scope: !1095, inlinedAt: !1071)
!1095 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 372, column: 5)
!1096 = !DILocation(line: 374, column: 23, scope: !1095, inlinedAt: !1071)
!1097 = !DILocation(line: 374, column: 13, scope: !1095, inlinedAt: !1071)
!1098 = !DILocation(line: 375, column: 11, scope: !1099, inlinedAt: !1071)
!1099 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 375, column: 11)
!1100 = !DILocation(line: 375, column: 11, scope: !1095, inlinedAt: !1071)
!1101 = !DILocation(line: 376, column: 9, scope: !1099, inlinedAt: !1071)
!1102 = !DILocation(line: 379, column: 7, scope: !1103, inlinedAt: !1071)
!1103 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 379, column: 7)
!1104 = !DILocation(line: 379, column: 15, scope: !1103, inlinedAt: !1071)
!1105 = !DILocation(line: 379, column: 12, scope: !1103, inlinedAt: !1071)
!1106 = !DILocation(line: 379, column: 7, scope: !1052, inlinedAt: !1071)
!1107 = !DILocation(line: 381, column: 7, scope: !1108, inlinedAt: !1071)
!1108 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 380, column: 5)
!1109 = !DILocation(line: 382, column: 23, scope: !1108, inlinedAt: !1071)
!1110 = !DILocation(line: 382, column: 13, scope: !1108, inlinedAt: !1071)
!1111 = !DILocation(line: 383, column: 11, scope: !1112, inlinedAt: !1071)
!1112 = distinct !DILexicalBlock(scope: !1108, file: !3, line: 383, column: 11)
!1113 = !DILocation(line: 383, column: 11, scope: !1108, inlinedAt: !1071)
!1114 = !DILocation(line: 384, column: 9, scope: !1112, inlinedAt: !1071)
!1115 = !DILocation(line: 388, column: 5, scope: !1065, inlinedAt: !1071)
!1116 = !DILocation(line: 391, column: 9, scope: !1117, inlinedAt: !1071)
!1117 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 391, column: 9)
!1118 = !DILocation(line: 391, column: 9, scope: !1065, inlinedAt: !1071)
!1119 = !DILocation(line: 392, column: 23, scope: !1117, inlinedAt: !1071)
!1120 = !DILocation(line: 392, column: 34, scope: !1117, inlinedAt: !1071)
!1121 = !DILocation(line: 0, scope: !1117, inlinedAt: !1071)
!1122 = !DILocation(line: 0, scope: !1065, inlinedAt: !1071)
!1123 = !DILocation(line: 396, column: 20, scope: !1065, inlinedAt: !1071)
!1124 = !DILocation(line: 397, column: 18, scope: !1125, inlinedAt: !1071)
!1125 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 397, column: 9)
!1126 = !DILocation(line: 397, column: 9, scope: !1065, inlinedAt: !1071)
!1127 = !DILocation(line: 394, column: 23, scope: !1117, inlinedAt: !1071)
!1128 = !DILocation(line: 400, column: 11, scope: !1129, inlinedAt: !1071)
!1129 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 399, column: 13)
!1130 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 398, column: 7)
!1131 = !DILocation(line: 403, column: 11, scope: !1129, inlinedAt: !1071)
!1132 = !DILocation(line: 404, column: 12, scope: !1130, inlinedAt: !1071)
!1133 = !DILocation(line: 405, column: 9, scope: !1130, inlinedAt: !1071)
!1134 = !DILocation(line: 408, column: 18, scope: !1135, inlinedAt: !1071)
!1135 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 408, column: 9)
!1136 = !DILocation(line: 408, column: 9, scope: !1065, inlinedAt: !1071)
!1137 = !DILocation(line: 409, column: 7, scope: !1135, inlinedAt: !1071)
!1138 = !DILocation(line: 0, scope: !1069, inlinedAt: !1071)
!1139 = !DILocation(line: 410, column: 23, scope: !1140, inlinedAt: !1071)
!1140 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 410, column: 5)
!1141 = !DILocation(line: 414, column: 9, scope: !1142, inlinedAt: !1071)
!1142 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 411, column: 7)
!1143 = !DILocation(line: 415, column: 25, scope: !1142, inlinedAt: !1071)
!1144 = !DILocation(line: 415, column: 15, scope: !1142, inlinedAt: !1071)
!1145 = !DILocation(line: 416, column: 13, scope: !1146, inlinedAt: !1071)
!1146 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 416, column: 13)
!1147 = !DILocation(line: 416, column: 13, scope: !1142, inlinedAt: !1071)
!1148 = !DILocation(line: 417, column: 11, scope: !1146, inlinedAt: !1071)
!1149 = !DILocation(line: 410, column: 5, scope: !1069, inlinedAt: !1071)
!1150 = !DILocation(line: 419, column: 11, scope: !1065, inlinedAt: !1071)
!1151 = !DILocation(line: 419, column: 5, scope: !1065, inlinedAt: !1071)
!1152 = !DILocation(line: 420, column: 3, scope: !1052, inlinedAt: !1071)
!1153 = !DILocalVariable(name: "__c", arg: 1, scope: !1154, file: !892, line: 108, type: !25)
!1154 = distinct !DISubprogram(name: "putchar_unlocked", scope: !892, file: !892, line: 108, type: !1155, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1157)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!25, !25}
!1157 = !{!1153}
!1158 = !DILocation(line: 0, scope: !1154, inlinedAt: !1159)
!1159 = distinct !DILocation(line: 413, column: 11, scope: !1160, inlinedAt: !1071)
!1160 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 412, column: 13)
!1161 = !DILocation(line: 110, column: 10, scope: !1154, inlinedAt: !1159)
!1162 = !{!900, !537, i64 40}
!1163 = !{!900, !537, i64 48}
!1164 = !{!"branch_weights", i32 2000, i32 1}
!1165 = !DILocation(line: 410, column: 36, scope: !1140, inlinedAt: !1071)
!1166 = distinct !{!1166, !1149, !1167, !597, !1168}
!1167 = !DILocation(line: 418, column: 7, scope: !1069, inlinedAt: !1071)
!1168 = !{!"llvm.loop.peeled.count", i32 1}
!1169 = !DILocation(line: 454, column: 7, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 454, column: 7)
!1171 = !DILocation(line: 454, column: 16, scope: !1170)
!1172 = !DILocation(line: 454, column: 19, scope: !1170)
!1173 = !DILocation(line: 454, column: 35, scope: !1170)
!1174 = !DILocation(line: 0, scope: !1154, inlinedAt: !1175)
!1175 = distinct !DILocation(line: 456, column: 7, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1170, file: !3, line: 455, column: 5)
!1177 = !DILocation(line: 110, column: 10, scope: !1154, inlinedAt: !1175)
!1178 = !DILocation(line: 0, scope: !1154, inlinedAt: !1179)
!1179 = distinct !DILocation(line: 457, column: 7, scope: !1176)
!1180 = !DILocation(line: 110, column: 10, scope: !1154, inlinedAt: !1179)
!1181 = !DILocation(line: 461, column: 7, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1170, file: !3, line: 460, column: 5)
!1183 = !DILocation(line: 0, scope: !1154, inlinedAt: !1184)
!1184 = distinct !DILocation(line: 461, column: 7, scope: !1182)
!1185 = !DILocation(line: 110, column: 10, scope: !1154, inlinedAt: !1184)
!1186 = !DILocation(line: 463, column: 1, scope: !1001)
!1187 = !DISubprogram(name: "fflush_unlocked", scope: !199, file: !199, line: 239, type: !893, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !623)
!1188 = !DISubprogram(name: "clearerr_unlocked", scope: !199, file: !199, line: 794, type: !1189, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !623)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{null, !77}
!1191 = !DISubprogram(name: "geteuid", scope: !1192, file: !1192, line: 700, type: !1193, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !623)
!1192 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1193 = !DISubroutineType(types: !1194)
!1194 = !{!42}
!1195 = !DISubprogram(name: "getuid", scope: !1192, file: !1192, line: 697, type: !1193, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !623)
!1196 = !DISubprogram(name: "getegid", scope: !1192, file: !1192, line: 706, type: !1197, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !623)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!48}
!1199 = !DISubprogram(name: "getgid", scope: !1192, file: !1192, line: 703, type: !1197, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !623)
!1200 = !DISubprogram(name: "getgrgid", scope: !1058, file: !1058, line: 101, type: !1201, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !623)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!1056, !48}
!1203 = distinct !DISubprogram(name: "print_group_list", scope: !388, file: !388, line: 35, type: !1204, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !387, retainedNodes: !1206)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!64, !30, !40, !47, !47, !64, !23}
!1206 = !{!1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1225, !1227, !1228}
!1207 = !DILocalVariable(name: "username", arg: 1, scope: !1203, file: !388, line: 35, type: !30)
!1208 = !DILocalVariable(name: "ruid", arg: 2, scope: !1203, file: !388, line: 36, type: !40)
!1209 = !DILocalVariable(name: "rgid", arg: 3, scope: !1203, file: !388, line: 36, type: !47)
!1210 = !DILocalVariable(name: "egid", arg: 4, scope: !1203, file: !388, line: 36, type: !47)
!1211 = !DILocalVariable(name: "use_names", arg: 5, scope: !1203, file: !388, line: 37, type: !64)
!1212 = !DILocalVariable(name: "delim", arg: 6, scope: !1203, file: !388, line: 37, type: !23)
!1213 = !DILocalVariable(name: "ok", scope: !1203, file: !388, line: 39, type: !64)
!1214 = !DILocalVariable(name: "pwd", scope: !1203, file: !388, line: 40, type: !1215)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !772, line: 49, size: 384, elements: !1217)
!1217 = !{!1218, !1219, !1220, !1221, !1222, !1223, !1224}
