; ModuleID = 'src/chroot.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.char_directives = type { i64, %struct.char_directive*, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { i8*, i8*, i32, i8*, i8*, i64, i8*, i8*, i64, i8, i64 }
%struct.arguments = type { i64, %struct.argument*, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.38 }
%union.anon.38 = type { fp128 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !50, globals: !82, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/chroot.c", directory: "/src", checksumkind: CSK_MD5, checksum: "28f30281346b00b3b70d7b9124c4305a")
!4 = !{!5, !20, !27, !42}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 42, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 90, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "EXIT_TIMEDOUT", value: 124)
!24 = !DIEnumerator(name: "EXIT_CANCELED", value: 125)
!25 = !DIEnumerator(name: "EXIT_CANNOT_INVOKE", value: 126)
!26 = !DIEnumerator(name: "EXIT_ENOENT", value: 127)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 46, baseType: !7, size: 32, elements: !29)
!28 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!30 = !DIEnumerator(name: "_ISupper", value: 256)
!31 = !DIEnumerator(name: "_ISlower", value: 512)
!32 = !DIEnumerator(name: "_ISalpha", value: 1024)
!33 = !DIEnumerator(name: "_ISdigit", value: 2048)
!34 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!35 = !DIEnumerator(name: "_ISspace", value: 8192)
!36 = !DIEnumerator(name: "_ISprint", value: 16384)
!37 = !DIEnumerator(name: "_ISgraph", value: 32768)
!38 = !DIEnumerator(name: "_ISblank", value: 1)
!39 = !DIEnumerator(name: "_IScntrl", value: 2)
!40 = !DIEnumerator(name: "_ISpunct", value: 4)
!41 = !DIEnumerator(name: "_ISalnum", value: 8)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !43, line: 30, baseType: !7, size: 32, elements: !44)
!43 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!44 = !{!45, !46, !47, !48, !49}
!45 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!46 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!47 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!48 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!49 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!50 = !{!51, !53, !54, !59, !60, !61, !63, !65, !66, !69, !71, !80}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !55, line: 102, baseType: !56)
!55 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !57, line: 73, baseType: !58)
!57 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!58 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !62, line: 46, baseType: !58)
!62 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!65 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !67, line: 79, baseType: !68)
!67 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !57, line: 146, baseType: !7)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !67, line: 64, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !57, line: 147, baseType: !7)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !73, line: 42, size: 256, elements: !74)
!73 = !DIFile(filename: "/usr/include/grp.h", directory: "", checksumkind: CSK_MD5, checksum: "17838c4acd24e08e5bed6821e9e2c084")
!74 = !{!75, !76, !77, !78}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !72, file: !73, line: 44, baseType: !51, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !72, file: !73, line: 45, baseType: !51, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !72, file: !73, line: 46, baseType: !70, size: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !72, file: !73, line: 47, baseType: !79, size: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !55, line: 87, baseType: !81)
!81 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!82 = !{!83, !0}
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !85, file: !21, line: 575, type: !59, isLocal: true, isDefinition: true)
!85 = distinct !DISubprogram(name: "oputs_", scope: !21, file: !21, line: 573, type: !86, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !88)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !63, !63}
!88 = !{!89, !90, !91, !94, !96, !97, !98, !102, !103, !104, !105, !107, !161, !162, !163, !165, !166}
!89 = !DILocalVariable(name: "program", arg: 1, scope: !85, file: !21, line: 573, type: !63)
!90 = !DILocalVariable(name: "option", arg: 2, scope: !85, file: !21, line: 573, type: !63)
!91 = !DILocalVariable(name: "term", scope: !92, file: !21, line: 585, type: !63)
!92 = distinct !DILexicalBlock(scope: !93, file: !21, line: 582, column: 5)
!93 = distinct !DILexicalBlock(scope: !85, file: !21, line: 581, column: 7)
!94 = !DILocalVariable(name: "double_space", scope: !85, file: !21, line: 594, type: !95)
!95 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!96 = !DILocalVariable(name: "first_word", scope: !85, file: !21, line: 595, type: !63)
!97 = !DILocalVariable(name: "option_text", scope: !85, file: !21, line: 596, type: !63)
!98 = !DILocalVariable(name: "s", scope: !99, file: !21, line: 608, type: !63)
!99 = distinct !DILexicalBlock(scope: !100, file: !21, line: 605, column: 5)
!100 = distinct !DILexicalBlock(scope: !101, file: !21, line: 604, column: 12)
!101 = distinct !DILexicalBlock(scope: !85, file: !21, line: 597, column: 7)
!102 = !DILocalVariable(name: "spaces", scope: !99, file: !21, line: 609, type: !61)
!103 = !DILocalVariable(name: "anchor_len", scope: !85, file: !21, line: 620, type: !61)
!104 = !DILocalVariable(name: "desc_text", scope: !85, file: !21, line: 625, type: !63)
!105 = !DILocalVariable(name: "__ptr", scope: !106, file: !21, line: 644, type: !63)
!106 = distinct !DILexicalBlock(scope: !85, file: !21, line: 644, column: 3)
!107 = !DILocalVariable(name: "__stream", scope: !106, file: !21, line: 644, type: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !110, line: 7, baseType: !111)
!110 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !112, line: 49, size: 1728, elements: !113)
!112 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !129, !131, !132, !133, !135, !136, !138, !142, !145, !147, !150, !153, !154, !155, !156, !157}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !111, file: !112, line: 51, baseType: !59, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !111, file: !112, line: 54, baseType: !51, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !111, file: !112, line: 55, baseType: !51, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !111, file: !112, line: 56, baseType: !51, size: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !111, file: !112, line: 57, baseType: !51, size: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !111, file: !112, line: 58, baseType: !51, size: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !111, file: !112, line: 59, baseType: !51, size: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !111, file: !112, line: 60, baseType: !51, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !111, file: !112, line: 61, baseType: !51, size: 64, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !111, file: !112, line: 64, baseType: !51, size: 64, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !111, file: !112, line: 65, baseType: !51, size: 64, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !111, file: !112, line: 66, baseType: !51, size: 64, offset: 704)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !111, file: !112, line: 68, baseType: !127, size: 64, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !112, line: 36, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !111, file: !112, line: 70, baseType: !130, size: 64, offset: 832)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !111, file: !112, line: 72, baseType: !59, size: 32, offset: 896)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !111, file: !112, line: 73, baseType: !59, size: 32, offset: 928)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !111, file: !112, line: 74, baseType: !134, size: 64, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !57, line: 152, baseType: !81)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !111, file: !112, line: 77, baseType: !60, size: 16, offset: 1024)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !111, file: !112, line: 78, baseType: !137, size: 8, offset: 1040)
!137 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !111, file: !112, line: 79, baseType: !139, size: 8, offset: 1048)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 8, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 1)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !111, file: !112, line: 81, baseType: !143, size: 64, offset: 1088)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !112, line: 43, baseType: null)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !111, file: !112, line: 89, baseType: !146, size: 64, offset: 1152)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !57, line: 153, baseType: !81)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !111, file: !112, line: 91, baseType: !148, size: 64, offset: 1216)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !112, line: 37, flags: DIFlagFwdDecl)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !111, file: !112, line: 92, baseType: !151, size: 64, offset: 1280)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !112, line: 38, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !111, file: !112, line: 93, baseType: !130, size: 64, offset: 1344)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !111, file: !112, line: 94, baseType: !53, size: 64, offset: 1408)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !111, file: !112, line: 95, baseType: !61, size: 64, offset: 1472)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !111, file: !112, line: 96, baseType: !59, size: 32, offset: 1536)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !111, file: !112, line: 98, baseType: !158, size: 160, offset: 1568)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 160, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 20)
!161 = !DILocalVariable(name: "__cnt", scope: !106, file: !21, line: 644, type: !61)
!162 = !DILocalVariable(name: "url_program", scope: !85, file: !21, line: 648, type: !63)
!163 = !DILocalVariable(name: "__ptr", scope: !164, file: !21, line: 686, type: !63)
!164 = distinct !DILexicalBlock(scope: !85, file: !21, line: 686, column: 3)
!165 = !DILocalVariable(name: "__stream", scope: !164, file: !21, line: 686, type: !108)
!166 = !DILocalVariable(name: "__cnt", scope: !164, file: !21, line: 686, type: !61)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 1536, elements: !177)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !170, line: 50, size: 256, elements: !171)
!170 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!171 = !{!172, !173, !174, !176}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !169, file: !170, line: 52, baseType: !63, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !169, file: !170, line: 55, baseType: !59, size: 32, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !169, file: !170, line: 56, baseType: !175, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !169, file: !170, line: 57, baseType: !59, size: 32, offset: 192)
!177 = !{!178}
!178 = !DISubrange(count: 6)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "Version", scope: !181, file: !182, line: 3, type: !63, isLocal: false, isDefinition: true)
!181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !182, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !183, splitDebugInlining: false, nameTableKind: None)
!182 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!183 = !{!179}
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "file_name", scope: !186, file: !187, line: 45, type: !63, isLocal: true, isDefinition: true)
!186 = distinct !DICompileUnit(language: DW_LANG_C99, file: !187, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !188, splitDebugInlining: false, nameTableKind: None)
!187 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!188 = !{!184, !189}
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !186, file: !187, line: 55, type: !95, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !193, file: !194, line: 66, type: !229, isLocal: false, isDefinition: true)
!193 = distinct !DICompileUnit(language: DW_LANG_C99, file: !194, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !195, globals: !196, splitDebugInlining: false, nameTableKind: None)
!194 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!195 = !{!53, !65}
!196 = !{!197, !223, !191, !225, !227}
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "old_file_name", scope: !199, file: !194, line: 304, type: !63, isLocal: true, isDefinition: true)
!199 = distinct !DISubprogram(name: "verror_at_line", scope: !194, file: !194, line: 298, type: !200, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !193, retainedNodes: !216)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !59, !59, !63, !7, !63, !202}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !203, line: 52, baseType: !204)
!203 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !205, line: 32, baseType: !206)
!205 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !207, baseType: !208)
!207 = !DIFile(filename: "lib/error.c", directory: "/src")
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !209, size: 256, elements: !210)
!209 = !DINamespace(name: "std", scope: null)
!210 = !{!211, !212, !213, !214, !215}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !208, file: !207, baseType: !53, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !208, file: !207, baseType: !53, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !208, file: !207, baseType: !53, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !208, file: !207, baseType: !59, size: 32, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !208, file: !207, baseType: !59, size: 32, offset: 224)
!216 = !{!217, !218, !219, !220, !221, !222}
!217 = !DILocalVariable(name: "status", arg: 1, scope: !199, file: !194, line: 298, type: !59)
!218 = !DILocalVariable(name: "errnum", arg: 2, scope: !199, file: !194, line: 298, type: !59)
!219 = !DILocalVariable(name: "file_name", arg: 3, scope: !199, file: !194, line: 298, type: !63)
!220 = !DILocalVariable(name: "line_number", arg: 4, scope: !199, file: !194, line: 298, type: !7)
!221 = !DILocalVariable(name: "message", arg: 5, scope: !199, file: !194, line: 298, type: !63)
!222 = !DILocalVariable(name: "args", arg: 6, scope: !199, file: !194, line: 298, type: !202)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "old_line_number", scope: !199, file: !194, line: 305, type: !7, isLocal: true, isDefinition: true)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "error_message_count", scope: !193, file: !194, line: 69, type: !7, isLocal: false, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !193, file: !194, line: 295, type: !59, isLocal: false, isDefinition: true)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{null}
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "program_name", scope: !234, file: !235, line: 31, type: !63, isLocal: false, isDefinition: true)
!234 = distinct !DICompileUnit(language: DW_LANG_C99, file: !235, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !236, globals: !237, splitDebugInlining: false, nameTableKind: None)
!235 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!236 = !{!51}
!237 = !{!232}
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "utf07FF", scope: !240, file: !241, line: 46, type: !271, isLocal: true, isDefinition: true)
!240 = distinct !DISubprogram(name: "proper_name_lite", scope: !241, file: !241, line: 38, type: !242, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !244, retainedNodes: !246)
!241 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!242 = !DISubroutineType(types: !243)
!243 = !{!63, !63, !63}
!244 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !245, splitDebugInlining: false, nameTableKind: None)
!245 = !{!238}
!246 = !{!247, !248, !249, !250, !255}
!247 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !240, file: !241, line: 38, type: !63)
!248 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !240, file: !241, line: 38, type: !63)
!249 = !DILocalVariable(name: "translation", scope: !240, file: !241, line: 40, type: !63)
!250 = !DILocalVariable(name: "w", scope: !240, file: !241, line: 47, type: !251)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !252, line: 37, baseType: !253)
!252 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !57, line: 57, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !57, line: 42, baseType: !7)
!255 = !DILocalVariable(name: "mbs", scope: !240, file: !241, line: 48, type: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !257, line: 6, baseType: !258)
!257 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !259, line: 21, baseType: !260)
!259 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !259, line: 13, size: 64, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !260, file: !259, line: 15, baseType: !59, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !260, file: !259, line: 20, baseType: !264, size: 32, offset: 32)
!264 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !260, file: !259, line: 16, size: 32, elements: !265)
!265 = !{!266, !267}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !264, file: !259, line: 18, baseType: !7, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !264, file: !259, line: 19, baseType: !268, size: 32)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 32, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 4)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 16, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 2)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !276, file: !277, line: 76, type: !345, isLocal: false, isDefinition: true)
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !277, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !278, retainedTypes: !284, globals: !285, splitDebugInlining: false, nameTableKind: None)
!277 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!278 = !{!5, !279, !27}
!279 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 254, baseType: !7, size: 32, elements: !280)
!280 = !{!281, !282, !283}
!281 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!282 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!283 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!284 = !{!59, !60, !61}
!285 = !{!274, !286, !292, !304, !306, !311, !334, !341, !343}
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !276, file: !277, line: 92, type: !288, isLocal: false, isDefinition: true)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 320, elements: !290)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!290 = !{!291}
!291 = !DISubrange(count: 10)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !276, file: !277, line: 1040, type: !294, isLocal: false, isDefinition: true)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !277, line: 56, size: 448, elements: !295)
!295 = !{!296, !297, !298, !302, !303}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !294, file: !277, line: 59, baseType: !5, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !294, file: !277, line: 62, baseType: !59, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !294, file: !277, line: 66, baseType: !299, size: 256, offset: 64)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 8)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !294, file: !277, line: 69, baseType: !63, size: 64, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !294, file: !277, line: 72, baseType: !63, size: 64, offset: 384)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !276, file: !277, line: 107, type: !294, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "slot0", scope: !276, file: !277, line: 831, type: !308, isLocal: true, isDefinition: true)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 2048, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 256)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "quote", scope: !313, file: !277, line: 228, type: !332, isLocal: true, isDefinition: true)
!313 = distinct !DISubprogram(name: "gettext_quote", scope: !277, file: !277, line: 197, type: !314, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !276, retainedNodes: !316)
!314 = !DISubroutineType(types: !315)
!315 = !{!63, !63, !5}
!316 = !{!317, !318, !319, !320, !321}
!317 = !DILocalVariable(name: "msgid", arg: 1, scope: !313, file: !277, line: 197, type: !63)
!318 = !DILocalVariable(name: "s", arg: 2, scope: !313, file: !277, line: 197, type: !5)
!319 = !DILocalVariable(name: "translation", scope: !313, file: !277, line: 199, type: !63)
!320 = !DILocalVariable(name: "w", scope: !313, file: !277, line: 229, type: !251)
!321 = !DILocalVariable(name: "mbs", scope: !313, file: !277, line: 230, type: !322)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !257, line: 6, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !259, line: 21, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !259, line: 13, size: 64, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !324, file: !259, line: 15, baseType: !59, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !324, file: !259, line: 20, baseType: !328, size: 32, offset: 32)
!328 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !324, file: !259, line: 16, size: 32, elements: !329)
!329 = !{!330, !331}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !328, file: !259, line: 18, baseType: !7, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !328, file: !259, line: 19, baseType: !268, size: 32)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 64, elements: !333)
!333 = !{!273, !270}
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "slotvec", scope: !276, file: !277, line: 834, type: !336, isLocal: true, isDefinition: true)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !277, line: 823, size: 128, elements: !338)
!338 = !{!339, !340}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !337, file: !277, line: 825, baseType: !61, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !337, file: !277, line: 826, baseType: !51, size: 64, offset: 64)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "nslots", scope: !276, file: !277, line: 832, type: !59, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "slotvec0", scope: !276, file: !277, line: 833, type: !337, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !346, size: 704, elements: !347)
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!347 = !{!348}
!348 = !DISubrange(count: 11)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !351, file: !352, line: 26, type: !354, isLocal: false, isDefinition: true)
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !353, splitDebugInlining: false, nameTableKind: None)
!352 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!353 = !{!349}
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 376, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 47)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "exit_failure", scope: !359, file: !360, line: 24, type: !362, isLocal: false, isDefinition: true)
!359 = distinct !DICompileUnit(language: DW_LANG_C99, file: !360, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !361, splitDebugInlining: false, nameTableKind: None)
!360 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!361 = !{!357}
!362 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !59)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "internal_state", scope: !365, file: !366, line: 97, type: !369, isLocal: true, isDefinition: true)
!365 = distinct !DICompileUnit(language: DW_LANG_C99, file: !366, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !367, globals: !368, splitDebugInlining: false, nameTableKind: None)
!366 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!367 = !{!53, !61, !65}
!368 = !{!363}
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !257, line: 6, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !259, line: 21, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !259, line: 13, size: 64, elements: !372)
!372 = !{!373, !374}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !371, file: !259, line: 15, baseType: !59, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !371, file: !259, line: 20, baseType: !375, size: 32, offset: 32)
!375 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !371, file: !259, line: 16, size: 32, elements: !376)
!376 = !{!377, !378}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !375, file: !259, line: 18, baseType: !7, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !375, file: !259, line: 19, baseType: !268, size: 32)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !381, file: !382, line: 211, type: !568, isLocal: true, isDefinition: true)
!381 = distinct !DISubprogram(name: "printf_fetchargs", scope: !382, file: !382, line: 42, type: !383, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !559, retainedNodes: !563)
!382 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!383 = !DISubroutineType(types: !384)
!384 = !{!59, !385, !395}
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !205, line: 14, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !387, baseType: !388)
!387 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !209, size: 256, elements: !389)
!389 = !{!390, !391, !392, !393, !394}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !388, file: !387, baseType: !53, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !388, file: !387, baseType: !53, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !388, file: !387, baseType: !53, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !388, file: !387, baseType: !59, size: 32, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !388, file: !387, baseType: !59, size: 32, offset: 224)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !397, line: 185, baseType: !398)
!397 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 179, size: 1920, elements: !399)
!399 = !{!400, !401, !555}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !398, file: !397, line: 181, baseType: !61, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !398, file: !397, line: 182, baseType: !402, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !397, line: 174, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 111, size: 256, elements: !405)
!405 = !{!406, !457}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !404, file: !397, line: 113, baseType: !407, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !397, line: 108, baseType: !408)
!408 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !397, line: 47, baseType: !7, size: 32, elements: !409)
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456}
!410 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!411 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!412 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!413 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!414 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!415 = !DIEnumerator(name: "TYPE_INT", value: 5)
!416 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!417 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!418 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!419 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!420 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!421 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!422 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!423 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!424 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!425 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!426 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!427 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!428 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!429 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!430 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!431 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!432 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!433 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!434 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!435 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!436 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!437 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!438 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!439 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!440 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!441 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!442 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!443 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!444 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!445 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!446 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!447 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!448 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!449 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!450 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!451 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!452 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!453 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!454 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!455 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!456 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !404, file: !397, line: 172, baseType: !458, size: 128, offset: 128)
!458 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !404, file: !397, line: 114, size: 128, elements: !459)
!459 = !{!460, !461, !462, !464, !465, !466, !467, !468, !469, !471, !473, !477, !481, !484, !487, !490, !492, !495, !498, !500, !502, !504, !506, !508, !510, !512, !514, !516, !518, !520, !521, !524, !525, !529, !530, !532, !534, !535, !537, !539, !541, !543, !545, !547, !549, !551, !553}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !458, file: !397, line: 116, baseType: !137, size: 8)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !458, file: !397, line: 117, baseType: !65, size: 8)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !458, file: !397, line: 118, baseType: !463, size: 16)
!463 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !458, file: !397, line: 119, baseType: !60, size: 16)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !458, file: !397, line: 120, baseType: !59, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !458, file: !397, line: 121, baseType: !7, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !458, file: !397, line: 122, baseType: !81, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !458, file: !397, line: 123, baseType: !58, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !458, file: !397, line: 124, baseType: !470, size: 64)
!470 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !458, file: !397, line: 125, baseType: !472, size: 64)
!472 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !458, file: !397, line: 126, baseType: !474, size: 8)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !475, line: 24, baseType: !476)
!475 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !57, line: 37, baseType: !137)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !458, file: !397, line: 127, baseType: !478, size: 8)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !479, line: 24, baseType: !480)
!479 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !57, line: 38, baseType: !65)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !458, file: !397, line: 128, baseType: !482, size: 16)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !475, line: 25, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !57, line: 39, baseType: !463)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !458, file: !397, line: 129, baseType: !485, size: 16)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !479, line: 25, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !57, line: 40, baseType: !60)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !458, file: !397, line: 130, baseType: !488, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !475, line: 26, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !57, line: 41, baseType: !59)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !458, file: !397, line: 131, baseType: !491, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !479, line: 26, baseType: !254)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !458, file: !397, line: 132, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !475, line: 27, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !57, line: 44, baseType: !81)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !458, file: !397, line: 133, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !479, line: 27, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !57, line: 45, baseType: !58)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !458, file: !397, line: 134, baseType: !499, size: 8)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !55, line: 58, baseType: !137)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !458, file: !397, line: 135, baseType: !501, size: 8)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !55, line: 71, baseType: !65)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !458, file: !397, line: 136, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !55, line: 60, baseType: !81)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !458, file: !397, line: 137, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !55, line: 73, baseType: !58)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !458, file: !397, line: 138, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !55, line: 61, baseType: !81)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !458, file: !397, line: 139, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !55, line: 74, baseType: !58)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !458, file: !397, line: 140, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !55, line: 62, baseType: !81)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !458, file: !397, line: 141, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !55, line: 75, baseType: !58)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !458, file: !397, line: 142, baseType: !515, size: 32)
!515 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !458, file: !397, line: 143, baseType: !517, size: 64)
!517 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !458, file: !397, line: 144, baseType: !519, size: 128)
!519 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !458, file: !397, line: 145, baseType: !59, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !458, file: !397, line: 147, baseType: !522, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !523, line: 20, baseType: !7)
!523 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!524 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !458, file: !397, line: 149, baseType: !63, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !458, file: !397, line: 150, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !62, line: 74, baseType: !7)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !458, file: !397, line: 151, baseType: !53, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !458, file: !397, line: 152, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !458, file: !397, line: 153, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !458, file: !397, line: 154, baseType: !175, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !458, file: !397, line: 155, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !458, file: !397, line: 156, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !458, file: !397, line: 157, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !458, file: !397, line: 158, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !458, file: !397, line: 159, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !458, file: !397, line: 160, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !458, file: !397, line: 161, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !458, file: !397, line: 162, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !458, file: !397, line: 163, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !458, file: !397, line: 164, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !398, file: !397, line: 183, baseType: !556, size: 1792, offset: 128)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 1792, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 7)
!559 = distinct !DICompileUnit(language: DW_LANG_C99, file: !382, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !560, retainedTypes: !561, globals: !562, splitDebugInlining: false, nameTableKind: None)
!560 = !{!408}
!561 = !{!53}
!562 = !{!379}
!563 = !{!564, !565, !566, !567}
!564 = !DILocalVariable(name: "args", arg: 1, scope: !381, file: !382, line: 42, type: !385)
!565 = !DILocalVariable(name: "a", arg: 2, scope: !381, file: !382, line: 42, type: !395)
!566 = !DILocalVariable(name: "i", scope: !381, file: !382, line: 44, type: !61)
!567 = !DILocalVariable(name: "ap", scope: !381, file: !382, line: 45, type: !402)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 224, elements: !557)
!569 = distinct !DICompileUnit(language: DW_LANG_C99, file: !570, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!570 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!571 = distinct !DICompileUnit(language: DW_LANG_C99, file: !572, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !573, retainedTypes: !574, splitDebugInlining: false, nameTableKind: None)
!572 = !DIFile(filename: "lib/userspec.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9b1d112c5d74602907b912457199dc83")
!573 = !{!42}
!574 = !{!53, !66, !69}
!575 = distinct !DICompileUnit(language: DW_LANG_C99, file: !576, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !577, retainedTypes: !561, splitDebugInlining: false, nameTableKind: None)
!576 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!577 = !{!578}
!578 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !576, line: 40, baseType: !7, size: 32, elements: !579)
!579 = !{!580}
!580 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!581 = distinct !DICompileUnit(language: DW_LANG_C99, file: !582, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !583, retainedTypes: !614, splitDebugInlining: false, nameTableKind: None)
!582 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!583 = !{!584, !596}
!584 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !585, file: !582, line: 188, baseType: !7, size: 32, elements: !594)
!585 = distinct !DISubprogram(name: "x2nrealloc", scope: !582, file: !582, line: 176, type: !586, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !581, retainedNodes: !589)
!586 = !DISubroutineType(types: !587)
!587 = !{!53, !53, !588, !61}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!589 = !{!590, !591, !592, !593}
!590 = !DILocalVariable(name: "p", arg: 1, scope: !585, file: !582, line: 176, type: !53)
!591 = !DILocalVariable(name: "pn", arg: 2, scope: !585, file: !582, line: 176, type: !588)
!592 = !DILocalVariable(name: "s", arg: 3, scope: !585, file: !582, line: 176, type: !61)
!593 = !DILocalVariable(name: "n", scope: !585, file: !582, line: 178, type: !61)
!594 = !{!595}
!595 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!596 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !597, file: !582, line: 228, baseType: !7, size: 32, elements: !594)
!597 = distinct !DISubprogram(name: "xpalloc", scope: !582, file: !582, line: 223, type: !598, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !581, retainedNodes: !604)
!598 = !DISubroutineType(types: !599)
!599 = !{!53, !53, !600, !601, !603, !601}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !602, line: 130, baseType: !603)
!602 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !62, line: 35, baseType: !81)
!604 = !{!605, !606, !607, !608, !609, !610, !611, !612, !613}
!605 = !DILocalVariable(name: "pa", arg: 1, scope: !597, file: !582, line: 223, type: !53)
!606 = !DILocalVariable(name: "pn", arg: 2, scope: !597, file: !582, line: 223, type: !600)
!607 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !597, file: !582, line: 223, type: !601)
!608 = !DILocalVariable(name: "n_max", arg: 4, scope: !597, file: !582, line: 223, type: !603)
!609 = !DILocalVariable(name: "s", arg: 5, scope: !597, file: !582, line: 223, type: !601)
!610 = !DILocalVariable(name: "n0", scope: !597, file: !582, line: 230, type: !601)
!611 = !DILocalVariable(name: "n", scope: !597, file: !582, line: 237, type: !601)
!612 = !DILocalVariable(name: "nbytes", scope: !597, file: !582, line: 248, type: !601)
!613 = !DILocalVariable(name: "adjusted_nbytes", scope: !597, file: !582, line: 252, type: !601)
!614 = !{!51, !53, !95, !81, !58}
!615 = distinct !DICompileUnit(language: DW_LANG_C99, file: !616, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!616 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!617 = distinct !DICompileUnit(language: DW_LANG_C99, file: !618, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!618 = !DIFile(filename: "lib/xgetgroups.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b5210c3f5d54a118d66836a8f2f46b25")
!619 = distinct !DICompileUnit(language: DW_LANG_C99, file: !620, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !621, retainedTypes: !622, splitDebugInlining: false, nameTableKind: None)
!620 = !DIFile(filename: "lib/xstrtoul.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2b318e5928e8382cfa3ae094c8d00222")
!621 = !{!42, !27}
!622 = !{!59, !60, !51, !95, !58}
!623 = distinct !DICompileUnit(language: DW_LANG_C99, file: !624, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !621, retainedTypes: !625, splitDebugInlining: false, nameTableKind: None)
!624 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!625 = !{!59, !60, !51, !95, !58, !54}
!626 = distinct !DICompileUnit(language: DW_LANG_C99, file: !627, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !561, splitDebugInlining: false, nameTableKind: None)
!627 = !DIFile(filename: "lib/vasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a4c54d4c65964ef3a11b7593d1072df")
!628 = distinct !DICompileUnit(language: DW_LANG_C99, file: !629, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!629 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!630 = distinct !DICompileUnit(language: DW_LANG_C99, file: !631, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!631 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!632 = distinct !DICompileUnit(language: DW_LANG_C99, file: !633, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !561, splitDebugInlining: false, nameTableKind: None)
!633 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!634 = distinct !DICompileUnit(language: DW_LANG_C99, file: !635, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !561, splitDebugInlining: false, nameTableKind: None)
!635 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!636 = distinct !DICompileUnit(language: DW_LANG_C99, file: !637, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !638, splitDebugInlining: false, nameTableKind: None)
!637 = !DIFile(filename: "lib/umaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "afa759af6e92fed26f32f683da6c23a8")
!638 = !{!54}
!639 = distinct !DICompileUnit(language: DW_LANG_C99, file: !640, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !641, retainedTypes: !676, splitDebugInlining: false, nameTableKind: None)
!640 = !DIFile(filename: "lib/mgetgroups.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c6d0df677a26dbd2695c193e3d6de3d1")
!641 = !{!642}
!642 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !643, file: !640, line: 79, baseType: !7, size: 32, elements: !674)
!643 = distinct !DISubprogram(name: "mgetgroups", scope: !640, file: !640, line: 66, type: !644, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !639, retainedNodes: !648)
!644 = !DISubroutineType(types: !645)
!645 = !{!59, !63, !69, !646}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!648 = !{!649, !650, !651, !652, !655, !656, !658, !659, !660, !661, !666, !667, !668, !671, !672}
!649 = !DILocalVariable(name: "username", arg: 1, scope: !643, file: !640, line: 66, type: !63)
!650 = !DILocalVariable(name: "gid", arg: 2, scope: !643, file: !640, line: 66, type: !69)
!651 = !DILocalVariable(name: "groups", arg: 3, scope: !643, file: !640, line: 66, type: !646)
!652 = !DILocalVariable(name: "max_n_groups", scope: !653, file: !640, line: 80, type: !59)
!653 = distinct !DILexicalBlock(scope: !654, file: !640, line: 78, column: 5)
!654 = distinct !DILexicalBlock(scope: !643, file: !640, line: 77, column: 7)
!655 = !DILocalVariable(name: "g", scope: !653, file: !640, line: 82, type: !647)
!656 = !DILocalVariable(name: "last_n_groups", scope: !657, file: !640, line: 88, type: !59)
!657 = distinct !DILexicalBlock(scope: !653, file: !640, line: 87, column: 9)
!658 = !DILocalVariable(name: "ng", scope: !657, file: !640, line: 91, type: !59)
!659 = !DILocalVariable(name: "h", scope: !657, file: !640, line: 98, type: !647)
!660 = !DILocalVariable(name: "max_n_groups", scope: !643, file: !640, line: 118, type: !59)
!661 = !DILocalVariable(name: "g", scope: !662, file: !640, line: 129, type: !647)
!662 = distinct !DILexicalBlock(scope: !663, file: !640, line: 128, column: 9)
!663 = distinct !DILexicalBlock(scope: !664, file: !640, line: 127, column: 11)
!664 = distinct !DILexicalBlock(scope: !665, file: !640, line: 126, column: 5)
!665 = distinct !DILexicalBlock(scope: !643, file: !640, line: 125, column: 7)
!666 = !DILocalVariable(name: "g", scope: !643, file: !640, line: 142, type: !647)
!667 = !DILocalVariable(name: "ng", scope: !643, file: !640, line: 146, type: !59)
!668 = !DILocalVariable(name: "first", scope: !669, file: !640, line: 183, type: !69)
!669 = distinct !DILexicalBlock(scope: !670, file: !640, line: 182, column: 5)
!670 = distinct !DILexicalBlock(scope: !643, file: !640, line: 181, column: 7)
!671 = !DILocalVariable(name: "groups_end", scope: !669, file: !640, line: 184, type: !647)
!672 = !DILocalVariable(name: "next", scope: !673, file: !640, line: 186, type: !647)
!673 = distinct !DILexicalBlock(scope: !669, file: !640, line: 186, column: 7)
!674 = !{!675}
!675 = !DIEnumerator(name: "N_GROUPS_INIT", value: 10)
!676 = !{!53, !69}
!677 = distinct !DICompileUnit(language: DW_LANG_C99, file: !678, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !679, splitDebugInlining: false, nameTableKind: None)
!678 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!679 = !{!95, !58, !53}
!680 = distinct !DICompileUnit(language: DW_LANG_C99, file: !681, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !560, retainedTypes: !682, splitDebugInlining: false, nameTableKind: None)
!681 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!682 = !{!51, !61, !53, !63, !7}
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !684, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!684 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!685 = distinct !DICompileUnit(language: DW_LANG_C99, file: !686, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!686 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!687 = distinct !DICompileUnit(language: DW_LANG_C99, file: !688, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !561, splitDebugInlining: false, nameTableKind: None)
!688 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!689 = distinct !DICompileUnit(language: DW_LANG_C99, file: !690, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !560, retainedTypes: !691, splitDebugInlining: false, nameTableKind: None)
!690 = !DIFile(filename: "lib/printf-parse.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8df94db1db3a2083e3b2e6f52a49af38")
!691 = !{!61, !692, !53, !747}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !397, line: 174, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 111, size: 256, elements: !695)
!695 = !{!696, !697}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !694, file: !397, line: 113, baseType: !407, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !694, file: !397, line: 172, baseType: !698, size: 128, offset: 128)
!698 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !694, file: !397, line: 114, size: 128, elements: !699)
!699 = !{!700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !698, file: !397, line: 116, baseType: !137, size: 8)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !698, file: !397, line: 117, baseType: !65, size: 8)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !698, file: !397, line: 118, baseType: !463, size: 16)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !698, file: !397, line: 119, baseType: !60, size: 16)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !698, file: !397, line: 120, baseType: !59, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !698, file: !397, line: 121, baseType: !7, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !698, file: !397, line: 122, baseType: !81, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !698, file: !397, line: 123, baseType: !58, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !698, file: !397, line: 124, baseType: !470, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !698, file: !397, line: 125, baseType: !472, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !698, file: !397, line: 126, baseType: !474, size: 8)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !698, file: !397, line: 127, baseType: !478, size: 8)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !698, file: !397, line: 128, baseType: !482, size: 16)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !698, file: !397, line: 129, baseType: !485, size: 16)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !698, file: !397, line: 130, baseType: !488, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !698, file: !397, line: 131, baseType: !491, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !698, file: !397, line: 132, baseType: !493, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !698, file: !397, line: 133, baseType: !496, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !698, file: !397, line: 134, baseType: !499, size: 8)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !698, file: !397, line: 135, baseType: !501, size: 8)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !698, file: !397, line: 136, baseType: !503, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !698, file: !397, line: 137, baseType: !505, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !698, file: !397, line: 138, baseType: !507, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !698, file: !397, line: 139, baseType: !509, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !698, file: !397, line: 140, baseType: !511, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !698, file: !397, line: 141, baseType: !513, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !698, file: !397, line: 142, baseType: !515, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !698, file: !397, line: 143, baseType: !517, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !698, file: !397, line: 144, baseType: !519, size: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !698, file: !397, line: 145, baseType: !59, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !698, file: !397, line: 147, baseType: !522, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !698, file: !397, line: 149, baseType: !63, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !698, file: !397, line: 150, baseType: !526, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !698, file: !397, line: 151, baseType: !53, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !698, file: !397, line: 152, baseType: !531, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !698, file: !397, line: 153, baseType: !533, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !698, file: !397, line: 154, baseType: !175, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !698, file: !397, line: 155, baseType: !536, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !698, file: !397, line: 156, baseType: !538, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !698, file: !397, line: 157, baseType: !540, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !698, file: !397, line: 158, baseType: !542, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !698, file: !397, line: 159, baseType: !544, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !698, file: !397, line: 160, baseType: !546, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !698, file: !397, line: 161, baseType: !548, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !698, file: !397, line: 162, baseType: !550, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !698, file: !397, line: 163, baseType: !552, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !698, file: !397, line: 164, baseType: !554, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_directive", file: !749, line: 67, baseType: !750)
!749 = !DIFile(filename: "./lib/printf-parse.h", directory: "/src", checksumkind: CSK_MD5, checksum: "237aad770a29c3543ea42bd8398d6057")
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !749, line: 53, size: 704, elements: !751)
!751 = !{!752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "dir_start", scope: !750, file: !749, line: 55, baseType: !63, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "dir_end", scope: !750, file: !749, line: 56, baseType: !63, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !750, file: !749, line: 57, baseType: !59, size: 32, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "width_start", scope: !750, file: !749, line: 58, baseType: !63, size: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "width_end", scope: !750, file: !749, line: 59, baseType: !63, size: 64, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "width_arg_index", scope: !750, file: !749, line: 60, baseType: !61, size: 64, offset: 320)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "precision_start", scope: !750, file: !749, line: 61, baseType: !63, size: 64, offset: 384)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "precision_end", scope: !750, file: !749, line: 62, baseType: !63, size: 64, offset: 448)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "precision_arg_index", scope: !750, file: !749, line: 63, baseType: !61, size: 64, offset: 512)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "conversion", scope: !750, file: !749, line: 64, baseType: !52, size: 8, offset: 576)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !750, file: !749, line: 65, baseType: !61, size: 64, offset: 640)
!763 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!764 = !{i32 7, !"Dwarf Version", i32 5}
!765 = !{i32 2, !"Debug Info Version", i32 3}
!766 = !{i32 1, !"wchar_size", i32 4}
!767 = !{i32 1, !"branch-target-enforcement", i32 0}
!768 = !{i32 1, !"sign-return-address", i32 0}
!769 = !{i32 1, !"sign-return-address-all", i32 0}
!770 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!771 = !{i32 7, !"PIC Level", i32 2}
!772 = !{i32 7, !"PIE Level", i32 2}
!773 = !{i32 7, !"uwtable", i32 1}
!774 = !{i32 7, !"frame-pointer", i32 1}
!775 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 179, type: !776, scopeLine: 180, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !778)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !59}
!778 = !{!779}
!779 = !DILocalVariable(name: "status", arg: 1, scope: !775, file: !3, line: 179, type: !59)
!780 = !DILocation(line: 0, scope: !775)
!781 = !DILocation(line: 181, column: 14, scope: !782)
!782 = distinct !DILexicalBlock(scope: !775, file: !3, line: 181, column: 7)
!783 = !DILocation(line: 181, column: 7, scope: !775)
!784 = !DILocation(line: 182, column: 5, scope: !785)
!785 = distinct !DILexicalBlock(scope: !782, file: !3, line: 182, column: 5)
!786 = !{!787, !787, i64 0}
!787 = !{!"any pointer", !788, i64 0}
!788 = !{!"omnipotent char", !789, i64 0}
!789 = !{!"Simple C/C++ TBAA"}
!790 = !DILocation(line: 185, column: 7, scope: !791)
!791 = distinct !DILexicalBlock(scope: !782, file: !3, line: 184, column: 5)
!792 = !DILocation(line: 188, column: 7, scope: !791)
!793 = !DILocation(line: 193, column: 7, scope: !791)
!794 = !DILocation(line: 197, column: 7, scope: !791)
!795 = !DILocation(line: 201, column: 7, scope: !791)
!796 = !DILocation(line: 206, column: 7, scope: !791)
!797 = !DILocation(line: 207, column: 7, scope: !791)
!798 = !DILocation(line: 208, column: 7, scope: !791)
!799 = !DILocalVariable(name: "program", arg: 1, scope: !800, file: !21, line: 824, type: !63)
!800 = distinct !DISubprogram(name: "emit_exec_status", scope: !21, file: !21, line: 824, type: !801, scopeLine: 825, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !803)
!801 = !DISubroutineType(types: !802)
!802 = !{null, !63}
!803 = !{!799}
!804 = !DILocation(line: 0, scope: !800, inlinedAt: !805)
!805 = distinct !DILocation(line: 212, column: 7, scope: !791)
!806 = !DILocation(line: 826, column: 7, scope: !800, inlinedAt: !805)
!807 = !DILocalVariable(name: "program", arg: 1, scope: !808, file: !21, line: 836, type: !63)
!808 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !21, file: !21, line: 836, type: !801, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !809)
!809 = !{!807, !810, !817, !818, !820, !821}
!810 = !DILocalVariable(name: "infomap", scope: !808, file: !21, line: 838, type: !811)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !812, size: 896, elements: !557)
!812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !808, file: !21, line: 838, size: 128, elements: !814)
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !813, file: !21, line: 838, baseType: !63, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !813, file: !21, line: 838, baseType: !63, size: 64, offset: 64)
!817 = !DILocalVariable(name: "node", scope: !808, file: !21, line: 848, type: !63)
!818 = !DILocalVariable(name: "map_prog", scope: !808, file: !21, line: 849, type: !819)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!820 = !DILocalVariable(name: "lc_messages", scope: !808, file: !21, line: 861, type: !63)
!821 = !DILocalVariable(name: "url_program", scope: !808, file: !21, line: 874, type: !63)
!822 = !DILocation(line: 0, scope: !808, inlinedAt: !823)
!823 = distinct !DILocation(line: 213, column: 7, scope: !791)
!824 = !DILocation(line: 838, column: 3, scope: !808, inlinedAt: !823)
!825 = !DILocation(line: 838, column: 67, scope: !808, inlinedAt: !823)
!826 = !DILocation(line: 849, column: 36, scope: !808, inlinedAt: !823)
!827 = !DILocation(line: 851, column: 3, scope: !808, inlinedAt: !823)
!828 = !DILocalVariable(name: "__s1", arg: 1, scope: !829, file: !830, line: 1359, type: !63)
!829 = distinct !DISubprogram(name: "streq", scope: !830, file: !830, line: 1359, type: !831, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !833)
!830 = !DIFile(filename: "./lib/string.h", directory: "/src")
!831 = !DISubroutineType(types: !832)
!832 = !{!95, !63, !63}
!833 = !{!828, !834}
!834 = !DILocalVariable(name: "__s2", arg: 2, scope: !829, file: !830, line: 1359, type: !63)
!835 = !DILocation(line: 0, scope: !829, inlinedAt: !836)
!836 = distinct !DILocation(line: 851, column: 33, scope: !808, inlinedAt: !823)
!837 = !DILocation(line: 1361, column: 11, scope: !829, inlinedAt: !836)
!838 = !DILocation(line: 1361, column: 10, scope: !829, inlinedAt: !836)
!839 = !DILocation(line: 852, column: 13, scope: !808, inlinedAt: !823)
!840 = !DILocation(line: 851, column: 20, scope: !808, inlinedAt: !823)
!841 = !{!842, !787, i64 0}
!842 = !{!"infomap", !787, i64 0, !787, i64 8}
!843 = !DILocation(line: 851, column: 10, scope: !808, inlinedAt: !823)
!844 = !DILocation(line: 851, column: 28, scope: !808, inlinedAt: !823)
!845 = distinct !{!845, !827, !839, !846}
!846 = !{!"llvm.loop.mustprogress"}
!847 = !DILocation(line: 854, column: 17, scope: !848, inlinedAt: !823)
!848 = distinct !DILexicalBlock(scope: !808, file: !21, line: 854, column: 7)
!849 = !{!842, !787, i64 8}
!850 = !DILocation(line: 854, column: 7, scope: !848, inlinedAt: !823)
!851 = !DILocation(line: 854, column: 7, scope: !808, inlinedAt: !823)
!852 = !DILocation(line: 857, column: 3, scope: !808, inlinedAt: !823)
!853 = !DILocation(line: 861, column: 29, scope: !808, inlinedAt: !823)
!854 = !DILocation(line: 862, column: 7, scope: !855, inlinedAt: !823)
!855 = distinct !DILexicalBlock(scope: !808, file: !21, line: 862, column: 7)
!856 = !DILocation(line: 862, column: 19, scope: !855, inlinedAt: !823)
!857 = !DILocation(line: 862, column: 22, scope: !855, inlinedAt: !823)
!858 = !DILocation(line: 862, column: 7, scope: !808, inlinedAt: !823)
!859 = !DILocation(line: 868, column: 7, scope: !860, inlinedAt: !823)
!860 = distinct !DILexicalBlock(scope: !855, file: !21, line: 863, column: 5)
!861 = !DILocation(line: 870, column: 5, scope: !860, inlinedAt: !823)
!862 = !DILocation(line: 0, scope: !829, inlinedAt: !863)
!863 = distinct !DILocation(line: 874, column: 29, scope: !808, inlinedAt: !823)
!864 = !DILocation(line: 875, column: 3, scope: !808, inlinedAt: !823)
!865 = !DILocation(line: 877, column: 3, scope: !808, inlinedAt: !823)
!866 = !DILocation(line: 879, column: 1, scope: !808, inlinedAt: !823)
!867 = !DILocation(line: 215, column: 3, scope: !775)
!868 = !DISubprogram(name: "dcgettext", scope: !869, file: !869, line: 51, type: !870, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !872)
!869 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!870 = !DISubroutineType(types: !871)
!871 = !{!51, !63, !63, !59}
!872 = !{}
!873 = !DISubprogram(name: "fputs_unlocked", scope: !203, file: !203, line: 691, type: !874, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !872)
!874 = !DISubroutineType(types: !875)
!875 = !{!59, !876, !877}
!876 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !63)
!877 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !108)
!878 = !DILocation(line: 0, scope: !85)
!879 = !DILocation(line: 581, column: 7, scope: !93)
!880 = !{!881, !881, i64 0}
!881 = !{!"int", !788, i64 0}
!882 = !DILocation(line: 581, column: 19, scope: !93)
!883 = !DILocation(line: 581, column: 7, scope: !85)
!884 = !DILocation(line: 585, column: 26, scope: !92)
!885 = !DILocation(line: 0, scope: !92)
!886 = !DILocation(line: 586, column: 23, scope: !92)
!887 = !DILocation(line: 586, column: 28, scope: !92)
!888 = !DILocation(line: 586, column: 32, scope: !92)
!889 = !{!788, !788, i64 0}
!890 = !DILocation(line: 586, column: 38, scope: !92)
!891 = !DILocation(line: 0, scope: !829, inlinedAt: !892)
!892 = distinct !DILocation(line: 586, column: 41, scope: !92)
!893 = !DILocation(line: 1361, column: 11, scope: !829, inlinedAt: !892)
!894 = !DILocation(line: 1361, column: 10, scope: !829, inlinedAt: !892)
!895 = !DILocation(line: 586, column: 19, scope: !92)
!896 = !DILocation(line: 587, column: 5, scope: !92)
!897 = !DILocation(line: 588, column: 7, scope: !898)
!898 = distinct !DILexicalBlock(scope: !85, file: !21, line: 588, column: 7)
!899 = !DILocation(line: 588, column: 7, scope: !85)
!900 = !DILocation(line: 590, column: 7, scope: !901)
!901 = distinct !DILexicalBlock(scope: !898, file: !21, line: 589, column: 5)
!902 = !DILocation(line: 591, column: 7, scope: !901)
!903 = !DILocation(line: 595, column: 37, scope: !85)
!904 = !DILocation(line: 595, column: 35, scope: !85)
!905 = !DILocation(line: 596, column: 29, scope: !85)
!906 = !DILocation(line: 597, column: 8, scope: !101)
!907 = !DILocation(line: 597, column: 7, scope: !85)
!908 = !DILocation(line: 604, column: 24, scope: !100)
!909 = !DILocation(line: 604, column: 12, scope: !101)
!910 = !DILocation(line: 0, scope: !99)
!911 = !DILocation(line: 610, column: 16, scope: !99)
!912 = !DILocation(line: 610, column: 7, scope: !99)
!913 = !DILocation(line: 611, column: 21, scope: !99)
!914 = !{!915, !915, i64 0}
!915 = !{!"short", !788, i64 0}
!916 = !DILocation(line: 611, column: 19, scope: !99)
!917 = !DILocation(line: 611, column: 16, scope: !99)
!918 = !DILocation(line: 610, column: 30, scope: !99)
!919 = distinct !{!919, !912, !913, !846}
!920 = !DILocation(line: 612, column: 18, scope: !921)
!921 = distinct !DILexicalBlock(scope: !99, file: !21, line: 612, column: 11)
!922 = !DILocation(line: 612, column: 11, scope: !99)
!923 = !DILocation(line: 620, column: 23, scope: !85)
!924 = !DILocation(line: 625, column: 39, scope: !85)
!925 = !DILocation(line: 626, column: 3, scope: !85)
!926 = !DILocation(line: 626, column: 10, scope: !85)
!927 = !DILocation(line: 626, column: 21, scope: !85)
!928 = !DILocation(line: 628, column: 44, scope: !929)
!929 = distinct !DILexicalBlock(scope: !930, file: !21, line: 628, column: 11)
!930 = distinct !DILexicalBlock(scope: !85, file: !21, line: 627, column: 5)
!931 = !DILocation(line: 628, column: 32, scope: !929)
!932 = !DILocation(line: 628, column: 49, scope: !929)
!933 = !DILocation(line: 628, column: 11, scope: !930)
!934 = !DILocation(line: 630, column: 11, scope: !935)
!935 = distinct !DILexicalBlock(scope: !930, file: !21, line: 630, column: 11)
!936 = !DILocation(line: 630, column: 11, scope: !930)
!937 = !DILocation(line: 632, column: 26, scope: !938)
!938 = distinct !DILexicalBlock(scope: !939, file: !21, line: 632, column: 15)
!939 = distinct !DILexicalBlock(scope: !935, file: !21, line: 631, column: 9)
!940 = !DILocation(line: 632, column: 34, scope: !938)
!941 = !DILocation(line: 632, column: 37, scope: !938)
!942 = !DILocation(line: 632, column: 15, scope: !939)
!943 = !DILocation(line: 636, column: 29, scope: !944)
!944 = distinct !DILexicalBlock(scope: !939, file: !21, line: 636, column: 15)
!945 = !DILocation(line: 640, column: 16, scope: !930)
!946 = distinct !{!946, !925, !947, !846}
!947 = !DILocation(line: 641, column: 5, scope: !85)
!948 = !DILocation(line: 644, column: 3, scope: !85)
!949 = !DILocation(line: 0, scope: !829, inlinedAt: !950)
!950 = distinct !DILocation(line: 648, column: 31, scope: !85)
!951 = !DILocation(line: 0, scope: !829, inlinedAt: !952)
!952 = distinct !DILocation(line: 649, column: 31, scope: !85)
!953 = !DILocation(line: 0, scope: !829, inlinedAt: !954)
!954 = distinct !DILocation(line: 650, column: 31, scope: !85)
!955 = !DILocation(line: 0, scope: !829, inlinedAt: !956)
!956 = distinct !DILocation(line: 651, column: 31, scope: !85)
!957 = !DILocation(line: 0, scope: !829, inlinedAt: !958)
!958 = distinct !DILocation(line: 652, column: 31, scope: !85)
!959 = !DILocation(line: 0, scope: !829, inlinedAt: !960)
!960 = distinct !DILocation(line: 653, column: 31, scope: !85)
!961 = !DILocation(line: 0, scope: !829, inlinedAt: !962)
!962 = distinct !DILocation(line: 654, column: 31, scope: !85)
!963 = !DILocation(line: 0, scope: !829, inlinedAt: !964)
!964 = distinct !DILocation(line: 655, column: 31, scope: !85)
!965 = !DILocation(line: 0, scope: !829, inlinedAt: !966)
!966 = distinct !DILocation(line: 656, column: 31, scope: !85)
!967 = !DILocation(line: 0, scope: !829, inlinedAt: !968)
!968 = distinct !DILocation(line: 657, column: 31, scope: !85)
!969 = !DILocation(line: 663, column: 7, scope: !970)
!970 = distinct !DILexicalBlock(scope: !85, file: !21, line: 663, column: 7)
!971 = !DILocation(line: 664, column: 7, scope: !970)
!972 = !DILocation(line: 664, column: 10, scope: !970)
!973 = !DILocation(line: 663, column: 7, scope: !85)
!974 = !DILocation(line: 669, column: 7, scope: !975)
!975 = distinct !DILexicalBlock(scope: !970, file: !21, line: 665, column: 5)
!976 = !DILocation(line: 671, column: 5, scope: !975)
!977 = !DILocation(line: 676, column: 7, scope: !978)
!978 = distinct !DILexicalBlock(scope: !970, file: !21, line: 673, column: 5)
!979 = !DILocation(line: 679, column: 3, scope: !85)
!980 = !DILocation(line: 683, column: 3, scope: !85)
!981 = !DILocation(line: 686, column: 3, scope: !85)
!982 = !DILocation(line: 688, column: 3, scope: !85)
!983 = !DILocation(line: 691, column: 3, scope: !85)
!984 = !DILocation(line: 695, column: 3, scope: !85)
!985 = !DILocation(line: 696, column: 1, scope: !85)
!986 = distinct !DISubprogram(name: "oprintf_", scope: !21, file: !21, line: 704, type: !987, scopeLine: 705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !989)
!987 = !DISubroutineType(types: !988)
!988 = !{null, !63, !63, null}
!989 = !{!990, !991, !992, !1004, !1005}
!990 = !DILocalVariable(name: "program", arg: 1, scope: !986, file: !21, line: 704, type: !63)
!991 = !DILocalVariable(name: "message", arg: 2, scope: !986, file: !21, line: 704, type: !63)
!992 = !DILocalVariable(name: "args", scope: !986, file: !21, line: 706, type: !993)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !203, line: 52, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !205, line: 32, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !996, baseType: !997)
!996 = !DIFile(filename: "src/chroot.c", directory: "/src")
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !209, size: 256, elements: !998)
!998 = !{!999, !1000, !1001, !1002, !1003}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !997, file: !996, line: 706, baseType: !53, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !997, file: !996, line: 706, baseType: !53, size: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !997, file: !996, line: 706, baseType: !53, size: 64, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !997, file: !996, line: 706, baseType: !59, size: 32, offset: 192)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !997, file: !996, line: 706, baseType: !59, size: 32, offset: 224)
!1004 = !DILocalVariable(name: "buf", scope: !986, file: !21, line: 707, type: !51)
!1005 = !DILocalVariable(name: "buflen", scope: !986, file: !21, line: 708, type: !59)
!1006 = !DILocation(line: 0, scope: !986)
!1007 = !DILocation(line: 706, column: 3, scope: !986)
!1008 = !DILocation(line: 706, column: 11, scope: !986)
!1009 = !DILocation(line: 707, column: 3, scope: !986)
!1010 = !DILocation(line: 711, column: 3, scope: !986)
!1011 = !DILocation(line: 712, column: 12, scope: !986)
!1012 = !{i64 0, i64 8, !786, i64 8, i64 8, !786, i64 16, i64 8, !786, i64 24, i64 4, !880, i64 28, i64 4, !880}
!1013 = !DILocation(line: 713, column: 3, scope: !986)
!1014 = !DILocation(line: 716, column: 14, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !986, file: !21, line: 716, column: 7)
!1016 = !DILocation(line: 716, column: 7, scope: !986)
!1017 = !DILocalVariable(name: "__fmt", arg: 1, scope: !1018, file: !1019, line: 122, type: !876)
!1018 = distinct !DISubprogram(name: "vprintf", scope: !1019, file: !1019, line: 122, type: !1020, scopeLine: 123, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1022)
!1019 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!59, !876, !994}
!1022 = !{!1017, !1023}
!1023 = !DILocalVariable(name: "__ap", arg: 2, scope: !1018, file: !1019, line: 122, type: !994)
!1024 = !DILocation(line: 0, scope: !1018, inlinedAt: !1025)
!1025 = distinct !DILocation(line: 718, column: 7, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1015, file: !21, line: 717, column: 5)
!1027 = !DILocation(line: 125, column: 26, scope: !1018, inlinedAt: !1025)
!1028 = !{!1029}
!1029 = distinct !{!1029, !1030, !"vprintf.inline: argument 0"}
!1030 = distinct !{!1030, !"vprintf.inline"}
!1031 = !DILocation(line: 125, column: 10, scope: !1018, inlinedAt: !1025)
!1032 = !DILocation(line: 719, column: 7, scope: !1026)
!1033 = !DILocation(line: 722, column: 20, scope: !986)
!1034 = !DILocation(line: 722, column: 3, scope: !986)
!1035 = !DILocation(line: 723, column: 9, scope: !986)
!1036 = !DILocation(line: 723, column: 3, scope: !986)
!1037 = !DILocation(line: 724, column: 1, scope: !986)
!1038 = !DISubprogram(name: "setlocale", scope: !1039, file: !1039, line: 122, type: !1040, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !872)
!1039 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!51, !59, !63}
!1042 = !DISubprogram(name: "getenv", scope: !1043, file: !1043, line: 641, type: !1044, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !872)
!1043 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!51, !63}
!1046 = !DISubprogram(name: "fwrite_unlocked", scope: !203, file: !203, line: 704, type: !1047, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !872)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!61, !1049, !61, !61, !877}
!1049 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1050)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1052 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 219, type: !1053, scopeLine: 220, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1055)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!59, !59, !79}
!1055 = !{!1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1071, !1072, !1073, !1090, !1094, !1097, !1100, !1101, !1105, !1108, !1109, !1110, !1114}
!1056 = !DILocalVariable(name: "argc", arg: 1, scope: !1052, file: !3, line: 219, type: !59)
!1057 = !DILocalVariable(name: "argv", arg: 2, scope: !1052, file: !3, line: 219, type: !79)
!1058 = !DILocalVariable(name: "c", scope: !1052, file: !3, line: 221, type: !59)
!1059 = !DILocalVariable(name: "userspec", scope: !1052, file: !3, line: 224, type: !51)
!1060 = !DILocalVariable(name: "username", scope: !1052, file: !3, line: 225, type: !63)
!1061 = !DILocalVariable(name: "groups", scope: !1052, file: !3, line: 226, type: !63)
!1062 = !DILocalVariable(name: "skip_chdir", scope: !1052, file: !3, line: 227, type: !95)
!1063 = !DILocalVariable(name: "uid", scope: !1052, file: !3, line: 230, type: !66)
!1064 = !DILocalVariable(name: "gid", scope: !1052, file: !3, line: 231, type: !69)
!1065 = !DILocalVariable(name: "out_gids", scope: !1052, file: !3, line: 232, type: !647)
!1066 = !DILocalVariable(name: "n_gids", scope: !1052, file: !3, line: 233, type: !601)
!1067 = !DILocalVariable(name: "userlen", scope: !1068, file: !3, line: 254, type: !601)
!1068 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 249, column: 11)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 247, column: 9)
!1070 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 245, column: 5)
!1071 = !DILocalVariable(name: "newroot", scope: !1052, file: !3, line: 283, type: !63)
!1072 = !DILocalVariable(name: "is_oldroot", scope: !1052, file: !3, line: 284, type: !95)
!1073 = !DILocalVariable(name: "pwd", scope: !1074, file: !3, line: 308, type: !1078)
!1074 = distinct !DILexicalBlock(scope: !1075, file: !3, line: 307, column: 9)
!1075 = distinct !DILexicalBlock(scope: !1076, file: !3, line: 306, column: 11)
!1076 = distinct !DILexicalBlock(scope: !1077, file: !3, line: 294, column: 5)
