; ModuleID = 'src/rm.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon.54 }
%union.anon.54 = type { i32 }
%struct.rm_options = type { i8, i32, i8, i8, i8, %struct.dev_ino*, i8, i8, i8, i8 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [2 x i32] }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }

!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !18, line: 42, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!20 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!21 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!22 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!23 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!24 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!25 = !DIEnumerator(name: "c_quoting_style", value: 5)
!26 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!27 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!28 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!29 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!30 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RM_status", file: !6, line: 78, baseType: !7, size: 32, elements: !32)
!32 = !{!33, !34, !35, !36, !37}
!33 = !DIEnumerator(name: "RM_OK", value: 2)
!34 = !DIEnumerator(name: "RM_USER_ACCEPTED", value: 3)
!35 = !DIEnumerator(name: "RM_USER_DECLINED", value: 4)
!36 = !DIEnumerator(name: "RM_ERROR", value: 5)
!37 = !DIEnumerator(name: "RM_NONEMPTY_DIR", value: 6)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 46, baseType: !7, size: 32, elements: !40)
!39 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!41 = !DIEnumerator(name: "_ISupper", value: 256)
!42 = !DIEnumerator(name: "_ISlower", value: 512)
!43 = !DIEnumerator(name: "_ISalpha", value: 1024)
!44 = !DIEnumerator(name: "_ISdigit", value: 2048)
!45 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!46 = !DIEnumerator(name: "_ISspace", value: 8192)
!47 = !DIEnumerator(name: "_ISprint", value: 16384)
!48 = !DIEnumerator(name: "_ISgraph", value: 32768)
!49 = !DIEnumerator(name: "_ISblank", value: 1)
!50 = !DIEnumerator(name: "_IScntrl", value: 2)
!51 = !DIEnumerator(name: "_ISpunct", value: 4)
!52 = !DIEnumerator(name: "_ISalnum", value: 8)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !55, file: !54, line: 209, baseType: !7, size: 32, elements: !65)
!54 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!55 = distinct !DISubprogram(name: "select_plural", scope: !54, file: !54, line: 205, type: !56, scopeLine: 206, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !63)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !59}
!58 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !60, line: 102, baseType: !61)
!60 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !62, line: 73, baseType: !58)
!62 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!63 = !{!64}
!64 = !DILocalVariable(name: "n", arg: 1, scope: !55, file: !54, line: 205, type: !59)
!65 = !{!66}
!66 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000)
!67 = !{!68, !70, !72, !73, !74, !75, !77, !79}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!73 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!74 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 46, baseType: !58)
!76 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!79 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!80 = !{!81, !125, !0, !209, !215}
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !83, file: !3, line: 368, type: !102, isLocal: true, isDefinition: true)
!83 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 234, type: !84, scopeLine: 235, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !87)
!84 = !DISubroutineType(types: !85)
!85 = !{!73, !73, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!87 = !{!88, !89, !90, !92, !116, !117, !118, !122, !123, !124}
!88 = !DILocalVariable(name: "argc", arg: 1, scope: !83, file: !3, line: 234, type: !73)
!89 = !DILocalVariable(name: "argv", arg: 2, scope: !83, file: !3, line: 234, type: !86)
!90 = !DILocalVariable(name: "preserve_root", scope: !83, file: !3, line: 236, type: !91)
!91 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!92 = !DILocalVariable(name: "x", scope: !83, file: !3, line: 237, type: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !6, line: 32, size: 256, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100, !112, !113, !114, !115}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !93, file: !6, line: 35, baseType: !91, size: 8)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !93, file: !6, line: 38, baseType: !5, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !93, file: !6, line: 47, baseType: !91, size: 8, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !93, file: !6, line: 50, baseType: !91, size: 8, offset: 72)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !93, file: !6, line: 53, baseType: !91, size: 8, offset: 80)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !93, file: !6, line: 57, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !103, line: 30, size: 128, elements: !104)
!103 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!104 = !{!105, !109}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !102, file: !103, line: 32, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !107, line: 47, baseType: !108)
!107 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !62, line: 148, baseType: !58)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !102, file: !103, line: 33, baseType: !110, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !107, line: 59, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !62, line: 145, baseType: !58)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !93, file: !6, line: 61, baseType: !91, size: 8, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !93, file: !6, line: 64, baseType: !91, size: 8, offset: 200)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !93, file: !6, line: 67, baseType: !91, size: 8, offset: 208)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !93, file: !6, line: 75, baseType: !91, size: 8, offset: 216)
!116 = !DILocalVariable(name: "prompt_once", scope: !83, file: !3, line: 238, type: !91)
!117 = !DILocalVariable(name: "c", scope: !83, file: !3, line: 239, type: !73)
!118 = !DILocalVariable(name: "i", scope: !119, file: !3, line: 287, type: !73)
!119 = distinct !DILexicalBlock(scope: !120, file: !3, line: 286, column: 11)
!120 = distinct !DILexicalBlock(scope: !121, file: !3, line: 257, column: 9)
!121 = distinct !DILexicalBlock(scope: !83, file: !3, line: 255, column: 5)
!122 = !DILocalVariable(name: "n_files", scope: !83, file: !3, line: 375, type: !59)
!123 = !DILocalVariable(name: "file", scope: !83, file: !3, line: 376, type: !86)
!124 = !DILocalVariable(name: "status", scope: !83, file: !3, line: 393, type: !31)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !127, file: !54, line: 575, type: !73, isLocal: true, isDefinition: true)
!127 = distinct !DISubprogram(name: "oputs_", scope: !54, file: !54, line: 573, type: !128, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !130)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !77, !77}
!130 = !{!131, !132, !133, !136, !137, !138, !139, !143, !144, !145, !146, !148, !203, !204, !205, !207, !208}
!131 = !DILocalVariable(name: "program", arg: 1, scope: !127, file: !54, line: 573, type: !77)
!132 = !DILocalVariable(name: "option", arg: 2, scope: !127, file: !54, line: 573, type: !77)
!133 = !DILocalVariable(name: "term", scope: !134, file: !54, line: 585, type: !77)
!134 = distinct !DILexicalBlock(scope: !135, file: !54, line: 582, column: 5)
!135 = distinct !DILexicalBlock(scope: !127, file: !54, line: 581, column: 7)
!136 = !DILocalVariable(name: "double_space", scope: !127, file: !54, line: 594, type: !91)
!137 = !DILocalVariable(name: "first_word", scope: !127, file: !54, line: 595, type: !77)
!138 = !DILocalVariable(name: "option_text", scope: !127, file: !54, line: 596, type: !77)
!139 = !DILocalVariable(name: "s", scope: !140, file: !54, line: 608, type: !77)
!140 = distinct !DILexicalBlock(scope: !141, file: !54, line: 605, column: 5)
!141 = distinct !DILexicalBlock(scope: !142, file: !54, line: 604, column: 12)
!142 = distinct !DILexicalBlock(scope: !127, file: !54, line: 597, column: 7)
!143 = !DILocalVariable(name: "spaces", scope: !140, file: !54, line: 609, type: !75)
!144 = !DILocalVariable(name: "anchor_len", scope: !127, file: !54, line: 620, type: !75)
!145 = !DILocalVariable(name: "desc_text", scope: !127, file: !54, line: 625, type: !77)
!146 = !DILocalVariable(name: "__ptr", scope: !147, file: !54, line: 644, type: !77)
!147 = distinct !DILexicalBlock(scope: !127, file: !54, line: 644, column: 3)
!148 = !DILocalVariable(name: "__stream", scope: !147, file: !54, line: 644, type: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !151, line: 7, baseType: !152)
!151 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !153, line: 49, size: 1728, elements: !154)
!153 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !170, !172, !173, !174, !177, !178, !180, !184, !187, !189, !192, !195, !196, !197, !198, !199}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !152, file: !153, line: 51, baseType: !73, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !152, file: !153, line: 54, baseType: !70, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !152, file: !153, line: 55, baseType: !70, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !152, file: !153, line: 56, baseType: !70, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !152, file: !153, line: 57, baseType: !70, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !152, file: !153, line: 58, baseType: !70, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !152, file: !153, line: 59, baseType: !70, size: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !152, file: !153, line: 60, baseType: !70, size: 64, offset: 448)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !152, file: !153, line: 61, baseType: !70, size: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !152, file: !153, line: 64, baseType: !70, size: 64, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !152, file: !153, line: 65, baseType: !70, size: 64, offset: 640)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !152, file: !153, line: 66, baseType: !70, size: 64, offset: 704)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !152, file: !153, line: 68, baseType: !168, size: 64, offset: 768)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !153, line: 36, flags: DIFlagFwdDecl)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !152, file: !153, line: 70, baseType: !171, size: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !152, file: !153, line: 72, baseType: !73, size: 32, offset: 896)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !152, file: !153, line: 73, baseType: !73, size: 32, offset: 928)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !152, file: !153, line: 74, baseType: !175, size: 64, offset: 960)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !62, line: 152, baseType: !176)
!176 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !152, file: !153, line: 77, baseType: !74, size: 16, offset: 1024)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !152, file: !153, line: 78, baseType: !179, size: 8, offset: 1040)
!179 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !152, file: !153, line: 79, baseType: !181, size: 8, offset: 1048)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 8, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 1)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !152, file: !153, line: 81, baseType: !185, size: 64, offset: 1088)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !153, line: 43, baseType: null)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !152, file: !153, line: 89, baseType: !188, size: 64, offset: 1152)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !62, line: 153, baseType: !176)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !152, file: !153, line: 91, baseType: !190, size: 64, offset: 1216)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !153, line: 37, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !152, file: !153, line: 92, baseType: !193, size: 64, offset: 1280)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !153, line: 38, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !152, file: !153, line: 93, baseType: !171, size: 64, offset: 1344)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !152, file: !153, line: 94, baseType: !72, size: 64, offset: 1408)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !152, file: !153, line: 95, baseType: !75, size: 64, offset: 1472)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !152, file: !153, line: 96, baseType: !73, size: 32, offset: 1536)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !152, file: !153, line: 98, baseType: !200, size: 160, offset: 1568)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 160, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 20)
!203 = !DILocalVariable(name: "__cnt", scope: !147, file: !54, line: 644, type: !75)
!204 = !DILocalVariable(name: "url_program", scope: !127, file: !54, line: 648, type: !77)
!205 = !DILocalVariable(name: "__ptr", scope: !206, file: !54, line: 686, type: !77)
!206 = distinct !DILexicalBlock(scope: !127, file: !54, line: 686, column: 3)
!207 = !DILocalVariable(name: "__stream", scope: !206, file: !54, line: 686, type: !149)
!208 = !DILocalVariable(name: "__cnt", scope: !206, file: !54, line: 686, type: !75)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "interactive_types", scope: !2, file: !3, line: 90, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 192, elements: !213)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!213 = !{!214}
!214 = !DISubrange(count: 6)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "interactive_args", scope: !2, file: !3, line: 84, type: !217, isLocal: true, isDefinition: true)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 448, elements: !219)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!219 = !{!220}
!220 = !DISubrange(count: 7)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 3072, elements: !231)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !224, line: 50, size: 256, elements: !225)
!224 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!225 = !{!226, !227, !228, !230}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !223, file: !224, line: 52, baseType: !77, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !223, file: !224, line: 55, baseType: !73, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !223, file: !224, line: 56, baseType: !229, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !223, file: !224, line: 57, baseType: !73, size: 32, offset: 192)
!231 = !{!232}
!232 = !DISubrange(count: 12)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "Version", scope: !235, file: !236, line: 3, type: !77, isLocal: false, isDefinition: true)
!235 = distinct !DICompileUnit(language: DW_LANG_C99, file: !236, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !237, splitDebugInlining: false, nameTableKind: None)
!236 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!237 = !{!233}
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !240, file: !241, line: 65, type: !245, isLocal: false, isDefinition: true)
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !242, retainedTypes: !243, globals: !244, splitDebugInlining: false, nameTableKind: None)
!241 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!242 = !{!17}
!243 = !{!72, !77, !79}
!244 = !{!238}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !246, line: 69, baseType: !247)
!246 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{null}
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "file_name", scope: !252, file: !253, line: 36, type: !77, isLocal: true, isDefinition: true)
!252 = distinct !DICompileUnit(language: DW_LANG_C99, file: !253, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !254, splitDebugInlining: false, nameTableKind: None)
!253 = !DIFile(filename: "lib/closein.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9fec55e4ddd91bb874b8f9175b89c7e1")
!254 = !{!250}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "file_name", scope: !257, file: !258, line: 45, type: !77, isLocal: true, isDefinition: true)
!257 = distinct !DICompileUnit(language: DW_LANG_C99, file: !258, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !259, splitDebugInlining: false, nameTableKind: None)
!258 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!259 = !{!255, !260}
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !257, file: !258, line: 55, type: !91, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !264, file: !265, line: 66, type: !247, isLocal: false, isDefinition: true)
!264 = distinct !DICompileUnit(language: DW_LANG_C99, file: !265, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !266, globals: !267, splitDebugInlining: false, nameTableKind: None)
!265 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!266 = !{!72, !79}
!267 = !{!268, !294, !262, !296, !298}
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "old_file_name", scope: !270, file: !265, line: 304, type: !77, isLocal: true, isDefinition: true)
!270 = distinct !DISubprogram(name: "verror_at_line", scope: !265, file: !265, line: 298, type: !271, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !264, retainedNodes: !287)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !73, !73, !77, !7, !77, !273}
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !274, line: 52, baseType: !275)
!274 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !276, line: 32, baseType: !277)
!276 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !278, baseType: !279)
!278 = !DIFile(filename: "lib/error.c", directory: "/src")
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !280, size: 256, elements: !281)
!280 = !DINamespace(name: "std", scope: null)
!281 = !{!282, !283, !284, !285, !286}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !279, file: !278, baseType: !72, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !279, file: !278, baseType: !72, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !279, file: !278, baseType: !72, size: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !279, file: !278, baseType: !73, size: 32, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !279, file: !278, baseType: !73, size: 32, offset: 224)
!287 = !{!288, !289, !290, !291, !292, !293}
!288 = !DILocalVariable(name: "status", arg: 1, scope: !270, file: !265, line: 298, type: !73)
!289 = !DILocalVariable(name: "errnum", arg: 2, scope: !270, file: !265, line: 298, type: !73)
!290 = !DILocalVariable(name: "file_name", arg: 3, scope: !270, file: !265, line: 298, type: !77)
!291 = !DILocalVariable(name: "line_number", arg: 4, scope: !270, file: !265, line: 298, type: !7)
!292 = !DILocalVariable(name: "message", arg: 5, scope: !270, file: !265, line: 298, type: !77)
!293 = !DILocalVariable(name: "args", arg: 6, scope: !270, file: !265, line: 298, type: !273)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "old_line_number", scope: !270, file: !265, line: 305, type: !7, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "error_message_count", scope: !264, file: !265, line: 69, type: !7, isLocal: false, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !264, file: !265, line: 295, type: !73, isLocal: false, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "default_tuning", scope: !302, file: !303, line: 134, type: !307, isLocal: true, isDefinition: true)
!302 = distinct !DICompileUnit(language: DW_LANG_C99, file: !303, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !304, globals: !306, splitDebugInlining: false, nameTableKind: None)
!303 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!304 = !{!58, !72, !305, !75}
!305 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!306 = !{!300}
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !309, line: 52, baseType: !310)
!309 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !309, line: 40, size: 160, elements: !311)
!311 = !{!312, !313, !314, !315, !316}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !310, file: !309, line: 45, baseType: !305, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !310, file: !309, line: 46, baseType: !305, size: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !310, file: !309, line: 47, baseType: !305, size: 32, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !310, file: !309, line: 48, baseType: !305, size: 32, offset: 96)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !310, file: !309, line: 49, baseType: !91, size: 8, offset: 128)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "program_name", scope: !319, file: !320, line: 31, type: !77, isLocal: false, isDefinition: true)
!319 = distinct !DICompileUnit(language: DW_LANG_C99, file: !320, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !321, globals: !322, splitDebugInlining: false, nameTableKind: None)
!320 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!321 = !{!70}
!322 = !{!317}
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "utf07FF", scope: !325, file: !326, line: 46, type: !356, isLocal: true, isDefinition: true)
!325 = distinct !DISubprogram(name: "proper_name_lite", scope: !326, file: !326, line: 38, type: !327, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !329, retainedNodes: !331)
!326 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!327 = !DISubroutineType(types: !328)
!328 = !{!77, !77, !77}
!329 = distinct !DICompileUnit(language: DW_LANG_C99, file: !326, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !330, splitDebugInlining: false, nameTableKind: None)
!330 = !{!323}
!331 = !{!332, !333, !334, !335, !340}
!332 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !325, file: !326, line: 38, type: !77)
!333 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !325, file: !326, line: 38, type: !77)
!334 = !DILocalVariable(name: "translation", scope: !325, file: !326, line: 40, type: !77)
!335 = !DILocalVariable(name: "w", scope: !325, file: !326, line: 47, type: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !337, line: 37, baseType: !338)
!337 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !62, line: 57, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !62, line: 42, baseType: !7)
!340 = !DILocalVariable(name: "mbs", scope: !325, file: !326, line: 48, type: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !342, line: 6, baseType: !343)
!342 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !344, line: 21, baseType: !345)
!344 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 13, size: 64, elements: !346)
!346 = !{!347, !348}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !345, file: !344, line: 15, baseType: !73, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !345, file: !344, line: 20, baseType: !349, size: 32, offset: 32)
!349 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !345, file: !344, line: 16, size: 32, elements: !350)
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !349, file: !344, line: 18, baseType: !7, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !349, file: !344, line: 19, baseType: !353, size: 32)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 32, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 4)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 16, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 2)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !361, file: !362, line: 76, type: !430, isLocal: false, isDefinition: true)
!361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !362, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !363, retainedTypes: !369, globals: !370, splitDebugInlining: false, nameTableKind: None)
!362 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!363 = !{!17, !364, !38}
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !18, line: 254, baseType: !7, size: 32, elements: !365)
!365 = !{!366, !367, !368}
!366 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!367 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!368 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!369 = !{!73, !74, !75}
!370 = !{!359, !371, !377, !389, !391, !396, !419, !426, !428}
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !361, file: !362, line: 92, type: !373, isLocal: false, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 320, elements: !375)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!375 = !{!376}
!376 = !DISubrange(count: 10)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !361, file: !362, line: 1040, type: !379, isLocal: false, isDefinition: true)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !362, line: 56, size: 448, elements: !380)
!380 = !{!381, !382, !383, !387, !388}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !379, file: !362, line: 59, baseType: !17, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !379, file: !362, line: 62, baseType: !73, size: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !379, file: !362, line: 66, baseType: !384, size: 256, offset: 64)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 8)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !379, file: !362, line: 69, baseType: !77, size: 64, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !379, file: !362, line: 72, baseType: !77, size: 64, offset: 384)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !361, file: !362, line: 107, type: !379, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "slot0", scope: !361, file: !362, line: 831, type: !393, isLocal: true, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 2048, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 256)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "quote", scope: !398, file: !362, line: 228, type: !417, isLocal: true, isDefinition: true)
!398 = distinct !DISubprogram(name: "gettext_quote", scope: !362, file: !362, line: 197, type: !399, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !361, retainedNodes: !401)
!399 = !DISubroutineType(types: !400)
!400 = !{!77, !77, !17}
!401 = !{!402, !403, !404, !405, !406}
!402 = !DILocalVariable(name: "msgid", arg: 1, scope: !398, file: !362, line: 197, type: !77)
!403 = !DILocalVariable(name: "s", arg: 2, scope: !398, file: !362, line: 197, type: !17)
!404 = !DILocalVariable(name: "translation", scope: !398, file: !362, line: 199, type: !77)
!405 = !DILocalVariable(name: "w", scope: !398, file: !362, line: 229, type: !336)
!406 = !DILocalVariable(name: "mbs", scope: !398, file: !362, line: 230, type: !407)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !342, line: 6, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !344, line: 21, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 13, size: 64, elements: !410)
!410 = !{!411, !412}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !409, file: !344, line: 15, baseType: !73, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !409, file: !344, line: 20, baseType: !413, size: 32, offset: 32)
!413 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !409, file: !344, line: 16, size: 32, elements: !414)
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !413, file: !344, line: 18, baseType: !7, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !413, file: !344, line: 19, baseType: !353, size: 32)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 64, elements: !418)
!418 = !{!358, !355}
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "slotvec", scope: !361, file: !362, line: 834, type: !421, isLocal: true, isDefinition: true)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !362, line: 823, size: 128, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !422, file: !362, line: 825, baseType: !75, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !422, file: !362, line: 826, baseType: !70, size: 64, offset: 64)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "nslots", scope: !361, file: !362, line: 832, type: !73, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "slotvec0", scope: !361, file: !362, line: 833, type: !422, isLocal: true, isDefinition: true)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 704, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 11)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !435, file: !436, line: 26, type: !438, isLocal: false, isDefinition: true)
!435 = distinct !DICompileUnit(language: DW_LANG_C99, file: !436, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !437, splitDebugInlining: false, nameTableKind: None)
!436 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!437 = !{!433}
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 376, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 47)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!442 = distinct !DIGlobalVariable(name: "initialized", scope: !443, file: !444, line: 41, type: !91, isLocal: true, isDefinition: true)
!443 = distinct !DISubprogram(name: "can_write_any_file", scope: !444, file: !444, line: 39, type: !445, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !447, retainedNodes: !452)
!444 = !DIFile(filename: "lib/write-any-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d0180a8dace2a19c551daec82ca064f9")
!445 = !DISubroutineType(types: !446)
!446 = !{!91}
!447 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !448, splitDebugInlining: false, nameTableKind: None)
!448 = !{!449, !450}
!449 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "can_write", scope: !443, file: !444, line: 42, type: !91, isLocal: true, isDefinition: true)
!452 = !{!453}
!453 = !DILocalVariable(name: "can", scope: !454, file: !444, line: 46, type: !91)
!454 = distinct !DILexicalBlock(scope: !455, file: !444, line: 45, column: 5)
!455 = distinct !DILexicalBlock(scope: !443, file: !444, line: 44, column: 7)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "exit_failure", scope: !458, file: !459, line: 24, type: !461, isLocal: false, isDefinition: true)
!458 = distinct !DICompileUnit(language: DW_LANG_C99, file: !459, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !460, splitDebugInlining: false, nameTableKind: None)
!459 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!460 = !{!456}
!461 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !73)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !464, file: !465, line: 506, type: !73, isLocal: true, isDefinition: true)
!464 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !465, file: !465, line: 485, type: !466, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !468, retainedNodes: !470)
!465 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!466 = !DISubroutineType(types: !467)
!467 = !{!73, !73, !73}
!468 = distinct !DICompileUnit(language: DW_LANG_C99, file: !465, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !469, splitDebugInlining: false, nameTableKind: None)
!469 = !{!462}
!470 = !{!471, !472, !473, !474, !477}
!471 = !DILocalVariable(name: "fd", arg: 1, scope: !464, file: !465, line: 485, type: !73)
!472 = !DILocalVariable(name: "target", arg: 2, scope: !464, file: !465, line: 485, type: !73)
!473 = !DILocalVariable(name: "result", scope: !464, file: !465, line: 487, type: !73)
!474 = !DILocalVariable(name: "flags", scope: !475, file: !465, line: 530, type: !73)
!475 = distinct !DILexicalBlock(scope: !476, file: !465, line: 529, column: 5)
!476 = distinct !DILexicalBlock(scope: !464, file: !465, line: 528, column: 7)
!477 = !DILocalVariable(name: "saved_errno", scope: !478, file: !465, line: 533, type: !73)
!478 = distinct !DILexicalBlock(scope: !479, file: !465, line: 532, column: 9)
!479 = distinct !DILexicalBlock(scope: !475, file: !465, line: 531, column: 11)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "internal_state", scope: !482, file: !483, line: 97, type: !486, isLocal: true, isDefinition: true)
!482 = distinct !DICompileUnit(language: DW_LANG_C99, file: !483, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !484, globals: !485, splitDebugInlining: false, nameTableKind: None)
!483 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!484 = !{!72, !75, !79}
!485 = !{!480}
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !342, line: 6, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !344, line: 21, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 13, size: 64, elements: !489)
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !488, file: !344, line: 15, baseType: !73, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !488, file: !344, line: 20, baseType: !492, size: 32, offset: 32)
!492 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !488, file: !344, line: 16, size: 32, elements: !493)
!493 = !{!494, !495}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !492, file: !344, line: 18, baseType: !7, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !492, file: !344, line: 19, baseType: !353, size: 32)
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !497, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !498, retainedTypes: !520, splitDebugInlining: false, nameTableKind: None)
!497 = !DIFile(filename: "src/remove.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5b44ba291ad4d7b78c5ea04d27ccb860")
!498 = !{!31, !5, !499, !17, !504, !508}
!499 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !54, line: 299, baseType: !73, size: 32, elements: !500)
!500 = !{!501, !502, !503}
!501 = !DIEnumerator(name: "DS_UNKNOWN", value: -2)
!502 = !DIEnumerator(name: "DS_EMPTY", value: -1)
!503 = !DIEnumerator(name: "DS_NONEMPTY", value: 0)
!504 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Prompt_action", file: !497, line: 38, baseType: !7, size: 32, elements: !505)
!505 = !{!506, !507}
!506 = !DIEnumerator(name: "PA_DESCEND_INTO_DIR", value: 2)
!507 = !DIEnumerator(name: "PA_REMOVE_DIR", value: 3)
!508 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !509, line: 97, baseType: !7, size: 32, elements: !510)
!509 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!510 = !{!511, !512, !513, !514, !515, !516, !517, !518, !519}
!511 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!512 = !DIEnumerator(name: "DT_FIFO", value: 1)
!513 = !DIEnumerator(name: "DT_CHR", value: 2)
!514 = !DIEnumerator(name: "DT_DIR", value: 4)
!515 = !DIEnumerator(name: "DT_BLK", value: 6)
!516 = !DIEnumerator(name: "DT_REG", value: 8)
!517 = !DIEnumerator(name: "DT_LNK", value: 10)
!518 = !DIEnumerator(name: "DT_SOCK", value: 12)
!519 = !DIEnumerator(name: "DT_WHT", value: 14)
!520 = !{!72}
!521 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !321, splitDebugInlining: false, nameTableKind: None)
!522 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!523 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !520, splitDebugInlining: false, nameTableKind: None)
!524 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!525 = distinct !DICompileUnit(language: DW_LANG_C99, file: !526, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!526 = !DIFile(filename: "lib/file-type.c", directory: "/src", checksumkind: CSK_MD5, checksum: "50015f77027750ae004026e1298a48e3")
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !520, splitDebugInlining: false, nameTableKind: None)
!528 = !DIFile(filename: "lib/filenamecat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a58f68c719d6eade07443f6349d1f193")
!529 = distinct !DICompileUnit(language: DW_LANG_C99, file: !530, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !520, splitDebugInlining: false, nameTableKind: None)
!530 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "19114c82e79ffcf16d6cc09933141d08")
!531 = distinct !DICompileUnit(language: DW_LANG_C99, file: !532, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!532 = !DIFile(filename: "lib/freadahead.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0335573db6cc583acb894a308e230b2b")
!533 = distinct !DICompileUnit(language: DW_LANG_C99, file: !534, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !520, splitDebugInlining: false, nameTableKind: None)
!534 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!535 = distinct !DICompileUnit(language: DW_LANG_C99, file: !536, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !537, retainedTypes: !680, splitDebugInlining: false, nameTableKind: None)
!536 = !DIFile(filename: "lib/fts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "790475fd5d16e5b9bfdbc337c34f4fa2")
!537 = !{!538, !542, !667, !670, !508, !674, !677}
!538 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !536, line: 159, baseType: !7, size: 32, elements: !539)
!539 = !{!540, !541}
!540 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!541 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!542 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !544, file: !543, line: 54, baseType: !7, size: 32, elements: !665)
!543 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/src", checksumkind: CSK_MD5, checksum: "270205dca4a7d3b7c2e61f5b3b63f3eb")
!544 = distinct !DISubprogram(name: "setup_dir", scope: !543, file: !543, line: 50, type: !545, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !535, retainedNodes: !663)
!545 = !DISubroutineType(types: !546)
!546 = !{!91, !547}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !549, line: 233, baseType: !550)
!549 = !DIFile(filename: "./lib/fts_.h", directory: "/src", checksumkind: CSK_MD5, checksum: "b8640bdd941d220a051ddea014397796")
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !549, line: 115, size: 1024, elements: !551)
!551 = !{!552, !616, !617, !619, !620, !621, !622, !623, !624, !625, !632, !633, !636, !652}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !550, file: !549, line: 116, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !549, line: 235, size: 1920, elements: !555)
!555 = !{!556, !557, !558, !559, !563, !564, !565, !566, !567, !568, !569, !570, !571, !573, !574, !575, !576, !577, !612}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !554, file: !549, line: 236, baseType: !553, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !554, file: !549, line: 237, baseType: !553, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !554, file: !549, line: 238, baseType: !553, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !554, file: !549, line: 239, baseType: !560, size: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !509, line: 127, baseType: !562)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !509, line: 127, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !554, file: !549, line: 242, baseType: !176, size: 64, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !554, file: !549, line: 243, baseType: !72, size: 64, offset: 320)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !554, file: !549, line: 244, baseType: !70, size: 64, offset: 384)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !554, file: !549, line: 245, baseType: !70, size: 64, offset: 448)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !554, file: !549, line: 246, baseType: !73, size: 32, offset: 512)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !554, file: !549, line: 247, baseType: !73, size: 32, offset: 544)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !554, file: !549, line: 248, baseType: !75, size: 64, offset: 576)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !554, file: !549, line: 250, baseType: !547, size: 64, offset: 640)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !554, file: !549, line: 254, baseType: !572, size: 64, offset: 704)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !76, line: 35, baseType: !176)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !554, file: !549, line: 256, baseType: !75, size: 64, offset: 768)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !554, file: !549, line: 272, baseType: !74, size: 16, offset: 832)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !554, file: !549, line: 276, baseType: !74, size: 16, offset: 848)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !554, file: !549, line: 282, baseType: !74, size: 16, offset: 864)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !554, file: !549, line: 284, baseType: !578, size: 1024, offset: 896)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 1024, elements: !182)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !580, line: 44, size: 1024, elements: !581)
!580 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!581 = !{!582, !583, !584, !586, !588, !590, !592, !593, !594, !595, !597, !598, !600, !608, !609, !610}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !579, file: !580, line: 46, baseType: !111, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !579, file: !580, line: 47, baseType: !108, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !579, file: !580, line: 48, baseType: !585, size: 32, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !62, line: 150, baseType: !7)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !579, file: !580, line: 49, baseType: !587, size: 32, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !62, line: 151, baseType: !7)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !579, file: !580, line: 50, baseType: !589, size: 32, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !62, line: 146, baseType: !7)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !579, file: !580, line: 51, baseType: !591, size: 32, offset: 224)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !62, line: 147, baseType: !7)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !579, file: !580, line: 52, baseType: !111, size: 64, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !579, file: !580, line: 53, baseType: !111, size: 64, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !579, file: !580, line: 54, baseType: !175, size: 64, offset: 384)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !579, file: !580, line: 55, baseType: !596, size: 32, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !62, line: 175, baseType: !73)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !579, file: !580, line: 56, baseType: !73, size: 32, offset: 480)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !579, file: !580, line: 57, baseType: !599, size: 64, offset: 512)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !62, line: 180, baseType: !176)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !579, file: !580, line: 65, baseType: !601, size: 128, offset: 576)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !602, line: 11, size: 128, elements: !603)
!602 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!603 = !{!604, !606}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !601, file: !602, line: 16, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !62, line: 160, baseType: !176)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !601, file: !602, line: 21, baseType: !607, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !62, line: 197, baseType: !176)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !579, file: !580, line: 66, baseType: !601, size: 128, offset: 704)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !579, file: !580, line: 67, baseType: !601, size: 128, offset: 832)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !579, file: !580, line: 79, baseType: !611, size: 64, offset: 960)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 64, elements: !357)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !554, file: !549, line: 285, baseType: !613, offset: 1920)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: -1)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !550, file: !549, line: 117, baseType: !553, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !550, file: !549, line: 118, baseType: !618, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !550, file: !549, line: 119, baseType: !110, size: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !550, file: !549, line: 120, baseType: !70, size: 64, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !550, file: !549, line: 121, baseType: !73, size: 32, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !550, file: !549, line: 122, baseType: !73, size: 32, offset: 352)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !550, file: !549, line: 124, baseType: !75, size: 64, offset: 384)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !550, file: !549, line: 125, baseType: !75, size: 64, offset: 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !550, file: !549, line: 126, baseType: !626, size: 64, offset: 512)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!73, !629, !629}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !554)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !550, file: !549, line: 196, baseType: !73, size: 32, offset: 576)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !550, file: !549, line: 205, baseType: !634, size: 64, offset: 640)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !549, line: 205, flags: DIFlagFwdDecl)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !550, file: !549, line: 227, baseType: !637, size: 64, offset: 704)
!637 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !550, file: !549, line: 207, size: 64, elements: !638)
!638 = !{!639, !640}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !637, file: !549, line: 220, baseType: !634, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !637, file: !549, line: 226, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !643, line: 32, size: 256, elements: !644)
!643 = !DIFile(filename: "./lib/cycle-check.h", directory: "/src", checksumkind: CSK_MD5, checksum: "5b1b442060400da72f41cd561f8be0ce")
!644 = !{!645, !650, !651}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !642, file: !643, line: 34, baseType: !646, size: 128)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !103, line: 30, size: 128, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !646, file: !103, line: 32, baseType: !106, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !646, file: !103, line: 33, baseType: !110, size: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !642, file: !643, line: 35, baseType: !59, size: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !642, file: !643, line: 36, baseType: !73, size: 32, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !550, file: !549, line: 232, baseType: !653, size: 256, offset: 768)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !654, line: 47, baseType: !655)
!654 = !DIFile(filename: "./lib/i-ring.h", directory: "/src", checksumkind: CSK_MD5, checksum: "e5a837f066348a79b8b8c179c8da2a6d")
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !654, line: 39, size: 256, elements: !656)
!656 = !{!657, !659, !660, !661, !662}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !655, file: !654, line: 41, baseType: !658, size: 128)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 128, elements: !354)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !655, file: !654, line: 42, baseType: !73, size: 32, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !655, file: !654, line: 43, baseType: !7, size: 32, offset: 160)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !655, file: !654, line: 44, baseType: !7, size: 32, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !655, file: !654, line: 45, baseType: !91, size: 8, offset: 224)
!663 = !{!664}
!664 = !DILocalVariable(name: "fts", arg: 1, scope: !544, file: !543, line: 50, type: !547)
!665 = !{!666}
!666 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31)
!667 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !536, line: 635, baseType: !7, size: 32, elements: !668)
!668 = !{!669}
!669 = !DIEnumerator(name: "MIN_DIR_NLINK", value: 2)
!670 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !536, line: 638, baseType: !7, size: 32, elements: !671)
!671 = !{!672, !673}
!672 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0)
!673 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1)
!674 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !536, line: 154, baseType: !7, size: 32, elements: !675)
!675 = !{!676}
!676 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000)
!677 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !536, line: 676, baseType: !7, size: 32, elements: !678)
!678 = !{!679}
!679 = !DIEnumerator(name: "DEV_TYPE_HT_INITIAL_SIZE", value: 13)
!680 = !{!72, !59, !681, !682, !685}
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !60, line: 90, baseType: !58)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!73, !68, !68}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !549, line: 286, baseType: !554)
!689 = distinct !DICompileUnit(language: DW_LANG_C99, file: !690, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!690 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!691 = distinct !DICompileUnit(language: DW_LANG_C99, file: !692, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !693, splitDebugInlining: false, nameTableKind: None)
!692 = !DIFile(filename: "lib/i-ring.c", directory: "/src", checksumkind: CSK_MD5, checksum: "581251246a0cdfeb716d0893ef103e1d")
!693 = !{!694}
!694 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !654, line: 28, baseType: !7, size: 32, elements: !695)
!695 = !{!696}
!696 = !DIEnumerator(name: "I_RING_SIZE", value: 4)
!697 = distinct !DICompileUnit(language: DW_LANG_C99, file: !698, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!698 = !DIFile(filename: "lib/next-prime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9e10a95d0a1244096fa4fe5ba361f714")
!699 = distinct !DICompileUnit(language: DW_LANG_C99, file: !700, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!700 = !DIFile(filename: "lib/openat-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "946ef6e8fdb1124c3d2ae8982ba6c16b")
!701 = distinct !DICompileUnit(language: DW_LANG_C99, file: !702, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!702 = !DIFile(filename: "lib/opendirat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9ae84c4c59278018f497b82d8ee5d941")
!703 = distinct !DICompileUnit(language: DW_LANG_C99, file: !704, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !705, splitDebugInlining: false, nameTableKind: None)
!704 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!705 = !{!91, !58, !72}
!706 = distinct !DICompileUnit(language: DW_LANG_C99, file: !707, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!707 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b0632229108c1521929601778d55996f")
!708 = distinct !DICompileUnit(language: DW_LANG_C99, file: !709, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!709 = !DIFile(filename: "lib/fd-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12c3310fb811f6ed0e0fb7e99c1b995b")
!710 = distinct !DICompileUnit(language: DW_LANG_C99, file: !711, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !712, retainedTypes: !520, splitDebugInlining: false, nameTableKind: None)
!711 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!712 = !{!713}
!713 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !711, line: 40, baseType: !7, size: 32, elements: !714)
!714 = !{!715}
!715 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!716 = distinct !DICompileUnit(language: DW_LANG_C99, file: !717, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !718, retainedTypes: !748, splitDebugInlining: false, nameTableKind: None)
!717 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!718 = !{!719, !731}
!719 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !720, file: !717, line: 188, baseType: !7, size: 32, elements: !729)
!720 = distinct !DISubprogram(name: "x2nrealloc", scope: !717, file: !717, line: 176, type: !721, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !716, retainedNodes: !724)
!721 = !DISubroutineType(types: !722)
!722 = !{!72, !72, !723, !75}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!724 = !{!725, !726, !727, !728}
!725 = !DILocalVariable(name: "p", arg: 1, scope: !720, file: !717, line: 176, type: !72)
!726 = !DILocalVariable(name: "pn", arg: 2, scope: !720, file: !717, line: 176, type: !723)
!727 = !DILocalVariable(name: "s", arg: 3, scope: !720, file: !717, line: 176, type: !75)
!728 = !DILocalVariable(name: "n", scope: !720, file: !717, line: 178, type: !75)
!729 = !{!730}
!730 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !732, file: !717, line: 228, baseType: !7, size: 32, elements: !729)
!732 = distinct !DISubprogram(name: "xpalloc", scope: !717, file: !717, line: 223, type: !733, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !716, retainedNodes: !738)
!733 = !DISubroutineType(types: !734)
!734 = !{!72, !72, !735, !736, !572, !736}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !737, line: 130, baseType: !572)
!737 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!738 = !{!739, !740, !741, !742, !743, !744, !745, !746, !747}
!739 = !DILocalVariable(name: "pa", arg: 1, scope: !732, file: !717, line: 223, type: !72)
!740 = !DILocalVariable(name: "pn", arg: 2, scope: !732, file: !717, line: 223, type: !735)
!741 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !732, file: !717, line: 223, type: !736)
!742 = !DILocalVariable(name: "n_max", arg: 4, scope: !732, file: !717, line: 223, type: !572)
!743 = !DILocalVariable(name: "s", arg: 5, scope: !732, file: !717, line: 223, type: !736)
!744 = !DILocalVariable(name: "n0", scope: !732, file: !717, line: 230, type: !736)
!745 = !DILocalVariable(name: "n", scope: !732, file: !717, line: 237, type: !736)
!746 = !DILocalVariable(name: "nbytes", scope: !732, file: !717, line: 248, type: !736)
!747 = !DILocalVariable(name: "adjusted_nbytes", scope: !732, file: !717, line: 252, type: !736)
!748 = !{!70, !72, !91, !176, !58}
!749 = distinct !DICompileUnit(language: DW_LANG_C99, file: !750, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!750 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!751 = distinct !DICompileUnit(language: DW_LANG_C99, file: !752, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !520, splitDebugInlining: false, nameTableKind: None)
!752 = !DIFile(filename: "lib/xfts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84bc35d35364cd7c760cb21288203f20")
!753 = distinct !DICompileUnit(language: DW_LANG_C99, file: !754, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!754 = !DIFile(filename: "lib/yesno.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f502cb9314a0b73fa3879d5bf878f96f")
!755 = distinct !DICompileUnit(language: DW_LANG_C99, file: !756, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!756 = !DIFile(filename: "lib/c-file-type.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a3dfce754b72420a39e7e891cf0b31be")
!757 = distinct !DICompileUnit(language: DW_LANG_C99, file: !758, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!758 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!759 = distinct !DICompileUnit(language: DW_LANG_C99, file: !760, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!760 = !DIFile(filename: "lib/cycle-check.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9029e4490609d8d0ac3188f897240e9")
!761 = distinct !DICompileUnit(language: DW_LANG_C99, file: !762, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!762 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!763 = distinct !DICompileUnit(language: DW_LANG_C99, file: !764, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!764 = !DIFile(filename: "lib/open-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84efcad54206a8ffedf254f32134ee9c")
!765 = distinct !DICompileUnit(language: DW_LANG_C99, file: !766, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!766 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!767 = distinct !DICompileUnit(language: DW_LANG_C99, file: !768, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!768 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!769 = distinct !DICompileUnit(language: DW_LANG_C99, file: !770, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!770 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!771 = distinct !DICompileUnit(language: DW_LANG_C99, file: !772, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !520, splitDebugInlining: false, nameTableKind: None)
!772 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!773 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!774 = !{i32 7, !"Dwarf Version", i32 5}
!775 = !{i32 2, !"Debug Info Version", i32 3}
!776 = !{i32 1, !"wchar_size", i32 4}
!777 = !{i32 1, !"branch-target-enforcement", i32 0}
!778 = !{i32 1, !"sign-return-address", i32 0}
!779 = !{i32 1, !"sign-return-address-all", i32 0}
!780 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!781 = !{i32 7, !"PIC Level", i32 2}
!782 = !{i32 7, !"PIE Level", i32 2}
!783 = !{i32 7, !"uwtable", i32 1}
!784 = !{i32 7, !"frame-pointer", i32 1}
!785 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 125, type: !786, scopeLine: 126, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !788)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !73}
!788 = !{!789}
!789 = !DILocalVariable(name: "status", arg: 1, scope: !785, file: !3, line: 125, type: !73)
!790 = !DILocation(line: 0, scope: !785)
!791 = !DILocation(line: 127, column: 14, scope: !792)
!792 = distinct !DILexicalBlock(scope: !785, file: !3, line: 127, column: 7)
!793 = !DILocation(line: 127, column: 7, scope: !785)
!794 = !DILocation(line: 128, column: 5, scope: !795)
!795 = distinct !DILexicalBlock(scope: !792, file: !3, line: 128, column: 5)
!796 = !{!797, !797, i64 0}
!797 = !{!"any pointer", !798, i64 0}
!798 = !{!"omnipotent char", !799, i64 0}
!799 = !{!"Simple C/C++ TBAA"}
!800 = !DILocation(line: 131, column: 7, scope: !801)
!801 = distinct !DILexicalBlock(scope: !792, file: !3, line: 130, column: 5)
!802 = !DILocation(line: 132, column: 7, scope: !801)
!803 = !DILocation(line: 136, column: 7, scope: !801)
!804 = !DILocation(line: 140, column: 7, scope: !801)
!805 = !DILocation(line: 144, column: 7, scope: !801)
!806 = !DILocation(line: 150, column: 7, scope: !801)
!807 = !DILocation(line: 155, column: 7, scope: !801)
!808 = !DILocation(line: 161, column: 7, scope: !801)
!809 = !DILocation(line: 165, column: 7, scope: !801)
!810 = !DILocation(line: 171, column: 7, scope: !801)
!811 = !DILocation(line: 175, column: 7, scope: !801)
!812 = !DILocation(line: 179, column: 7, scope: !801)
!813 = !DILocation(line: 183, column: 7, scope: !801)
!814 = !DILocation(line: 184, column: 7, scope: !801)
!815 = !DILocation(line: 185, column: 7, scope: !801)
!816 = !DILocation(line: 190, column: 7, scope: !801)
!817 = !DILocation(line: 195, column: 7, scope: !801)
!818 = !DILocation(line: 204, column: 7, scope: !801)
!819 = !DILocalVariable(name: "program", arg: 1, scope: !820, file: !54, line: 836, type: !77)
!820 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !54, file: !54, line: 836, type: !821, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !823)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !77}
!823 = !{!819, !824, !831, !832, !834, !835}
!824 = !DILocalVariable(name: "infomap", scope: !820, file: !54, line: 838, type: !825)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !826, size: 896, elements: !219)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !820, file: !54, line: 838, size: 128, elements: !828)
!828 = !{!829, !830}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !827, file: !54, line: 838, baseType: !77, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !827, file: !54, line: 838, baseType: !77, size: 64, offset: 64)
!831 = !DILocalVariable(name: "node", scope: !820, file: !54, line: 848, type: !77)
!832 = !DILocalVariable(name: "map_prog", scope: !820, file: !54, line: 849, type: !833)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!834 = !DILocalVariable(name: "lc_messages", scope: !820, file: !54, line: 861, type: !77)
!835 = !DILocalVariable(name: "url_program", scope: !820, file: !54, line: 874, type: !77)
!836 = !DILocation(line: 0, scope: !820, inlinedAt: !837)
!837 = distinct !DILocation(line: 210, column: 7, scope: !801)
!838 = !DILocation(line: 838, column: 3, scope: !820, inlinedAt: !837)
!839 = !DILocation(line: 838, column: 67, scope: !820, inlinedAt: !837)
!840 = !DILocation(line: 849, column: 36, scope: !820, inlinedAt: !837)
!841 = !DILocation(line: 851, column: 3, scope: !820, inlinedAt: !837)
!842 = !DILocalVariable(name: "__s1", arg: 1, scope: !843, file: !844, line: 1359, type: !77)
!843 = distinct !DISubprogram(name: "streq", scope: !844, file: !844, line: 1359, type: !845, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !847)
!844 = !DIFile(filename: "./lib/string.h", directory: "/src")
!845 = !DISubroutineType(types: !846)
!846 = !{!91, !77, !77}
!847 = !{!842, !848}
!848 = !DILocalVariable(name: "__s2", arg: 2, scope: !843, file: !844, line: 1359, type: !77)
!849 = !DILocation(line: 0, scope: !843, inlinedAt: !850)
!850 = distinct !DILocation(line: 851, column: 33, scope: !820, inlinedAt: !837)
!851 = !DILocation(line: 1361, column: 11, scope: !843, inlinedAt: !850)
!852 = !DILocation(line: 1361, column: 10, scope: !843, inlinedAt: !850)
!853 = !DILocation(line: 852, column: 13, scope: !820, inlinedAt: !837)
!854 = !DILocation(line: 851, column: 20, scope: !820, inlinedAt: !837)
!855 = !{!856, !797, i64 0}
!856 = !{!"infomap", !797, i64 0, !797, i64 8}
!857 = !DILocation(line: 851, column: 10, scope: !820, inlinedAt: !837)
!858 = !DILocation(line: 851, column: 28, scope: !820, inlinedAt: !837)
!859 = distinct !{!859, !841, !853, !860}
!860 = !{!"llvm.loop.mustprogress"}
!861 = !DILocation(line: 854, column: 17, scope: !862, inlinedAt: !837)
!862 = distinct !DILexicalBlock(scope: !820, file: !54, line: 854, column: 7)
!863 = !{!856, !797, i64 8}
!864 = !DILocation(line: 854, column: 7, scope: !862, inlinedAt: !837)
!865 = !DILocation(line: 854, column: 7, scope: !820, inlinedAt: !837)
!866 = !DILocation(line: 857, column: 3, scope: !820, inlinedAt: !837)
!867 = !DILocation(line: 861, column: 29, scope: !820, inlinedAt: !837)
!868 = !DILocation(line: 862, column: 7, scope: !869, inlinedAt: !837)
!869 = distinct !DILexicalBlock(scope: !820, file: !54, line: 862, column: 7)
!870 = !DILocation(line: 862, column: 19, scope: !869, inlinedAt: !837)
!871 = !DILocation(line: 862, column: 22, scope: !869, inlinedAt: !837)
!872 = !DILocation(line: 862, column: 7, scope: !820, inlinedAt: !837)
!873 = !DILocation(line: 868, column: 7, scope: !874, inlinedAt: !837)
!874 = distinct !DILexicalBlock(scope: !869, file: !54, line: 863, column: 5)
!875 = !DILocation(line: 870, column: 5, scope: !874, inlinedAt: !837)
!876 = !DILocation(line: 0, scope: !843, inlinedAt: !877)
!877 = distinct !DILocation(line: 874, column: 29, scope: !820, inlinedAt: !837)
!878 = !DILocation(line: 875, column: 3, scope: !820, inlinedAt: !837)
!879 = !DILocation(line: 877, column: 3, scope: !820, inlinedAt: !837)
!880 = !DILocation(line: 879, column: 1, scope: !820, inlinedAt: !837)
!881 = !DILocation(line: 212, column: 3, scope: !785)
!882 = !DISubprogram(name: "dcgettext", scope: !883, file: !883, line: 51, type: !884, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !886)
!883 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!884 = !DISubroutineType(types: !885)
!885 = !{!70, !77, !77, !73}
!886 = !{}
!887 = !DISubprogram(name: "fputs_unlocked", scope: !274, file: !274, line: 691, type: !888, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !886)
!888 = !DISubroutineType(types: !889)
!889 = !{!73, !890, !891}
!890 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !77)
!891 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !149)
!892 = !DILocation(line: 0, scope: !127)
!893 = !DILocation(line: 581, column: 7, scope: !135)
!894 = !{!895, !895, i64 0}
!895 = !{!"int", !798, i64 0}
!896 = !DILocation(line: 581, column: 19, scope: !135)
!897 = !DILocation(line: 581, column: 7, scope: !127)
!898 = !DILocation(line: 585, column: 26, scope: !134)
!899 = !DILocation(line: 0, scope: !134)
!900 = !DILocation(line: 586, column: 23, scope: !134)
!901 = !DILocation(line: 586, column: 28, scope: !134)
!902 = !DILocation(line: 586, column: 32, scope: !134)
!903 = !{!798, !798, i64 0}
!904 = !DILocation(line: 586, column: 38, scope: !134)
!905 = !DILocation(line: 0, scope: !843, inlinedAt: !906)
!906 = distinct !DILocation(line: 586, column: 41, scope: !134)
!907 = !DILocation(line: 1361, column: 11, scope: !843, inlinedAt: !906)
!908 = !DILocation(line: 1361, column: 10, scope: !843, inlinedAt: !906)
!909 = !DILocation(line: 586, column: 19, scope: !134)
!910 = !DILocation(line: 587, column: 5, scope: !134)
!911 = !DILocation(line: 588, column: 7, scope: !912)
!912 = distinct !DILexicalBlock(scope: !127, file: !54, line: 588, column: 7)
!913 = !DILocation(line: 588, column: 7, scope: !127)
!914 = !DILocation(line: 590, column: 7, scope: !915)
!915 = distinct !DILexicalBlock(scope: !912, file: !54, line: 589, column: 5)
!916 = !DILocation(line: 591, column: 7, scope: !915)
!917 = !DILocation(line: 595, column: 37, scope: !127)
!918 = !DILocation(line: 595, column: 35, scope: !127)
!919 = !DILocation(line: 596, column: 29, scope: !127)
!920 = !DILocation(line: 597, column: 8, scope: !142)
!921 = !DILocation(line: 597, column: 7, scope: !127)
!922 = !DILocation(line: 604, column: 24, scope: !141)
!923 = !DILocation(line: 604, column: 12, scope: !142)
!924 = !DILocation(line: 0, scope: !140)
!925 = !DILocation(line: 610, column: 16, scope: !140)
!926 = !DILocation(line: 610, column: 7, scope: !140)
!927 = !DILocation(line: 611, column: 21, scope: !140)
!928 = !{!929, !929, i64 0}
!929 = !{!"short", !798, i64 0}
!930 = !DILocation(line: 611, column: 19, scope: !140)
!931 = !DILocation(line: 611, column: 16, scope: !140)
!932 = !DILocation(line: 610, column: 30, scope: !140)
!933 = distinct !{!933, !926, !927, !860}
!934 = !DILocation(line: 612, column: 18, scope: !935)
!935 = distinct !DILexicalBlock(scope: !140, file: !54, line: 612, column: 11)
!936 = !DILocation(line: 612, column: 11, scope: !140)
!937 = !DILocation(line: 620, column: 23, scope: !127)
!938 = !DILocation(line: 625, column: 39, scope: !127)
!939 = !DILocation(line: 626, column: 3, scope: !127)
!940 = !DILocation(line: 626, column: 10, scope: !127)
!941 = !DILocation(line: 626, column: 21, scope: !127)
!942 = !DILocation(line: 628, column: 44, scope: !943)
!943 = distinct !DILexicalBlock(scope: !944, file: !54, line: 628, column: 11)
!944 = distinct !DILexicalBlock(scope: !127, file: !54, line: 627, column: 5)
!945 = !DILocation(line: 628, column: 32, scope: !943)
!946 = !DILocation(line: 628, column: 49, scope: !943)
!947 = !DILocation(line: 628, column: 11, scope: !944)
!948 = !DILocation(line: 630, column: 11, scope: !949)
!949 = distinct !DILexicalBlock(scope: !944, file: !54, line: 630, column: 11)
!950 = !DILocation(line: 630, column: 11, scope: !944)
!951 = !DILocation(line: 632, column: 26, scope: !952)
!952 = distinct !DILexicalBlock(scope: !953, file: !54, line: 632, column: 15)
!953 = distinct !DILexicalBlock(scope: !949, file: !54, line: 631, column: 9)
!954 = !DILocation(line: 632, column: 34, scope: !952)
!955 = !DILocation(line: 632, column: 37, scope: !952)
!956 = !DILocation(line: 632, column: 15, scope: !953)
!957 = !DILocation(line: 636, column: 29, scope: !958)
!958 = distinct !DILexicalBlock(scope: !953, file: !54, line: 636, column: 15)
!959 = !DILocation(line: 640, column: 16, scope: !944)
!960 = distinct !{!960, !939, !961, !860}
!961 = !DILocation(line: 641, column: 5, scope: !127)
!962 = !DILocation(line: 644, column: 3, scope: !127)
!963 = !DILocation(line: 0, scope: !843, inlinedAt: !964)
!964 = distinct !DILocation(line: 648, column: 31, scope: !127)
!965 = !DILocation(line: 0, scope: !843, inlinedAt: !966)
!966 = distinct !DILocation(line: 649, column: 31, scope: !127)
!967 = !DILocation(line: 0, scope: !843, inlinedAt: !968)
!968 = distinct !DILocation(line: 650, column: 31, scope: !127)
!969 = !DILocation(line: 0, scope: !843, inlinedAt: !970)
!970 = distinct !DILocation(line: 651, column: 31, scope: !127)
!971 = !DILocation(line: 0, scope: !843, inlinedAt: !972)
!972 = distinct !DILocation(line: 652, column: 31, scope: !127)
!973 = !DILocation(line: 0, scope: !843, inlinedAt: !974)
!974 = distinct !DILocation(line: 653, column: 31, scope: !127)
!975 = !DILocation(line: 0, scope: !843, inlinedAt: !976)
!976 = distinct !DILocation(line: 654, column: 31, scope: !127)
!977 = !DILocation(line: 0, scope: !843, inlinedAt: !978)
!978 = distinct !DILocation(line: 655, column: 31, scope: !127)
!979 = !DILocation(line: 0, scope: !843, inlinedAt: !980)
!980 = distinct !DILocation(line: 656, column: 31, scope: !127)
!981 = !DILocation(line: 0, scope: !843, inlinedAt: !982)
!982 = distinct !DILocation(line: 657, column: 31, scope: !127)
!983 = !DILocation(line: 663, column: 7, scope: !984)
!984 = distinct !DILexicalBlock(scope: !127, file: !54, line: 663, column: 7)
!985 = !DILocation(line: 664, column: 7, scope: !984)
!986 = !DILocation(line: 664, column: 10, scope: !984)
!987 = !DILocation(line: 663, column: 7, scope: !127)
!988 = !DILocation(line: 669, column: 7, scope: !989)
!989 = distinct !DILexicalBlock(scope: !984, file: !54, line: 665, column: 5)
!990 = !DILocation(line: 671, column: 5, scope: !989)
!991 = !DILocation(line: 676, column: 7, scope: !992)
!992 = distinct !DILexicalBlock(scope: !984, file: !54, line: 673, column: 5)
!993 = !DILocation(line: 679, column: 3, scope: !127)
!994 = !DILocation(line: 683, column: 3, scope: !127)
!995 = !DILocation(line: 686, column: 3, scope: !127)
!996 = !DILocation(line: 688, column: 3, scope: !127)
!997 = !DILocation(line: 691, column: 3, scope: !127)
!998 = !DILocation(line: 695, column: 3, scope: !127)
!999 = !DILocation(line: 696, column: 1, scope: !127)
!1000 = !DISubprogram(name: "setlocale", scope: !1001, file: !1001, line: 122, type: !1002, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !886)
!1001 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!70, !73, !77}
!1004 = !DISubprogram(name: "getenv", scope: !1005, file: !1005, line: 641, type: !1006, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !886)
!1005 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!70, !77}
!1008 = !DISubprogram(name: "fwrite_unlocked", scope: !274, file: !274, line: 704, type: !1009, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !886)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!75, !1011, !75, !75, !891}
!1011 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !68)
!1012 = !DILocation(line: 0, scope: !83)
!1013 = !DILocation(line: 237, column: 3, scope: !83)
!1014 = !DILocation(line: 237, column: 21, scope: !83)
!1015 = !DILocation(line: 242, column: 21, scope: !83)
!1016 = !DILocation(line: 242, column: 3, scope: !83)
!1017 = !DILocation(line: 243, column: 3, scope: !83)
!1018 = !DILocation(line: 244, column: 3, scope: !83)
!1019 = !DILocation(line: 245, column: 3, scope: !83)
!1020 = !DILocation(line: 247, column: 3, scope: !83)
!1021 = !DILocalVariable(name: "x", arg: 1, scope: !1022, file: !3, line: 216, type: !1025)
!1022 = distinct !DISubprogram(name: "rm_option_init", scope: !3, file: !3, line: 216, type: !1023, scopeLine: 217, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1026)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{null, !1025}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!1026 = !{!1021}
!1027 = !DILocation(line: 0, scope: !1022, inlinedAt: !1028)
!1028 = distinct !DILocation(line: 249, column: 3, scope: !83)
!1029 = !DILocation(line: 219, column: 6, scope: !1022, inlinedAt: !1028)
!1030 = !DILocation(line: 220, column: 6, scope: !1022, inlinedAt: !1028)
!1031 = !DILocation(line: 221, column: 6, scope: !1022, inlinedAt: !1028)
!1032 = !DILocation(line: 222, column: 6, scope: !1022, inlinedAt: !1028)
!1033 = !DILocation(line: 223, column: 6, scope: !1022, inlinedAt: !1028)
!1034 = !DILocation(line: 223, column: 19, scope: !1022, inlinedAt: !1028)
!1035 = !{!1036, !797, i64 16}
!1036 = !{!"rm_options", !1037, i64 0, !798, i64 4, !1037, i64 8, !1037, i64 9, !1037, i64 10, !797, i64 16, !1037, i64 24, !1037, i64 25, !1037, i64 26, !1037, i64 27}
!1037 = !{!"_Bool", !798, i64 0}
!1038 = !DILocation(line: 224, column: 6, scope: !1022, inlinedAt: !1028)
!1039 = !DILocation(line: 225, column: 18, scope: !1022, inlinedAt: !1028)
!1040 = !DILocation(line: 225, column: 6, scope: !1022, inlinedAt: !1028)
!1041 = !DILocation(line: 225, column: 16, scope: !1022, inlinedAt: !1028)
!1042 = !DILocation(line: 226, column: 6, scope: !1022, inlinedAt: !1028)
!1043 = !DILocation(line: 230, column: 6, scope: !1022, inlinedAt: !1028)
!1044 = !DILocation(line: 230, column: 26, scope: !1022, inlinedAt: !1028)
!1045 = !{!1036, !1037, i64 27}
!1046 = !DILocation(line: 254, column: 3, scope: !83)
!1047 = !DILocation(line: 254, column: 15, scope: !83)
!1048 = !DILocation(line: 266, column: 11, scope: !120)
!1049 = !DILocation(line: 272, column: 11, scope: !120)
!1050 = !DILocation(line: 278, column: 11, scope: !120)
!1051 = !DILocation(line: 283, column: 11, scope: !120)
!1052 = !DILocation(line: 288, column: 17, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !119, file: !3, line: 288, column: 17)
!1054 = !DILocation(line: 288, column: 17, scope: !119)
!1055 = !DILocation(line: 289, column: 19, scope: !1053)
!1056 = !DILocation(line: 0, scope: !119)
!1057 = !DILocation(line: 293, column: 13, scope: !119)
!1058 = !DILocation(line: 298, column: 17, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !119, file: !3, line: 294, column: 15)
!1060 = !DILocation(line: 304, column: 17, scope: !1059)
!1061 = !DILocation(line: 310, column: 17, scope: !1059)
!1062 = !DILocation(line: 317, column: 11, scope: !120)
!1063 = !DILocation(line: 320, column: 29, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !120, file: !3, line: 320, column: 15)
!1065 = !DILocation(line: 320, column: 36, scope: !1064)
!1066 = !DILocation(line: 320, column: 24, scope: !1064)
!1067 = !DILocation(line: 0, scope: !843, inlinedAt: !1068)
!1068 = distinct !DILocation(line: 320, column: 17, scope: !1064)
!1069 = !DILocation(line: 1361, column: 11, scope: !843, inlinedAt: !1068)
!1070 = !DILocation(line: 1361, column: 10, scope: !843, inlinedAt: !1068)
!1071 = !DILocation(line: 320, column: 15, scope: !120)
!1072 = !DILocation(line: 321, column: 13, scope: !1064)
!1073 = !DILocation(line: 327, column: 15, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !120, file: !3, line: 327, column: 15)
!1075 = !DILocation(line: 327, column: 15, scope: !120)
!1076 = !DILocation(line: 0, scope: !843, inlinedAt: !1077)
!1077 = distinct !DILocation(line: 329, column: 19, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1079, file: !3, line: 329, column: 19)
!1079 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 328, column: 13)
!1080 = !DILocation(line: 1361, column: 11, scope: !843, inlinedAt: !1077)
!1081 = !DILocation(line: 1361, column: 10, scope: !843, inlinedAt: !1077)
!1082 = !DILocation(line: 329, column: 19, scope: !1079)
!1083 = distinct !{!1083, !1046, !1084, !860}
!1084 = !DILocation(line: 353, column: 5, scope: !83)
!1085 = !DILocation(line: 332, column: 17, scope: !1078)
!1086 = !DILocation(line: 341, column: 11, scope: !120)
!1087 = !DILocation(line: 345, column: 11, scope: !120)
!1088 = !DILocation(line: 347, column: 9, scope: !120)
!1089 = !DILocation(line: 348, column: 9, scope: !120)
!1090 = !DILocation(line: 350, column: 11, scope: !120)
!1091 = !DILocation(line: 351, column: 11, scope: !120)
!1092 = !DILocation(line: 344, column: 21, scope: !120)
!1093 = !{!1036, !1037, i64 26}
!1094 = !DILocation(line: 340, column: 23, scope: !120)
!1095 = !{!1036, !1037, i64 25}
!1096 = !DILocation(line: 330, column: 37, scope: !1078)
!1097 = !{!1036, !1037, i64 24}
!1098 = !DILocation(line: 316, column: 29, scope: !120)
!1099 = !{!1036, !1037, i64 8}
!1100 = !DILocation(line: 0, scope: !120)
!1101 = !{!1036, !798, i64 4}
!1102 = !{!1036, !1037, i64 0}
!1103 = !DILocation(line: 282, column: 23, scope: !120)
!1104 = !{!1036, !1037, i64 9}
!1105 = !DILocation(line: 259, column: 38, scope: !120)
!1106 = !{!1036, !1037, i64 10}
!1107 = !DILocation(line: 355, column: 15, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !83, file: !3, line: 355, column: 7)
!1109 = !DILocation(line: 355, column: 12, scope: !1108)
!1110 = !DILocation(line: 355, column: 7, scope: !83)
!1111 = !DILocation(line: 357, column: 13, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1113, file: !3, line: 357, column: 11)
