; ModuleID = 'src/chown.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon.28 }
%union.anon.28 = type { i32 }
%struct.Chown_option = type { i32, i8, %struct.dev_ino*, i8, i8, i8*, i8* }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [2 x i32] }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }

!6 = !DIFile(filename: "src/chown.h", directory: "/src", checksumkind: CSK_MD5, checksum: "50ba9cc23f94a0654dc79a8cbc8f764f")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "CHOWN_CHOWN", value: 0)
!10 = !DIEnumerator(name: "CHOWN_CHGRP", value: 1)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !12, line: 32, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "src/chown-core.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a6be4c36df40aa37134c0db7329b7a85")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "V_high", value: 0)
!15 = !DIEnumerator(name: "V_changes_only", value: 1)
!16 = !DIEnumerator(name: "V_off", value: 2)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !18, line: 42, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!20 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!21 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!22 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!23 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!24 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!25 = !DIEnumerator(name: "c_quoting_style", value: 5)
!26 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!27 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!28 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!29 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!30 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 46, baseType: !7, size: 32, elements: !33)
!32 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!34 = !DIEnumerator(name: "_ISupper", value: 256)
!35 = !DIEnumerator(name: "_ISlower", value: 512)
!36 = !DIEnumerator(name: "_ISalpha", value: 1024)
!37 = !DIEnumerator(name: "_ISdigit", value: 2048)
!38 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!39 = !DIEnumerator(name: "_ISspace", value: 8192)
!40 = !DIEnumerator(name: "_ISprint", value: 16384)
!41 = !DIEnumerator(name: "_ISgraph", value: 32768)
!42 = !DIEnumerator(name: "_ISblank", value: 1)
!43 = !DIEnumerator(name: "_IScntrl", value: 2)
!44 = !DIEnumerator(name: "_ISpunct", value: 4)
!45 = !DIEnumerator(name: "_ISalnum", value: 8)
!46 = !{!47, !49, !50, !51, !52, !55, !57}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 46, baseType: !54)
!53 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!54 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!57 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!58 = !{!59, !158, !160, !0}
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !61, file: !3, line: 353, type: !87, isLocal: true, isDefinition: true)
!61 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 178, type: !62, scopeLine: 179, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !65)
!62 = !DISubroutineType(types: !63)
!63 = !{!50, !50, !64}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!65 = !{!66, !67, !68, !70, !75, !78, !79, !80, !100, !101, !105, !106, !110, !111, !112, !150, !152, !153, !154, !157}
!66 = !DILocalVariable(name: "argc", arg: 1, scope: !61, file: !3, line: 178, type: !50)
!67 = !DILocalVariable(name: "argv", arg: 2, scope: !61, file: !3, line: 178, type: !64)
!68 = !DILocalVariable(name: "preserve_root", scope: !61, file: !3, line: 180, type: !69)
!69 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!70 = !DILocalVariable(name: "required_uid", scope: !61, file: !3, line: 184, type: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !72, line: 79, baseType: !73)
!72 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !74, line: 146, baseType: !7)
!74 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!75 = !DILocalVariable(name: "required_gid", scope: !61, file: !3, line: 185, type: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !72, line: 64, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !74, line: 147, baseType: !7)
!78 = !DILocalVariable(name: "bit_flags", scope: !61, file: !3, line: 188, type: !50)
!79 = !DILocalVariable(name: "dereference", scope: !61, file: !3, line: 192, type: !50)
!80 = !DILocalVariable(name: "chopt", scope: !61, file: !3, line: 194, type: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chown_option", file: !12, line: 44, size: 320, elements: !82)
!82 = !{!83, !84, !85, !96, !97, !98, !99}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !81, file: !12, line: 47, baseType: !11, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "recurse", scope: !81, file: !12, line: 50, baseType: !69, size: 8, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !81, file: !12, line: 54, baseType: !86, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !88, line: 30, size: 128, elements: !89)
!88 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!89 = !{!90, !93}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !87, file: !88, line: 32, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !72, line: 47, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !74, line: 148, baseType: !54)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !87, file: !88, line: 33, baseType: !94, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !72, line: 59, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !74, line: 145, baseType: !54)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "affect_symlink_referent", scope: !81, file: !12, line: 57, baseType: !69, size: 8, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "force_silent", scope: !81, file: !12, line: 60, baseType: !69, size: 8, offset: 136)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "user_name", scope: !81, file: !12, line: 63, baseType: !47, size: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !81, file: !12, line: 66, baseType: !47, size: 64, offset: 256)
!100 = !DILocalVariable(name: "optc", scope: !61, file: !3, line: 206, type: !50)
!101 = !DILocalVariable(name: "warn", scope: !102, file: !3, line: 247, type: !69)
!102 = distinct !DILexicalBlock(scope: !103, file: !3, line: 246, column: 11)
!103 = distinct !DILexicalBlock(scope: !104, file: !3, line: 211, column: 9)
!104 = distinct !DILexicalBlock(scope: !61, file: !3, line: 209, column: 5)
!105 = !DILocalVariable(name: "e", scope: !102, file: !3, line: 248, type: !55)
!106 = !DILocalVariable(name: "__errstatus", scope: !107, file: !3, line: 252, type: !109)
!107 = distinct !DILexicalBlock(scope: !108, file: !3, line: 252, column: 15)
!108 = distinct !DILexicalBlock(scope: !102, file: !3, line: 251, column: 17)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!110 = !DILocalVariable(name: "uid", scope: !61, file: !3, line: 304, type: !71)
!111 = !DILocalVariable(name: "gid", scope: !61, file: !3, line: 305, type: !76)
!112 = !DILocalVariable(name: "ref_stats", scope: !113, file: !3, line: 309, type: !115)
!113 = distinct !DILexicalBlock(scope: !114, file: !3, line: 308, column: 5)
!114 = distinct !DILexicalBlock(scope: !61, file: !3, line: 307, column: 7)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !116, line: 44, size: 1024, elements: !117)
!116 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!117 = !{!118, !119, !120, !122, !124, !125, !126, !127, !128, !131, !133, !134, !136, !144, !145, !146}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !115, file: !116, line: 46, baseType: !95, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !115, file: !116, line: 47, baseType: !92, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !115, file: !116, line: 48, baseType: !121, size: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !74, line: 150, baseType: !7)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !115, file: !116, line: 49, baseType: !123, size: 32, offset: 160)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !74, line: 151, baseType: !7)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !115, file: !116, line: 50, baseType: !73, size: 32, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !115, file: !116, line: 51, baseType: !77, size: 32, offset: 224)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !115, file: !116, line: 52, baseType: !95, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !115, file: !116, line: 53, baseType: !95, size: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !115, file: !116, line: 54, baseType: !129, size: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !74, line: 152, baseType: !130)
!130 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !115, file: !116, line: 55, baseType: !132, size: 32, offset: 448)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !74, line: 175, baseType: !50)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !115, file: !116, line: 56, baseType: !50, size: 32, offset: 480)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !115, file: !116, line: 57, baseType: !135, size: 64, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !74, line: 180, baseType: !130)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !115, file: !116, line: 65, baseType: !137, size: 128, offset: 576)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !138, line: 11, size: 128, elements: !139)
!138 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!139 = !{!140, !142}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !137, file: !138, line: 16, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !74, line: 160, baseType: !130)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !137, file: !138, line: 21, baseType: !143, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !74, line: 197, baseType: !130)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !115, file: !116, line: 66, baseType: !137, size: 128, offset: 704)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !115, file: !116, line: 67, baseType: !137, size: 128, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !115, file: !116, line: 79, baseType: !147, size: 64, offset: 960)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 64, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 2)
!150 = !DILocalVariable(name: "ug", scope: !151, file: !3, line: 324, type: !47)
!151 = distinct !DILexicalBlock(scope: !114, file: !3, line: 323, column: 5)
!152 = !DILocalVariable(name: "warn", scope: !151, file: !3, line: 331, type: !69)
!153 = !DILocalVariable(name: "e", scope: !151, file: !3, line: 332, type: !55)
!154 = !DILocalVariable(name: "__errstatus", scope: !155, file: !3, line: 340, type: !109)
!155 = distinct !DILexicalBlock(scope: !156, file: !3, line: 340, column: 9)
!156 = distinct !DILexicalBlock(scope: !151, file: !3, line: 339, column: 11)
!157 = !DILocalVariable(name: "ok", scope: !61, file: !3, line: 361, type: !69)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "reference_file", scope: !2, file: !3, line: 41, type: !47, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !162, file: !163, line: 575, type: !50, isLocal: true, isDefinition: true)
!162 = distinct !DISubprogram(name: "oputs_", scope: !163, file: !163, line: 573, type: !164, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !166)
!163 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!164 = !DISubroutineType(types: !165)
!165 = !{null, !55, !55}
!166 = !{!167, !168, !169, !172, !173, !174, !175, !179, !180, !181, !182, !184, !237, !238, !239, !241, !242}
!167 = !DILocalVariable(name: "program", arg: 1, scope: !162, file: !163, line: 573, type: !55)
!168 = !DILocalVariable(name: "option", arg: 2, scope: !162, file: !163, line: 573, type: !55)
!169 = !DILocalVariable(name: "term", scope: !170, file: !163, line: 585, type: !55)
!170 = distinct !DILexicalBlock(scope: !171, file: !163, line: 582, column: 5)
!171 = distinct !DILexicalBlock(scope: !162, file: !163, line: 581, column: 7)
!172 = !DILocalVariable(name: "double_space", scope: !162, file: !163, line: 594, type: !69)
!173 = !DILocalVariable(name: "first_word", scope: !162, file: !163, line: 595, type: !55)
!174 = !DILocalVariable(name: "option_text", scope: !162, file: !163, line: 596, type: !55)
!175 = !DILocalVariable(name: "s", scope: !176, file: !163, line: 608, type: !55)
!176 = distinct !DILexicalBlock(scope: !177, file: !163, line: 605, column: 5)
!177 = distinct !DILexicalBlock(scope: !178, file: !163, line: 604, column: 12)
!178 = distinct !DILexicalBlock(scope: !162, file: !163, line: 597, column: 7)
!179 = !DILocalVariable(name: "spaces", scope: !176, file: !163, line: 609, type: !52)
!180 = !DILocalVariable(name: "anchor_len", scope: !162, file: !163, line: 620, type: !52)
!181 = !DILocalVariable(name: "desc_text", scope: !162, file: !163, line: 625, type: !55)
!182 = !DILocalVariable(name: "__ptr", scope: !183, file: !163, line: 644, type: !55)
!183 = distinct !DILexicalBlock(scope: !162, file: !163, line: 644, column: 3)
!184 = !DILocalVariable(name: "__stream", scope: !183, file: !163, line: 644, type: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !187, line: 7, baseType: !188)
!187 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !189, line: 49, size: 1728, elements: !190)
!189 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !206, !208, !209, !210, !211, !212, !214, !218, !221, !223, !226, !229, !230, !231, !232, !233}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !188, file: !189, line: 51, baseType: !50, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !188, file: !189, line: 54, baseType: !47, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !188, file: !189, line: 55, baseType: !47, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !188, file: !189, line: 56, baseType: !47, size: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !188, file: !189, line: 57, baseType: !47, size: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !188, file: !189, line: 58, baseType: !47, size: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !188, file: !189, line: 59, baseType: !47, size: 64, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !188, file: !189, line: 60, baseType: !47, size: 64, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !188, file: !189, line: 61, baseType: !47, size: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !188, file: !189, line: 64, baseType: !47, size: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !188, file: !189, line: 65, baseType: !47, size: 64, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !188, file: !189, line: 66, baseType: !47, size: 64, offset: 704)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !188, file: !189, line: 68, baseType: !204, size: 64, offset: 768)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !189, line: 36, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !188, file: !189, line: 70, baseType: !207, size: 64, offset: 832)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !188, file: !189, line: 72, baseType: !50, size: 32, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !188, file: !189, line: 73, baseType: !50, size: 32, offset: 928)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !188, file: !189, line: 74, baseType: !129, size: 64, offset: 960)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !188, file: !189, line: 77, baseType: !51, size: 16, offset: 1024)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !188, file: !189, line: 78, baseType: !213, size: 8, offset: 1040)
!213 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !188, file: !189, line: 79, baseType: !215, size: 8, offset: 1048)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 1)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !188, file: !189, line: 81, baseType: !219, size: 64, offset: 1088)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !189, line: 43, baseType: null)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !188, file: !189, line: 89, baseType: !222, size: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !74, line: 153, baseType: !130)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !188, file: !189, line: 91, baseType: !224, size: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !189, line: 37, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !188, file: !189, line: 92, baseType: !227, size: 64, offset: 1280)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !189, line: 38, flags: DIFlagFwdDecl)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !188, file: !189, line: 93, baseType: !207, size: 64, offset: 1344)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !188, file: !189, line: 94, baseType: !49, size: 64, offset: 1408)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !188, file: !189, line: 95, baseType: !52, size: 64, offset: 1472)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !188, file: !189, line: 96, baseType: !50, size: 32, offset: 1536)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !188, file: !189, line: 98, baseType: !234, size: 160, offset: 1568)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 160, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 20)
!237 = !DILocalVariable(name: "__cnt", scope: !183, file: !163, line: 644, type: !52)
!238 = !DILocalVariable(name: "url_program", scope: !162, file: !163, line: 648, type: !55)
!239 = !DILocalVariable(name: "__ptr", scope: !240, file: !163, line: 686, type: !55)
!240 = distinct !DILexicalBlock(scope: !162, file: !163, line: 686, column: 3)
!241 = !DILocalVariable(name: "__stream", scope: !240, file: !163, line: 686, type: !185)
!242 = !DILocalVariable(name: "__cnt", scope: !240, file: !163, line: 686, type: !52)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 3584, elements: !253)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !246, line: 50, size: 256, elements: !247)
!246 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!247 = !{!248, !249, !250, !252}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !245, file: !246, line: 52, baseType: !55, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !245, file: !246, line: 55, baseType: !50, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !245, file: !246, line: 56, baseType: !251, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !245, file: !246, line: 57, baseType: !50, size: 32, offset: 192)
!253 = !{!254}
!254 = !DISubrange(count: 14)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "chown_mode", scope: !257, file: !258, line: 2, type: !5, isLocal: false, isDefinition: true)
!257 = distinct !DICompileUnit(language: DW_LANG_C99, file: !258, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !259, globals: !260, splitDebugInlining: false, nameTableKind: None)
!258 = !DIFile(filename: "src/chown-chown.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3a1b210c35e4963aa8514922b01ea0b2")
!259 = !{!5}
!260 = !{!255}
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "Version", scope: !263, file: !264, line: 3, type: !55, isLocal: false, isDefinition: true)
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !265, splitDebugInlining: false, nameTableKind: None)
!264 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!265 = !{!261}
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "file_name", scope: !268, file: !269, line: 45, type: !55, isLocal: true, isDefinition: true)
!268 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !270, splitDebugInlining: false, nameTableKind: None)
!269 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!270 = !{!266, !271}
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !268, file: !269, line: 55, type: !69, isLocal: true, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !275, file: !276, line: 66, type: !311, isLocal: false, isDefinition: true)
!275 = distinct !DICompileUnit(language: DW_LANG_C99, file: !276, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !277, globals: !278, splitDebugInlining: false, nameTableKind: None)
!276 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!277 = !{!49, !57}
!278 = !{!279, !305, !273, !307, !309}
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "old_file_name", scope: !281, file: !276, line: 304, type: !55, isLocal: true, isDefinition: true)
!281 = distinct !DISubprogram(name: "verror_at_line", scope: !276, file: !276, line: 298, type: !282, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !275, retainedNodes: !298)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !50, !50, !55, !7, !55, !284}
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !285, line: 52, baseType: !286)
!285 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !287, line: 32, baseType: !288)
!287 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !289, baseType: !290)
!289 = !DIFile(filename: "lib/error.c", directory: "/src")
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !291, size: 256, elements: !292)
!291 = !DINamespace(name: "std", scope: null)
!292 = !{!293, !294, !295, !296, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !290, file: !289, baseType: !49, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !290, file: !289, baseType: !49, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !290, file: !289, baseType: !49, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !290, file: !289, baseType: !50, size: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !290, file: !289, baseType: !50, size: 32, offset: 224)
!298 = !{!299, !300, !301, !302, !303, !304}
!299 = !DILocalVariable(name: "status", arg: 1, scope: !281, file: !276, line: 298, type: !50)
!300 = !DILocalVariable(name: "errnum", arg: 2, scope: !281, file: !276, line: 298, type: !50)
!301 = !DILocalVariable(name: "file_name", arg: 3, scope: !281, file: !276, line: 298, type: !55)
!302 = !DILocalVariable(name: "line_number", arg: 4, scope: !281, file: !276, line: 298, type: !7)
!303 = !DILocalVariable(name: "message", arg: 5, scope: !281, file: !276, line: 298, type: !55)
!304 = !DILocalVariable(name: "args", arg: 6, scope: !281, file: !276, line: 298, type: !284)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "old_line_number", scope: !281, file: !276, line: 305, type: !7, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "error_message_count", scope: !275, file: !276, line: 69, type: !7, isLocal: false, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !275, file: !276, line: 295, type: !50, isLocal: false, isDefinition: true)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{null}
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "default_tuning", scope: !316, file: !317, line: 134, type: !321, isLocal: true, isDefinition: true)
!316 = distinct !DICompileUnit(language: DW_LANG_C99, file: !317, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !318, globals: !320, splitDebugInlining: false, nameTableKind: None)
!317 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!318 = !{!54, !49, !319, !52}
!319 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!320 = !{!314}
!321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !323, line: 52, baseType: !324)
!323 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !323, line: 40, size: 160, elements: !325)
!325 = !{!326, !327, !328, !329, !330}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !324, file: !323, line: 45, baseType: !319, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !324, file: !323, line: 46, baseType: !319, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !324, file: !323, line: 47, baseType: !319, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !324, file: !323, line: 48, baseType: !319, size: 32, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !324, file: !323, line: 49, baseType: !69, size: 8, offset: 128)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "program_name", scope: !333, file: !334, line: 31, type: !55, isLocal: false, isDefinition: true)
!333 = distinct !DICompileUnit(language: DW_LANG_C99, file: !334, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !335, globals: !336, splitDebugInlining: false, nameTableKind: None)
!334 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!335 = !{!47}
!336 = !{!331}
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "utf07FF", scope: !339, file: !340, line: 46, type: !370, isLocal: true, isDefinition: true)
!339 = distinct !DISubprogram(name: "proper_name_lite", scope: !340, file: !340, line: 38, type: !341, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !345)
!340 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!341 = !DISubroutineType(types: !342)
!342 = !{!55, !55, !55}
!343 = distinct !DICompileUnit(language: DW_LANG_C99, file: !340, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !344, splitDebugInlining: false, nameTableKind: None)
!344 = !{!337}
!345 = !{!346, !347, !348, !349, !354}
!346 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !339, file: !340, line: 38, type: !55)
!347 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !339, file: !340, line: 38, type: !55)
!348 = !DILocalVariable(name: "translation", scope: !339, file: !340, line: 40, type: !55)
!349 = !DILocalVariable(name: "w", scope: !339, file: !340, line: 47, type: !350)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !351, line: 37, baseType: !352)
!351 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !74, line: 57, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !74, line: 42, baseType: !7)
!354 = !DILocalVariable(name: "mbs", scope: !339, file: !340, line: 48, type: !355)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !356, line: 6, baseType: !357)
!356 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !358, line: 21, baseType: !359)
!358 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !358, line: 13, size: 64, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !359, file: !358, line: 15, baseType: !50, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !359, file: !358, line: 20, baseType: !363, size: 32, offset: 32)
!363 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !359, file: !358, line: 16, size: 32, elements: !364)
!364 = !{!365, !366}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !363, file: !358, line: 18, baseType: !7, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !363, file: !358, line: 19, baseType: !367, size: 32)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 4)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 16, elements: !148)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !373, file: !374, line: 76, type: !442, isLocal: false, isDefinition: true)
!373 = distinct !DICompileUnit(language: DW_LANG_C99, file: !374, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !375, retainedTypes: !381, globals: !382, splitDebugInlining: false, nameTableKind: None)
!374 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!375 = !{!17, !376, !31}
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !18, line: 254, baseType: !7, size: 32, elements: !377)
!377 = !{!378, !379, !380}
!378 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!379 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!380 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!381 = !{!50, !51, !52}
!382 = !{!371, !383, !389, !401, !403, !408, !431, !438, !440}
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !373, file: !374, line: 92, type: !385, isLocal: false, isDefinition: true)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 320, elements: !387)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!387 = !{!388}
!388 = !DISubrange(count: 10)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !373, file: !374, line: 1040, type: !391, isLocal: false, isDefinition: true)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !374, line: 56, size: 448, elements: !392)
!392 = !{!393, !394, !395, !399, !400}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !391, file: !374, line: 59, baseType: !17, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !391, file: !374, line: 62, baseType: !50, size: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !391, file: !374, line: 66, baseType: !396, size: 256, offset: 64)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 8)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !391, file: !374, line: 69, baseType: !55, size: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !391, file: !374, line: 72, baseType: !55, size: 64, offset: 384)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !373, file: !374, line: 107, type: !391, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "slot0", scope: !373, file: !374, line: 831, type: !405, isLocal: true, isDefinition: true)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 2048, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 256)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "quote", scope: !410, file: !374, line: 228, type: !429, isLocal: true, isDefinition: true)
!410 = distinct !DISubprogram(name: "gettext_quote", scope: !374, file: !374, line: 197, type: !411, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !373, retainedNodes: !413)
!411 = !DISubroutineType(types: !412)
!412 = !{!55, !55, !17}
!413 = !{!414, !415, !416, !417, !418}
!414 = !DILocalVariable(name: "msgid", arg: 1, scope: !410, file: !374, line: 197, type: !55)
!415 = !DILocalVariable(name: "s", arg: 2, scope: !410, file: !374, line: 197, type: !17)
!416 = !DILocalVariable(name: "translation", scope: !410, file: !374, line: 199, type: !55)
!417 = !DILocalVariable(name: "w", scope: !410, file: !374, line: 229, type: !350)
!418 = !DILocalVariable(name: "mbs", scope: !410, file: !374, line: 230, type: !419)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !356, line: 6, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !358, line: 21, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !358, line: 13, size: 64, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !421, file: !358, line: 15, baseType: !50, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !421, file: !358, line: 20, baseType: !425, size: 32, offset: 32)
!425 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !421, file: !358, line: 16, size: 32, elements: !426)
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !425, file: !358, line: 18, baseType: !7, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !425, file: !358, line: 19, baseType: !367, size: 32)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 64, elements: !430)
!430 = !{!149, !369}
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "slotvec", scope: !373, file: !374, line: 834, type: !433, isLocal: true, isDefinition: true)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !374, line: 823, size: 128, elements: !435)
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !434, file: !374, line: 825, baseType: !52, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !434, file: !374, line: 826, baseType: !47, size: 64, offset: 64)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "nslots", scope: !373, file: !374, line: 832, type: !50, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "slotvec0", scope: !373, file: !374, line: 833, type: !434, isLocal: true, isDefinition: true)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 704, elements: !444)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!444 = !{!445}
!445 = !DISubrange(count: 11)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !448, file: !449, line: 26, type: !451, isLocal: false, isDefinition: true)
!448 = distinct !DICompileUnit(language: DW_LANG_C99, file: !449, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !450, splitDebugInlining: false, nameTableKind: None)
!449 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!450 = !{!446}
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 376, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 47)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "exit_failure", scope: !456, file: !457, line: 24, type: !459, isLocal: false, isDefinition: true)
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !458, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!458 = !{!454}
!459 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !50)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !462, file: !463, line: 506, type: !50, isLocal: true, isDefinition: true)
!462 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !463, file: !463, line: 485, type: !464, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !466, retainedNodes: !468)
!463 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!464 = !DISubroutineType(types: !465)
!465 = !{!50, !50, !50}
!466 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !467, splitDebugInlining: false, nameTableKind: None)
!467 = !{!460}
!468 = !{!469, !470, !471, !472, !475}
!469 = !DILocalVariable(name: "fd", arg: 1, scope: !462, file: !463, line: 485, type: !50)
!470 = !DILocalVariable(name: "target", arg: 2, scope: !462, file: !463, line: 485, type: !50)
!471 = !DILocalVariable(name: "result", scope: !462, file: !463, line: 487, type: !50)
!472 = !DILocalVariable(name: "flags", scope: !473, file: !463, line: 530, type: !50)
!473 = distinct !DILexicalBlock(scope: !474, file: !463, line: 529, column: 5)
!474 = distinct !DILexicalBlock(scope: !462, file: !463, line: 528, column: 7)
!475 = !DILocalVariable(name: "saved_errno", scope: !476, file: !463, line: 533, type: !50)
!476 = distinct !DILexicalBlock(scope: !477, file: !463, line: 532, column: 9)
!477 = distinct !DILexicalBlock(scope: !473, file: !463, line: 531, column: 11)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "internal_state", scope: !480, file: !481, line: 97, type: !484, isLocal: true, isDefinition: true)
!480 = distinct !DICompileUnit(language: DW_LANG_C99, file: !481, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !482, globals: !483, splitDebugInlining: false, nameTableKind: None)
!481 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!482 = !{!49, !52, !57}
!483 = !{!478}
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !356, line: 6, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !358, line: 21, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !358, line: 13, size: 64, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !486, file: !358, line: 15, baseType: !50, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !486, file: !358, line: 20, baseType: !490, size: 32, offset: 32)
!490 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !486, file: !358, line: 16, size: 32, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !490, file: !358, line: 18, baseType: !7, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !490, file: !358, line: 19, baseType: !367, size: 32)
!494 = distinct !DICompileUnit(language: DW_LANG_C99, file: !495, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !496, retainedTypes: !510, splitDebugInlining: false, nameTableKind: None)
!495 = !DIFile(filename: "src/chown-core.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0cc937f337309996c839dc01ee932e6")
!496 = !{!11, !17, !497, !504}
!497 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RCH_status", file: !495, line: 38, baseType: !7, size: 32, elements: !498)
!498 = !{!499, !500, !501, !502, !503}
!499 = !DIEnumerator(name: "RC_ok", value: 2)
!500 = !DIEnumerator(name: "RC_excluded", value: 3)
!501 = !DIEnumerator(name: "RC_inode_changed", value: 4)
!502 = !DIEnumerator(name: "RC_do_ordinary_chown", value: 5)
!503 = !DIEnumerator(name: "RC_error", value: 6)
!504 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !12, line: 24, baseType: !7, size: 32, elements: !505)
!505 = !{!506, !507, !508, !509}
!506 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 1)
!507 = !DIEnumerator(name: "CH_SUCCEEDED", value: 2)
!508 = !DIEnumerator(name: "CH_FAILED", value: 3)
!509 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 4)
!510 = !{!71, !76, !49}
!511 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !513, retainedTypes: !660, splitDebugInlining: false, nameTableKind: None)
!512 = !DIFile(filename: "lib/fts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "790475fd5d16e5b9bfdbc337c34f4fa2")
!513 = !{!514, !518, !636, !639, !643, !654, !657}
!514 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !512, line: 159, baseType: !7, size: 32, elements: !515)
!515 = !{!516, !517}
!516 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!517 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!518 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !520, file: !519, line: 54, baseType: !7, size: 32, elements: !634)
!519 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/src", checksumkind: CSK_MD5, checksum: "270205dca4a7d3b7c2e61f5b3b63f3eb")
!520 = distinct !DISubprogram(name: "setup_dir", scope: !519, file: !519, line: 50, type: !521, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !511, retainedNodes: !632)
!521 = !DISubroutineType(types: !522)
!522 = !{!69, !523}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !525, line: 233, baseType: !526)
!525 = !DIFile(filename: "./lib/fts_.h", directory: "/src", checksumkind: CSK_MD5, checksum: "b8640bdd941d220a051ddea014397796")
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !525, line: 115, size: 1024, elements: !527)
!527 = !{!528, !582, !583, !585, !586, !587, !588, !589, !590, !591, !598, !599, !602, !621}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !526, file: !525, line: 116, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !525, line: 235, size: 1920, elements: !531)
!531 = !{!532, !533, !534, !535, !540, !541, !542, !543, !544, !545, !546, !547, !548, !550, !551, !552, !553, !554, !578}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !530, file: !525, line: 236, baseType: !529, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !530, file: !525, line: 237, baseType: !529, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !530, file: !525, line: 238, baseType: !529, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !530, file: !525, line: 239, baseType: !536, size: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !538, line: 127, baseType: !539)
!538 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !538, line: 127, flags: DIFlagFwdDecl)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !530, file: !525, line: 242, baseType: !130, size: 64, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !530, file: !525, line: 243, baseType: !49, size: 64, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !530, file: !525, line: 244, baseType: !47, size: 64, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !530, file: !525, line: 245, baseType: !47, size: 64, offset: 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !530, file: !525, line: 246, baseType: !50, size: 32, offset: 512)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !530, file: !525, line: 247, baseType: !50, size: 32, offset: 544)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !530, file: !525, line: 248, baseType: !52, size: 64, offset: 576)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !530, file: !525, line: 250, baseType: !523, size: 64, offset: 640)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !530, file: !525, line: 254, baseType: !549, size: 64, offset: 704)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !53, line: 35, baseType: !130)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !530, file: !525, line: 256, baseType: !52, size: 64, offset: 768)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !530, file: !525, line: 272, baseType: !51, size: 16, offset: 832)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !530, file: !525, line: 276, baseType: !51, size: 16, offset: 848)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !530, file: !525, line: 282, baseType: !51, size: 16, offset: 864)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !530, file: !525, line: 284, baseType: !555, size: 1024, offset: 896)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 1024, elements: !216)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !116, line: 44, size: 1024, elements: !557)
!557 = !{!558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !575, !576, !577}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !556, file: !116, line: 46, baseType: !95, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !556, file: !116, line: 47, baseType: !92, size: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !556, file: !116, line: 48, baseType: !121, size: 32, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !556, file: !116, line: 49, baseType: !123, size: 32, offset: 160)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !556, file: !116, line: 50, baseType: !73, size: 32, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !556, file: !116, line: 51, baseType: !77, size: 32, offset: 224)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !556, file: !116, line: 52, baseType: !95, size: 64, offset: 256)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !556, file: !116, line: 53, baseType: !95, size: 64, offset: 320)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !556, file: !116, line: 54, baseType: !129, size: 64, offset: 384)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !556, file: !116, line: 55, baseType: !132, size: 32, offset: 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !556, file: !116, line: 56, baseType: !50, size: 32, offset: 480)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !556, file: !116, line: 57, baseType: !135, size: 64, offset: 512)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !556, file: !116, line: 65, baseType: !571, size: 128, offset: 576)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !138, line: 11, size: 128, elements: !572)
!572 = !{!573, !574}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !571, file: !138, line: 16, baseType: !141, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !571, file: !138, line: 21, baseType: !143, size: 64, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !556, file: !116, line: 66, baseType: !571, size: 128, offset: 704)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !556, file: !116, line: 67, baseType: !571, size: 128, offset: 832)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !556, file: !116, line: 79, baseType: !147, size: 64, offset: 960)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !530, file: !525, line: 285, baseType: !579, offset: 1920)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: -1)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !526, file: !525, line: 117, baseType: !529, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !526, file: !525, line: 118, baseType: !584, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !526, file: !525, line: 119, baseType: !94, size: 64, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !526, file: !525, line: 120, baseType: !47, size: 64, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !526, file: !525, line: 121, baseType: !50, size: 32, offset: 320)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !526, file: !525, line: 122, baseType: !50, size: 32, offset: 352)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !526, file: !525, line: 124, baseType: !52, size: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !526, file: !525, line: 125, baseType: !52, size: 64, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !526, file: !525, line: 126, baseType: !592, size: 64, offset: 512)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!50, !595, !595}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !530)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !526, file: !525, line: 196, baseType: !50, size: 32, offset: 576)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !526, file: !525, line: 205, baseType: !600, size: 64, offset: 640)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !525, line: 205, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !526, file: !525, line: 227, baseType: !603, size: 64, offset: 704)
!603 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !526, file: !525, line: 207, size: 64, elements: !604)
!604 = !{!605, !606}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !603, file: !525, line: 220, baseType: !600, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !603, file: !525, line: 226, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !609, line: 32, size: 256, elements: !610)
!609 = !DIFile(filename: "./lib/cycle-check.h", directory: "/src", checksumkind: CSK_MD5, checksum: "5b1b442060400da72f41cd561f8be0ce")
!610 = !{!611, !616, !620}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !608, file: !609, line: 34, baseType: !612, size: 128)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !88, line: 30, size: 128, elements: !613)
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !612, file: !88, line: 32, baseType: !91, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !612, file: !88, line: 33, baseType: !94, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !608, file: !609, line: 35, baseType: !617, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !618, line: 102, baseType: !619)
!618 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !74, line: 73, baseType: !54)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !608, file: !609, line: 36, baseType: !50, size: 32, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !526, file: !525, line: 232, baseType: !622, size: 256, offset: 768)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !623, line: 47, baseType: !624)
!623 = !DIFile(filename: "./lib/i-ring.h", directory: "/src", checksumkind: CSK_MD5, checksum: "e5a837f066348a79b8b8c179c8da2a6d")
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !623, line: 39, size: 256, elements: !625)
!625 = !{!626, !628, !629, !630, !631}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !624, file: !623, line: 41, baseType: !627, size: 128)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 128, elements: !368)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !624, file: !623, line: 42, baseType: !50, size: 32, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !624, file: !623, line: 43, baseType: !7, size: 32, offset: 160)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !624, file: !623, line: 44, baseType: !7, size: 32, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !624, file: !623, line: 45, baseType: !69, size: 8, offset: 224)
!632 = !{!633}
!633 = !DILocalVariable(name: "fts", arg: 1, scope: !520, file: !519, line: 50, type: !523)
!634 = !{!635}
!635 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31)
!636 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !512, line: 635, baseType: !7, size: 32, elements: !637)
!637 = !{!638}
!638 = !DIEnumerator(name: "MIN_DIR_NLINK", value: 2)
!639 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !512, line: 638, baseType: !7, size: 32, elements: !640)
!640 = !{!641, !642}
!641 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0)
!642 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1)
!643 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !538, line: 97, baseType: !7, size: 32, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652, !653}
!645 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!646 = !DIEnumerator(name: "DT_FIFO", value: 1)
!647 = !DIEnumerator(name: "DT_CHR", value: 2)
!648 = !DIEnumerator(name: "DT_DIR", value: 4)
!649 = !DIEnumerator(name: "DT_BLK", value: 6)
!650 = !DIEnumerator(name: "DT_REG", value: 8)
!651 = !DIEnumerator(name: "DT_LNK", value: 10)
!652 = !DIEnumerator(name: "DT_SOCK", value: 12)
!653 = !DIEnumerator(name: "DT_WHT", value: 14)
!654 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !512, line: 154, baseType: !7, size: 32, elements: !655)
!655 = !{!656}
!656 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000)
!657 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !512, line: 676, baseType: !7, size: 32, elements: !658)
!658 = !{!659}
!659 = !DIEnumerator(name: "DEV_TYPE_HT_INITIAL_SIZE", value: 13)
!660 = !{!49, !617, !661, !662, !667}
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !618, line: 90, baseType: !54)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!50, !665, !665}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !525, line: 286, baseType: !530)
!671 = distinct !DICompileUnit(language: DW_LANG_C99, file: !672, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!672 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!673 = distinct !DICompileUnit(language: DW_LANG_C99, file: !674, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !675, splitDebugInlining: false, nameTableKind: None)
!674 = !DIFile(filename: "lib/i-ring.c", directory: "/src", checksumkind: CSK_MD5, checksum: "581251246a0cdfeb716d0893ef103e1d")
!675 = !{!676}
!676 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !623, line: 28, baseType: !7, size: 32, elements: !677)
!677 = !{!678}
!678 = !DIEnumerator(name: "I_RING_SIZE", value: 4)
!679 = distinct !DICompileUnit(language: DW_LANG_C99, file: !680, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !681, splitDebugInlining: false, nameTableKind: None)
!680 = !DIFile(filename: "lib/umaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "afa759af6e92fed26f32f683da6c23a8")
!681 = !{!617}
!682 = distinct !DICompileUnit(language: DW_LANG_C99, file: !683, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!683 = !DIFile(filename: "lib/next-prime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9e10a95d0a1244096fa4fe5ba361f714")
!684 = distinct !DICompileUnit(language: DW_LANG_C99, file: !685, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!685 = !DIFile(filename: "lib/openat-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "946ef6e8fdb1124c3d2ae8982ba6c16b")
!686 = distinct !DICompileUnit(language: DW_LANG_C99, file: !687, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!687 = !DIFile(filename: "lib/opendirat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9ae84c4c59278018f497b82d8ee5d941")
!688 = distinct !DICompileUnit(language: DW_LANG_C99, file: !689, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !690, splitDebugInlining: false, nameTableKind: None)
!689 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!690 = !{!69, !54, !49}
!691 = distinct !DICompileUnit(language: DW_LANG_C99, file: !692, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!692 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b0632229108c1521929601778d55996f")
!693 = distinct !DICompileUnit(language: DW_LANG_C99, file: !694, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!694 = !DIFile(filename: "lib/fd-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12c3310fb811f6ed0e0fb7e99c1b995b")
!695 = distinct !DICompileUnit(language: DW_LANG_C99, file: !696, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !697, retainedTypes: !706, splitDebugInlining: false, nameTableKind: None)
!696 = !DIFile(filename: "lib/userspec.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9b1d112c5d74602907b912457199dc83")
!697 = !{!698}
!698 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !699, line: 30, baseType: !7, size: 32, elements: !700)
!699 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!700 = !{!701, !702, !703, !704, !705}
!701 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!702 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!703 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!704 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!705 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!706 = !{!49, !71, !76}
!707 = distinct !DICompileUnit(language: DW_LANG_C99, file: !708, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !709, retainedTypes: !713, splitDebugInlining: false, nameTableKind: None)
!708 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!709 = !{!710}
!710 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !708, line: 40, baseType: !7, size: 32, elements: !711)
!711 = !{!712}
!712 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!713 = !{!49}
!714 = distinct !DICompileUnit(language: DW_LANG_C99, file: !715, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !716, retainedTypes: !746, splitDebugInlining: false, nameTableKind: None)
!715 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!716 = !{!717, !729}
!717 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !718, file: !715, line: 188, baseType: !7, size: 32, elements: !727)
!718 = distinct !DISubprogram(name: "x2nrealloc", scope: !715, file: !715, line: 176, type: !719, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !714, retainedNodes: !722)
!719 = !DISubroutineType(types: !720)
!720 = !{!49, !49, !721, !52}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!722 = !{!723, !724, !725, !726}
!723 = !DILocalVariable(name: "p", arg: 1, scope: !718, file: !715, line: 176, type: !49)
!724 = !DILocalVariable(name: "pn", arg: 2, scope: !718, file: !715, line: 176, type: !721)
!725 = !DILocalVariable(name: "s", arg: 3, scope: !718, file: !715, line: 176, type: !52)
!726 = !DILocalVariable(name: "n", scope: !718, file: !715, line: 178, type: !52)
!727 = !{!728}
!728 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!729 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !730, file: !715, line: 228, baseType: !7, size: 32, elements: !727)
!730 = distinct !DISubprogram(name: "xpalloc", scope: !715, file: !715, line: 223, type: !731, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !714, retainedNodes: !736)
!731 = !DISubroutineType(types: !732)
!732 = !{!49, !49, !733, !734, !549, !734}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !735, line: 130, baseType: !549)
!735 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!736 = !{!737, !738, !739, !740, !741, !742, !743, !744, !745}
!737 = !DILocalVariable(name: "pa", arg: 1, scope: !730, file: !715, line: 223, type: !49)
!738 = !DILocalVariable(name: "pn", arg: 2, scope: !730, file: !715, line: 223, type: !733)
!739 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !730, file: !715, line: 223, type: !734)
!740 = !DILocalVariable(name: "n_max", arg: 4, scope: !730, file: !715, line: 223, type: !549)
!741 = !DILocalVariable(name: "s", arg: 5, scope: !730, file: !715, line: 223, type: !734)
!742 = !DILocalVariable(name: "n0", scope: !730, file: !715, line: 230, type: !734)
!743 = !DILocalVariable(name: "n", scope: !730, file: !715, line: 237, type: !734)
!744 = !DILocalVariable(name: "nbytes", scope: !730, file: !715, line: 248, type: !734)
!745 = !DILocalVariable(name: "adjusted_nbytes", scope: !730, file: !715, line: 252, type: !734)
!746 = !{!47, !49, !69, !130, !54}
!747 = distinct !DICompileUnit(language: DW_LANG_C99, file: !748, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!748 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!749 = distinct !DICompileUnit(language: DW_LANG_C99, file: !750, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !713, splitDebugInlining: false, nameTableKind: None)
!750 = !DIFile(filename: "lib/xfts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84bc35d35364cd7c760cb21288203f20")
!751 = distinct !DICompileUnit(language: DW_LANG_C99, file: !752, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !753, retainedTypes: !754, splitDebugInlining: false, nameTableKind: None)
!752 = !DIFile(filename: "lib/xstrtoul.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2b318e5928e8382cfa3ae094c8d00222")
!753 = !{!698, !31}
!754 = !{!50, !51, !47, !69, !54}
!755 = distinct !DICompileUnit(language: DW_LANG_C99, file: !756, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!756 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!757 = distinct !DICompileUnit(language: DW_LANG_C99, file: !758, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!758 = !DIFile(filename: "lib/cycle-check.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9029e4490609d8d0ac3188f897240e9")
!759 = distinct !DICompileUnit(language: DW_LANG_C99, file: !760, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!760 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!761 = distinct !DICompileUnit(language: DW_LANG_C99, file: !762, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!762 = !DIFile(filename: "lib/open-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84efcad54206a8ffedf254f32134ee9c")
!763 = distinct !DICompileUnit(language: DW_LANG_C99, file: !764, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !713, splitDebugInlining: false, nameTableKind: None)
!764 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!765 = distinct !DICompileUnit(language: DW_LANG_C99, file: !766, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !713, splitDebugInlining: false, nameTableKind: None)
!766 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!767 = distinct !DICompileUnit(language: DW_LANG_C99, file: !768, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!768 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!769 = distinct !DICompileUnit(language: DW_LANG_C99, file: !770, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!770 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!771 = distinct !DICompileUnit(language: DW_LANG_C99, file: !772, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!772 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!773 = distinct !DICompileUnit(language: DW_LANG_C99, file: !774, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !713, splitDebugInlining: false, nameTableKind: None)
!774 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!775 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!776 = !{i32 7, !"Dwarf Version", i32 5}
!777 = !{i32 2, !"Debug Info Version", i32 3}
!778 = !{i32 1, !"wchar_size", i32 4}
!779 = !{i32 1, !"branch-target-enforcement", i32 0}
!780 = !{i32 1, !"sign-return-address", i32 0}
!781 = !{i32 1, !"sign-return-address-all", i32 0}
!782 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!783 = !{i32 7, !"PIC Level", i32 2}
!784 = !{i32 7, !"PIE Level", i32 2}
!785 = !{i32 7, !"uwtable", i32 1}
!786 = !{i32 7, !"frame-pointer", i32 1}
!787 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 73, type: !788, scopeLine: 74, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !790)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !50}
!790 = !{!791}
!791 = !DILocalVariable(name: "status", arg: 1, scope: !787, file: !3, line: 73, type: !50)
!792 = !DILocation(line: 0, scope: !787)
!793 = !DILocation(line: 75, column: 14, scope: !794)
!794 = distinct !DILexicalBlock(scope: !787, file: !3, line: 75, column: 7)
!795 = !DILocation(line: 75, column: 7, scope: !787)
!796 = !DILocation(line: 76, column: 5, scope: !797)
!797 = distinct !DILexicalBlock(scope: !794, file: !3, line: 76, column: 5)
!798 = !{!799, !799, i64 0}
!799 = !{!"any pointer", !800, i64 0}
!800 = !{!"omnipotent char", !801, i64 0}
!801 = !{!"Simple C/C++ TBAA"}
!802 = !DILocation(line: 79, column: 7, scope: !803)
!803 = distinct !DILexicalBlock(scope: !794, file: !3, line: 78, column: 5)
!804 = !{!800, !800, i64 0}
!805 = !DILocation(line: 86, column: 11, scope: !806)
!806 = distinct !DILexicalBlock(scope: !803, file: !3, line: 86, column: 11)
!807 = !DILocation(line: 86, column: 22, scope: !806)
!808 = !DILocation(line: 86, column: 11, scope: !803)
!809 = !DILocation(line: 0, scope: !806)
!810 = !DILocation(line: 98, column: 7, scope: !803)
!811 = !DILocation(line: 102, column: 7, scope: !803)
!812 = !DILocation(line: 106, column: 7, scope: !803)
!813 = !DILocation(line: 110, column: 7, scope: !803)
!814 = !DILocation(line: 115, column: 7, scope: !803)
!815 = !DILocation(line: 120, column: 7, scope: !803)
!816 = !DILocation(line: 127, column: 7, scope: !803)
!817 = !DILocation(line: 131, column: 7, scope: !803)
!818 = !DILocation(line: 135, column: 7, scope: !803)
!819 = !DILocation(line: 140, column: 7, scope: !803)
!820 = !DILocation(line: 144, column: 7, scope: !803)
!821 = !DILocalVariable(name: "program", arg: 1, scope: !822, file: !163, line: 799, type: !55)
!822 = distinct !DISubprogram(name: "emit_symlink_recurse_options_", scope: !163, file: !163, line: 799, type: !164, scopeLine: 800, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !823)
!823 = !{!821, !824}
!824 = !DILocalVariable(name: "default_opt", arg: 2, scope: !822, file: !163, line: 799, type: !55)
!825 = !DILocation(line: 0, scope: !822, inlinedAt: !826)
!826 = distinct !DILocation(line: 144, column: 7, scope: !803)
!827 = !DILocation(line: 801, column: 7, scope: !822, inlinedAt: !826)
!828 = !DILocation(line: 808, column: 24, scope: !822, inlinedAt: !826)
!829 = !DILocation(line: 808, column: 7, scope: !822, inlinedAt: !826)
!830 = !DILocation(line: 812, column: 24, scope: !822, inlinedAt: !826)
!831 = !DILocation(line: 812, column: 7, scope: !822, inlinedAt: !826)
!832 = !DILocation(line: 816, column: 24, scope: !822, inlinedAt: !826)
!833 = !DILocation(line: 816, column: 7, scope: !822, inlinedAt: !826)
!834 = !DILocation(line: 145, column: 7, scope: !803)
!835 = !DILocation(line: 146, column: 7, scope: !803)
!836 = !DILocation(line: 147, column: 11, scope: !837)
!837 = distinct !DILexicalBlock(scope: !803, file: !3, line: 147, column: 11)
!838 = !DILocation(line: 147, column: 22, scope: !837)
!839 = !DILocation(line: 147, column: 11, scope: !803)
!840 = !DILocation(line: 148, column: 9, scope: !837)
!841 = !DILocation(line: 155, column: 11, scope: !842)
!842 = distinct !DILexicalBlock(scope: !803, file: !3, line: 155, column: 11)
!843 = !DILocation(line: 155, column: 22, scope: !842)
!844 = !DILocation(line: 155, column: 11, scope: !803)
!845 = !DILocation(line: 156, column: 9, scope: !842)
!846 = !DILocation(line: 165, column: 9, scope: !842)
!847 = !DILocation(line: 172, column: 28, scope: !803)
!848 = !DILocalVariable(name: "program", arg: 1, scope: !849, file: !163, line: 836, type: !55)
!849 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !163, file: !163, line: 836, type: !850, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !852)
!850 = !DISubroutineType(types: !851)
!851 = !{null, !55}
!852 = !{!848, !853, !862, !863, !865, !866}
!853 = !DILocalVariable(name: "infomap", scope: !849, file: !163, line: 838, type: !854)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !855, size: 896, elements: !860)
!855 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !849, file: !163, line: 838, size: 128, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !856, file: !163, line: 838, baseType: !55, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !856, file: !163, line: 838, baseType: !55, size: 64, offset: 64)
!860 = !{!861}
!861 = !DISubrange(count: 7)
!862 = !DILocalVariable(name: "node", scope: !849, file: !163, line: 848, type: !55)
!863 = !DILocalVariable(name: "map_prog", scope: !849, file: !163, line: 849, type: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!865 = !DILocalVariable(name: "lc_messages", scope: !849, file: !163, line: 861, type: !55)
!866 = !DILocalVariable(name: "url_program", scope: !849, file: !163, line: 874, type: !55)
!867 = !DILocation(line: 0, scope: !849, inlinedAt: !868)
!868 = distinct !DILocation(line: 172, column: 7, scope: !803)
!869 = !DILocation(line: 838, column: 3, scope: !849, inlinedAt: !868)
!870 = !DILocation(line: 838, column: 67, scope: !849, inlinedAt: !868)
!871 = !DILocation(line: 849, column: 36, scope: !849, inlinedAt: !868)
!872 = !DILocation(line: 851, column: 3, scope: !849, inlinedAt: !868)
!873 = !DILocalVariable(name: "__s1", arg: 1, scope: !874, file: !875, line: 1359, type: !55)
!874 = distinct !DISubprogram(name: "streq", scope: !875, file: !875, line: 1359, type: !876, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !878)
!875 = !DIFile(filename: "./lib/string.h", directory: "/src")
!876 = !DISubroutineType(types: !877)
!877 = !{!69, !55, !55}
!878 = !{!873, !879}
!879 = !DILocalVariable(name: "__s2", arg: 2, scope: !874, file: !875, line: 1359, type: !55)
!880 = !DILocation(line: 0, scope: !874, inlinedAt: !881)
!881 = distinct !DILocation(line: 851, column: 33, scope: !849, inlinedAt: !868)
!882 = !DILocation(line: 1361, column: 11, scope: !874, inlinedAt: !881)
!883 = !DILocation(line: 1361, column: 10, scope: !874, inlinedAt: !881)
!884 = !DILocation(line: 852, column: 13, scope: !849, inlinedAt: !868)
!885 = !DILocation(line: 851, column: 20, scope: !849, inlinedAt: !868)
!886 = !{!887, !799, i64 0}
!887 = !{!"infomap", !799, i64 0, !799, i64 8}
!888 = !DILocation(line: 851, column: 10, scope: !849, inlinedAt: !868)
!889 = !DILocation(line: 851, column: 28, scope: !849, inlinedAt: !868)
!890 = distinct !{!890, !872, !884, !891}
!891 = !{!"llvm.loop.mustprogress"}
!892 = !DILocation(line: 854, column: 17, scope: !893, inlinedAt: !868)
!893 = distinct !DILexicalBlock(scope: !849, file: !163, line: 854, column: 7)
!894 = !{!887, !799, i64 8}
!895 = !DILocation(line: 854, column: 7, scope: !893, inlinedAt: !868)
!896 = !DILocation(line: 854, column: 7, scope: !849, inlinedAt: !868)
!897 = !DILocation(line: 857, column: 3, scope: !849, inlinedAt: !868)
!898 = !DILocation(line: 861, column: 29, scope: !849, inlinedAt: !868)
!899 = !DILocation(line: 862, column: 7, scope: !900, inlinedAt: !868)
!900 = distinct !DILexicalBlock(scope: !849, file: !163, line: 862, column: 7)
!901 = !DILocation(line: 862, column: 19, scope: !900, inlinedAt: !868)
!902 = !DILocation(line: 862, column: 22, scope: !900, inlinedAt: !868)
!903 = !DILocation(line: 862, column: 7, scope: !849, inlinedAt: !868)
!904 = !DILocation(line: 868, column: 7, scope: !905, inlinedAt: !868)
!905 = distinct !DILexicalBlock(scope: !900, file: !163, line: 863, column: 5)
!906 = !DILocation(line: 870, column: 5, scope: !905, inlinedAt: !868)
!907 = !DILocation(line: 0, scope: !874, inlinedAt: !908)
!908 = distinct !DILocation(line: 874, column: 29, scope: !849, inlinedAt: !868)
!909 = !DILocation(line: 1361, column: 11, scope: !874, inlinedAt: !908)
!910 = !DILocation(line: 1361, column: 10, scope: !874, inlinedAt: !908)
!911 = !DILocation(line: 874, column: 29, scope: !849, inlinedAt: !868)
!912 = !DILocation(line: 875, column: 3, scope: !849, inlinedAt: !868)
!913 = !DILocation(line: 877, column: 3, scope: !849, inlinedAt: !868)
!914 = !DILocation(line: 879, column: 1, scope: !849, inlinedAt: !868)
!915 = !DILocation(line: 174, column: 3, scope: !787)
!916 = !DISubprogram(name: "dcgettext", scope: !917, file: !917, line: 51, type: !918, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !920)
!917 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!918 = !DISubroutineType(types: !919)
!919 = !{!47, !55, !55, !50}
!920 = !{}
!921 = !DISubprogram(name: "fputs_unlocked", scope: !285, file: !285, line: 691, type: !922, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !920)
!922 = !DISubroutineType(types: !923)
!923 = !{!50, !924, !925}
!924 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !55)
!925 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !185)
!926 = !DILocation(line: 0, scope: !162)
!927 = !DILocation(line: 581, column: 7, scope: !171)
!928 = !{!929, !929, i64 0}
!929 = !{!"int", !800, i64 0}
!930 = !DILocation(line: 581, column: 19, scope: !171)
!931 = !DILocation(line: 581, column: 7, scope: !162)
!932 = !DILocation(line: 585, column: 26, scope: !170)
!933 = !DILocation(line: 0, scope: !170)
!934 = !DILocation(line: 586, column: 23, scope: !170)
!935 = !DILocation(line: 586, column: 28, scope: !170)
!936 = !DILocation(line: 586, column: 32, scope: !170)
!937 = !DILocation(line: 586, column: 38, scope: !170)
!938 = !DILocation(line: 0, scope: !874, inlinedAt: !939)
!939 = distinct !DILocation(line: 586, column: 41, scope: !170)
!940 = !DILocation(line: 1361, column: 11, scope: !874, inlinedAt: !939)
!941 = !DILocation(line: 1361, column: 10, scope: !874, inlinedAt: !939)
!942 = !DILocation(line: 586, column: 19, scope: !170)
!943 = !DILocation(line: 587, column: 5, scope: !170)
!944 = !DILocation(line: 588, column: 7, scope: !945)
!945 = distinct !DILexicalBlock(scope: !162, file: !163, line: 588, column: 7)
!946 = !DILocation(line: 588, column: 7, scope: !162)
!947 = !DILocation(line: 590, column: 7, scope: !948)
!948 = distinct !DILexicalBlock(scope: !945, file: !163, line: 589, column: 5)
!949 = !DILocation(line: 591, column: 7, scope: !948)
!950 = !DILocation(line: 595, column: 37, scope: !162)
!951 = !DILocation(line: 595, column: 35, scope: !162)
!952 = !DILocation(line: 596, column: 29, scope: !162)
!953 = !DILocation(line: 597, column: 8, scope: !178)
!954 = !DILocation(line: 597, column: 7, scope: !162)
!955 = !DILocation(line: 604, column: 24, scope: !177)
!956 = !DILocation(line: 604, column: 12, scope: !178)
!957 = !DILocation(line: 0, scope: !176)
!958 = !DILocation(line: 610, column: 16, scope: !176)
!959 = !DILocation(line: 610, column: 7, scope: !176)
!960 = !DILocation(line: 611, column: 21, scope: !176)
!961 = !{!962, !962, i64 0}
!962 = !{!"short", !800, i64 0}
!963 = !DILocation(line: 611, column: 19, scope: !176)
!964 = !DILocation(line: 611, column: 16, scope: !176)
!965 = !DILocation(line: 610, column: 30, scope: !176)
!966 = distinct !{!966, !959, !960, !891}
!967 = !DILocation(line: 612, column: 18, scope: !968)
!968 = distinct !DILexicalBlock(scope: !176, file: !163, line: 612, column: 11)
!969 = !DILocation(line: 612, column: 11, scope: !176)
!970 = !DILocation(line: 618, column: 5, scope: !176)
!971 = !DILocation(line: 620, column: 23, scope: !162)
!972 = !DILocation(line: 625, column: 39, scope: !162)
!973 = !DILocation(line: 626, column: 3, scope: !162)
!974 = !DILocation(line: 626, column: 10, scope: !162)
!975 = !DILocation(line: 626, column: 21, scope: !162)
!976 = !DILocation(line: 628, column: 44, scope: !977)
!977 = distinct !DILexicalBlock(scope: !978, file: !163, line: 628, column: 11)
!978 = distinct !DILexicalBlock(scope: !162, file: !163, line: 627, column: 5)
!979 = !DILocation(line: 628, column: 32, scope: !977)
!980 = !DILocation(line: 628, column: 49, scope: !977)
!981 = !DILocation(line: 628, column: 11, scope: !978)
!982 = !DILocation(line: 630, column: 11, scope: !983)
!983 = distinct !DILexicalBlock(scope: !978, file: !163, line: 630, column: 11)
!984 = !DILocation(line: 630, column: 11, scope: !978)
!985 = !DILocation(line: 632, column: 26, scope: !986)
!986 = distinct !DILexicalBlock(scope: !987, file: !163, line: 632, column: 15)
!987 = distinct !DILexicalBlock(scope: !983, file: !163, line: 631, column: 9)
!988 = !DILocation(line: 632, column: 34, scope: !986)
!989 = !DILocation(line: 632, column: 37, scope: !986)
!990 = !DILocation(line: 632, column: 15, scope: !987)
!991 = !DILocation(line: 636, column: 29, scope: !992)
!992 = distinct !DILexicalBlock(scope: !987, file: !163, line: 636, column: 15)
!993 = !DILocation(line: 640, column: 16, scope: !978)
!994 = distinct !{!994, !973, !995, !891}
!995 = !DILocation(line: 641, column: 5, scope: !162)
!996 = !DILocation(line: 644, column: 3, scope: !162)
!997 = !DILocation(line: 0, scope: !874, inlinedAt: !998)
!998 = distinct !DILocation(line: 648, column: 31, scope: !162)
!999 = !DILocation(line: 1361, column: 11, scope: !874, inlinedAt: !998)
!1000 = !DILocation(line: 1361, column: 10, scope: !874, inlinedAt: !998)
!1001 = !DILocation(line: 648, column: 31, scope: !162)
!1002 = !DILocation(line: 0, scope: !874, inlinedAt: !1003)
!1003 = distinct !DILocation(line: 649, column: 31, scope: !162)
!1004 = !DILocation(line: 1361, column: 11, scope: !874, inlinedAt: !1003)
!1005 = !DILocation(line: 1361, column: 10, scope: !874, inlinedAt: !1003)
!1006 = !DILocation(line: 649, column: 31, scope: !162)
!1007 = !DILocation(line: 0, scope: !874, inlinedAt: !1008)
!1008 = distinct !DILocation(line: 650, column: 31, scope: !162)
!1009 = !DILocation(line: 1361, column: 11, scope: !874, inlinedAt: !1008)
!1010 = !DILocation(line: 1361, column: 10, scope: !874, inlinedAt: !1008)
!1011 = !DILocation(line: 650, column: 31, scope: !162)
!1012 = !DILocation(line: 0, scope: !874, inlinedAt: !1013)
!1013 = distinct !DILocation(line: 651, column: 31, scope: !162)
!1014 = !DILocation(line: 1361, column: 11, scope: !874, inlinedAt: !1013)
!1015 = !DILocation(line: 1361, column: 10, scope: !874, inlinedAt: !1013)
!1016 = !DILocation(line: 651, column: 31, scope: !162)
!1017 = !DILocation(line: 0, scope: !874, inlinedAt: !1018)
!1018 = distinct !DILocation(line: 652, column: 31, scope: !162)
!1019 = !DILocation(line: 1361, column: 11, scope: !874, inlinedAt: !1018)
!1020 = !DILocation(line: 1361, column: 10, scope: !874, inlinedAt: !1018)
!1021 = !DILocation(line: 652, column: 31, scope: !162)
!1022 = !DILocation(line: 0, scope: !874, inlinedAt: !1023)
!1023 = distinct !DILocation(line: 653, column: 31, scope: !162)
!1024 = !DILocation(line: 1361, column: 11, scope: !874, inlinedAt: !1023)
!1025 = !DILocation(line: 1361, column: 10, scope: !874, inlinedAt: !1023)
!1026 = !DILocation(line: 653, column: 31, scope: !162)
!1027 = !DILocation(line: 0, scope: !874, inlinedAt: !1028)
!1028 = distinct !DILocation(line: 654, column: 31, scope: !162)
!1029 = !DILocation(line: 1361, column: 11, scope: !874, inlinedAt: !1028)
!1030 = !DILocation(line: 1361, column: 10, scope: !874, inlinedAt: !1028)
!1031 = !DILocation(line: 654, column: 31, scope: !162)
!1032 = !DILocation(line: 0, scope: !874, inlinedAt: !1033)
!1033 = distinct !DILocation(line: 655, column: 31, scope: !162)
!1034 = !DILocation(line: 1361, column: 11, scope: !874, inlinedAt: !1033)
!1035 = !DILocation(line: 1361, column: 10, scope: !874, inlinedAt: !1033)
!1036 = !DILocation(line: 655, column: 31, scope: !162)
!1037 = !DILocation(line: 0, scope: !874, inlinedAt: !1038)
!1038 = distinct !DILocation(line: 656, column: 31, scope: !162)
!1039 = !DILocation(line: 1361, column: 11, scope: !874, inlinedAt: !1038)
!1040 = !DILocation(line: 1361, column: 10, scope: !874, inlinedAt: !1038)
!1041 = !DILocation(line: 656, column: 31, scope: !162)
!1042 = !DILocation(line: 0, scope: !874, inlinedAt: !1043)
!1043 = distinct !DILocation(line: 657, column: 31, scope: !162)
!1044 = !DILocation(line: 1361, column: 11, scope: !874, inlinedAt: !1043)
!1045 = !DILocation(line: 1361, column: 10, scope: !874, inlinedAt: !1043)
!1046 = !DILocation(line: 657, column: 31, scope: !162)
!1047 = !DILocation(line: 663, column: 7, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !162, file: !163, line: 663, column: 7)
!1049 = !DILocation(line: 664, column: 7, scope: !1048)
!1050 = !DILocation(line: 664, column: 10, scope: !1048)
!1051 = !DILocation(line: 663, column: 7, scope: !162)
!1052 = !DILocation(line: 669, column: 7, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1048, file: !163, line: 665, column: 5)
!1054 = !DILocation(line: 671, column: 5, scope: !1053)
!1055 = !DILocation(line: 676, column: 7, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1048, file: !163, line: 673, column: 5)
!1057 = !DILocation(line: 679, column: 3, scope: !162)
!1058 = !DILocation(line: 683, column: 3, scope: !162)
!1059 = !DILocation(line: 686, column: 3, scope: !162)
!1060 = !DILocation(line: 688, column: 3, scope: !162)
!1061 = !DILocation(line: 691, column: 3, scope: !162)
!1062 = !DILocation(line: 695, column: 3, scope: !162)
!1063 = !DILocation(line: 696, column: 1, scope: !162)
!1064 = !DISubprogram(name: "setlocale", scope: !1065, file: !1065, line: 122, type: !1066, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !920)
!1065 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!47, !50, !55}
!1068 = !DISubprogram(name: "getenv", scope: !1069, file: !1069, line: 641, type: !1070, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !920)
!1069 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!47, !55}
!1072 = !DISubprogram(name: "fwrite_unlocked", scope: !285, file: !285, line: 704, type: !1073, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !920)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!52, !1075, !52, !52, !925}
!1075 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !665)
!1076 = !DILocation(line: 0, scope: !61)
!1077 = !DILocation(line: 184, column: 3, scope: !61)
!1078 = !DILocation(line: 184, column: 9, scope: !61)
!1079 = !DILocation(line: 185, column: 3, scope: !61)
!1080 = !DILocation(line: 185, column: 9, scope: !61)
!1081 = !DILocation(line: 194, column: 3, scope: !61)
!1082 = !DILocation(line: 194, column: 23, scope: !61)
!1083 = !DILocation(line: 197, column: 21, scope: !61)
!1084 = !DILocation(line: 197, column: 3, scope: !61)
!1085 = !DILocation(line: 198, column: 3, scope: !61)
!1086 = !DILocation(line: 199, column: 3, scope: !61)
!1087 = !DILocation(line: 200, column: 3, scope: !61)
!1088 = !DILocation(line: 202, column: 3, scope: !61)
!1089 = !DILocation(line: 204, column: 3, scope: !61)
!1090 = !DILocation(line: 207, column: 3, scope: !61)
!1091 = !DILocation(line: 192, column: 7, scope: !61)
!1092 = !DILocation(line: 188, column: 7, scope: !61)
!1093 = !DILocation(line: 207, column: 18, scope: !61)
!1094 = distinct !{!1094, !1090, !1095, !891}
!1095 = !DILocation(line: 277, column: 5, scope: !61)
!1096 = !DILocation(line: 218, column: 11, scope: !103)
!1097 = !DILocation(line: 222, column: 11, scope: !103)
!1098 = !DILocation(line: 226, column: 11, scope: !103)
!1099 = !DILocation(line: 231, column: 11, scope: !103)
!1100 = !DILocation(line: 235, column: 11, scope: !103)
!1101 = !DILocation(line: 239, column: 11, scope: !103)
